{
  "url": "https://www.nytimes.com/athletic/7015290/2026/02/02/chelsea-mamadou-sarr-strasbourg-recall/",
  "scraped_at": "2026-02-04T18:07:15.909748",
  "title": "Chelsea recall defender Mamadou Sarr from Strasbourg loan",
  "author": "",
  "published_date": "Feb. 3, 2026",
  "content": "Chelsea have recalled centre-back Mamadou Sarr from his loan spell at Strasbourg.\n\nSarr, 20, joined Chelsea from Strasbourg in the summer of 2025 after a €14million (£11.9m; $14.4m) deal was agreed the previous January. He then returned to the French club on a season-long loan in August.\n\nThe defender spent a season and a half playing under Chelsea head coach Liam Rosenior at Strasbourg, who like the west London side are controlled by multi-club ownership group BlueCo. Rosenior was appointed Enzo Maresca’s successor at Chelsea in January.\n\nSarr has made 18 appearances in all competitions for Strasbourg this season and has regularly captained the side, including during the defeat to Paris Saint-Germain on Sunday. His Chelsea contract runs until 2033.\n\nSarr was part of the Senegal side that won the 2025 Africa Cup of Nations in January and he played the full 120 minutes of the victory over Morocco in the final. He has been capped five times at international level.\n\nChelsea had held talks with Rennes over a deal for 20-year-old defender Jeremy Jacquet in January. The Athletic reported on Sunday Liverpool had agreed a deal for the signing of the centre-back in the summer.\n\nChelsea have also confirmed that defender Aaron Anselmino has joined Strasbourg on loan for the rest of the season. The 20-year-old spent the first half of the season on loan at Borussia Dortmund, where he made ten appearances in all competitions.\n\nMamadou Sarr was always going to be a part of the first team squad this year — the plan has just been brought forward by five months.\n\nSarr was sent back to Strasbourg on a season-long loan having officially completed a €14million move from the Ligue 1 club to Stamford Bridge in the summer.\n\nThe aim was to give him another full campaign of regular game time before making him part of the Chelsea side.\n\nChelsea have decided to act now because they want another centre back option — their pursuit of Rennes defender Jeremy Jacquet shows that, but he has chosen Liverpool instead and even that is on the proviso of moving in the next window.\n\nWith Chelsea still competing on four fronts, they need someone else to help share the workload now. Wesley Fofana’s minutes are having to be managed due to the various injury issues he has suffered since joining in 2022. Tosin Adarabioyo is currently out with a hamstring problem and has struggled for form in 2025-26. Benoit Badiashile, who was substituted at half-time of Chelsea’s 3-2 win over West Ham, has also underwhelmed.\n\nSignificantly, new head coach Liam Rosenior knows Sarr very well and rates the 20-year-old highly having worked with him while in charge of Strasbourg for the past 18 months.\n\nThat will help ensure he settles into the set-up quickly.",
  "paragraph_count": 14
}