{
  "url": "https://www.nytimes.com/athletic/7015204/2026/02/02/jorgen-strand-larsen-crystal-palace-wolves-transfer-complete-news/",
  "scraped_at": "2026-02-04T18:07:08.586417",
  "title": "Crystal Palace complete signing of Jorgen Strand Larsen from Wolves",
  "author": "",
  "published_date": "Feb. 3, 2026",
  "content": "Crystal Palace have completed the signing of forward Jorgen Strand Larsen from Wolverhampton Wanderers.\n\nThe 25-year-old has signed a four-and-a-half-year contract at Selhurst Park, with the option to extend the deal by a further 12 months.\n\nThe Athletic reported on Sunday that Wolves had accepted a bid of £43million ($58.9m) plus £5m in add-ons from Palace for the Norway international striker. He becomes their third arrival of the January window.\n\nStrand Larsen’s signing comes despite Serie A side AC Milan pulling out of a move for Palace striker Jean-Philippe Mateta earlier today.\n\nStrand Larsen has been the subject of interest from several Premier League clubs in recent months. He was part of a four-striker shortlist at Nottingham Forest, while Leeds United made a bid earlier in the window. West Ham United expressed an interest in Strand Larsen in December.\n\nNewcastle United pursued the striker last summer, seeing bids of £50m and £55m rejected, before eventually signing Nick Woltemade and Yoane Wissa.\n\nStrand Larsen made 26 appearances in all competitions for Wolves this season, scoring six goals, though just one of those has come in the Premier League, with Wolves at the bottom of the table.\n\nHe joined Wolves in July 2024 from Spanish club Celta Vigo on loan, scoring 14 league goals in his first season at Molineux. He joined the club permanently the following summer for €27m and signed a new five-year contract in September.\n\nIt had looked like Strand Larsen’s move was dependent on the future of Mateta. The Athletic reported earlier on Monday that the 28-year-old was set to undergo further medical tests in London after the two sides agreed a deal worth more than €30million (£26m; $35.6m) for the forward the day before. Those medical checks prompted the Italian side to walk away from the deal.",
  "paragraph_count": 9
}