{
  "url": "https://www.nytimes.com/athletic/7016315/2026/02/02/dwight-mcneil-crystal-palace-everton-transfer/",
  "scraped_at": "2026-02-04T18:07:01.513319",
  "title": "Crystal Palace move for Everton’s Dwight McNeil off as paperwork not completed in time",
  "author": "",
  "published_date": "Feb. 3, 2026",
  "content": "Dwight McNeil will not be leaving Everton this window due to the relevant paperwork for his proposed move to Crystal Palace not being completed on time.\n\nThe Athletic reported earlier on Monday that Palace were proposing an initial loan deal with an obligation to buy the winger worth £20million.\n\nMcNeil, 26, completed his medical at Palace, who submitted a deal sheet before Monday’s 7pm transfer deadline but the south-London club withdrew their offer before 9pm.\n\nIt followed Jean-Philippe Mateta’s proposed departure from Selhurst Park collapsing, with Palace later pulling out of the McNeil arrangement.\n\nMcNeil shared a lengthy Instagram post from his partner Megan Sharpley in the early hours of Tuesday morning, which read: “(To have something) torn away from you at the last second, with absolutely no explanation. Going from everything — to radio silence, no phone call, no communication, and be left, broken hearted with nothing but confusion hurts more than I can say.”\n\nMcNeil wrote: “While even now I’m still left in the dark. What I do know, and have been supported with, I am an Everton player. I will use this as motivation.”\n\nMcNeil has made 18 appearances in all competitions for Everton this season, providing one assist, but has started just seven times in the Premier League.\n\nThe attacker joined the club from Burnley in 2022 and he has made 120 appearances for the club, scoring 15 goals and adding 19 assists.\n\nPalace made multiple additions in attack during the January window, signing Brennan Johnson from Tottenham Hotspur for a fee approaching £35million, a club-record fee at the time.\n\nPalace broke their transfer record for a second time this window on deadline day after completing the signing of striker Jorgen Strand Larsen from Wolverhampton Wanderers, with the deal consisting of a £43m fee plus £5m in add-ons.\n\nEvan Guessand also arrived on loan from Aston Villa, with the deal including the option to make the move permanent for £28m.",
  "paragraph_count": 11
}