{
  "url": "https://www.nytimes.com/athletic/7017734/2026/02/03/sandro-tonali-newcastle-eddie-howe/",
  "scraped_at": "2026-02-04T18:06:07.084367",
  "title": "Eddie Howe holds Sandro Tonali talks: ‘He’s absolutely focused’ on Newcastle",
  "author": "",
  "published_date": "Feb. 3, 2026 6:20 pm GMT+8",
  "content": "Eddie Howe has held talks with Sandro Tonali after the Italy international was linked with a move to Arsenal and has insisted the midfielder is fully committed to Newcastle United.\n\nThe Athletic reported on transfer deadline day that Tonali’s representatives had offered the 25-year-old to Arsenal’s sporting director Andrea Berta but there was no contact between the clubs.\n\n“Sandro’s absolutely fine,” Howe told a press conference on Tuesday before Newcastle’s Carabao Cup semi-final second leg away to Manchester City.\n\n“I had discussions with Sandro yesterday. He’s absolutely focused on the here, the now, playing for us. His only focus talking to him yesterday was Manchester City and trying to win that game. So there’s absolutely no issue with Sandro himself and he’s very happy and he’s committed.”\n\nAfter a summer where Alexander Isak belatedly joined Liverpool after refusing to train and play for Howe’s team, the concern amongst supporters is that this might be the starting gun for a similar scenario with Tonali, whose form has dipped from his own high standards this season.\n\n“I don’t think so, but lots of things happen without my knowledge,” Howe said. “As far as I’m aware, we’ve got a player that’s an outstanding footballer, an outstanding person. He’s very happy here, he’s got a great relationship with me, his team-mates and he seems really, really happy within himself. So, that would surprise me, but I think he’s always going to be attracting, or our best players will always be attracting, glances from other clubs. That’s just the reality of football.\n\n“We want to keep the group together. We want to keep being progressive. And, of course, Sandro plays a part in that, trying to hit his best levels and play as well as he can to help the team. So, all encompassed, I don’t see an issue. But, as I say, I’m not in control of everything. There were certainly no intention at all from our side to lose Sandro.”\n\nUnlike the summer window, when Newcastle were dealing with Liverpool’s interest in Isak without a chief executive and a sporting director, the club now have both positions filled.\n\n“In the summer, we didn’t have a sporting director, which massively impacted our way of working in terms of dealing with agents and dealing with that situation,” Howe said.\n\n“We were in a more vulnerable position than we are now. Obviously, Ross (Wilson) has filled that position and is showing really good leadership, dealing with transfers and all the things that position entails in a much calmer, clearer way.”\n\nNot for the first time in recent history, Newcastle ended the window without making a senior signing. Given that they are still – for now – competing on four fronts and have been afflicted by injuries, particularly in defence, it was put to Howe that this represents a risk.\n\n“Yes, but I have to choose my words carefully here,” Howe said. “We were left with no other option, really. I think every decision we make has a long-term implication. So there’s no guarantee even signing someone with the funds that we had available would help us short-term anyway. So it is what it is.\n\n“We’ve been used to sort of working in these conditions now for a while. I think we’ve only been active in one transfer window out of the last four or five. So I think we’re under financial restrictions. It wasn’t possible for us. We have to be really, really smart and we’ve decided to wait till the summer.”\n\nHowe admitted that Bruno Guimaraes, his captain, and Lewis Miley, his fellow midfielder, were unlikely to make the City game, where Newcastle are seeking to overturn a 2-0 deficit.",
  "paragraph_count": 14
}