{
  "url": "https://www.nytimes.com/athletic/7015819/2026/02/02/fanatics-david-beckham-partnership/",
  "scraped_at": "2026-02-04T18:07:28.662316",
  "title": "Fanatics announces exclusive partnership with David Beckham amid soccer card push",
  "author": "",
  "published_date": "Feb. 3, 2026",
  "content": "Fanatics announced an exclusive partnership with David Beckham Monday, a deal that will include “autographed and inscribed memorabilia and trading cards, appearances, meet-and-greet moments and more,” according to the company. This marks the latest step in the international growth of Fanatics’ collectibles business and another big get in the company’s ongoing battle with Panini, with whom Beckham previously had an exclusive autograph and memorabilia deal since 2021.\n\nThe new agreement is the first time Topps, which is owned by Fanatics, has worked with Beckham beyond featuring his images on cards. However, the company has long been eager to do more with him.\n\n“He’s as relevant now as he was as a player, so we could not be more excited to have him joining us,” Fanatics Collectibles president of trading cards David Leiner said. “This is one of the biggest global stars in the sport and beloved all over.”\n\nThe first card set under the new deal will be 2026 Topps Chrome Premier League, which hits stores Feb. 5. Topps recently reacquired the exclusive Premier League trading card license after Panini had it for nearly a decade.\n\n“(Beckham will) be featured throughout the set, from the base set to inserts, autographs, etc.” Leiner said. “He’ll be slated across our Champions League products, our Premier League products. Obviously, he played in the MLS as well, where we hold the rights, so you can look for David featured all across the board.”\n\nAs Topps drives the trading card industry’s growing interest in game-worn memorabilia — such as the Debut Patch and Gold Logoman — Leiner says some unique Beckham-used items will be integrated into products as well, even if someone has to dig through Beckham’s closet to find them.\n\n“With David, we have to go backward and see what items are out there, what’s available, what we can procure and ensure we have the right provenance from those (milestone) events, but we’re hoping to bring some of those really nice items to bear,” Leiner said. “But we’ll have really cool inscriptions, we’ll have a bunch of fun stuff, but we are seeing if we can try to find some cool stuff. And David has a lot of his own stuff too, in storage, all of that, we’ve got to sift through and see if there’s some cool items there.”\n\nBeyond the soccer-specific products, Leiner also teased cross-sport possibilities, now that Fanatics holds similar deals with other all-time greats like LeBron James, Tom Brady and more.\n\nAlthough Panini retains the exclusive FIFA/World Cup trading card and sticker license through the 2030 edition of the men’s tournament, Fanatics has been ramping up its efforts in the sport (which includes Premier League, UEFA, MLS and Bundesliga licenses, as well as individual teams like FC Barcelona and Argentina’s national team) in an attempt to grow the number of collectors internationally.\n\nThe opening of a flagship Fanatics Collectible store in London last year was just an early step in a wider push that now includes Beckham. In a separate part of Fanatics’ business that could be a sign of things to come in the collectibles space, the company announced in December that it had been selected by FIFA to exclusively operate all 104 stadium and fan festival retail locations for the 2026 World Cup.\n\n“Growth in North America has been terrific and we continue to see it being terrific, but our international business is growing faster than any part of our business and it has been a massive focus for us,” Leiner said. “Primarily Europe and Asia, but we’re also working hard in Latin America. Our London store on Regent Street, we went big; we built the home of the hobby in London. We have aspirations to build some more flagship stores internationally, so you’ll see more later this year as we announce some more plans. … Soccer cards should be the same size right up there, if not bigger than MLB, NBA, NFL. It’s a global sport. I think it’s still under-penetrated in the world of collectibles (and) guys like David Beckham will help us continue to elevate the category.”\n\nThat expansion will be reliant on growing the collector base outside of the U.S., where the hobby has a much more established foundation.\n\n“In the U.S. we have a really long history of trading cards and collectibles, going back to tobacco cards over 150 years ago,” Leiner said. “Trading cards are still relatively new-ish in Europe, Asia, other places. And we sometimes forget too, our products can be complicated. We have our own language with ‘parallels’ and ‘refractors’ and ‘red waves’ and all of these things. We look at the universe of fans, which is significantly larger than the universe of collectors, so if we can convert more of those fans to collectors, that’s what we’re out there to do.\n\n“So doing things like team sets, as an entry level, maybe there’s one or two parallels or shinies in there, and then you can level people up, but it’s definitely a different approach (abroad). In the U.S., it’s in our DNA and people get it, but as we go into Europe and we go into Asia, particularly in Europe, where it’s really, decades ago it was a sticker market and TCG (trading card games) market, it’s becoming much more of a hobby and trading card market. And it’s still such early days in soccer, so we’re very conscious of how we onboard people and explain the fun and all the great stuff in our hobby.”\n\nWhereas kids in the U.S. start collecting cards at a young age, Fanatics sees a slightly different progression in the maturation process of a collector.\n\n“Stickers outside of World Cup and the Euros, where stickers are for everybody, stickers are usually on the younger demographic, we see kind of an evolution from stickers to TCG to trading cards,” Leiner said. “So maybe stickers 4-7 years old, 7-12 TCG, 13 maybe, and then you gradually kind of get into trading cards. So we definitely see a life cycle, so we work hard to create great collections across three of those categories.”\n\nThe Athletic maintains full editorial independence in all our coverage. When you click or make purchases through our links, we may earn a commission.",
  "paragraph_count": 17
}