{
  "url": "https://www.nytimes.com/athletic/7015741/2026/02/02/gianni-infantino-fifa-russia-israel-trump/",
  "scraped_at": "2026-02-04T18:07:35.926880",
  "title": "FIFA chief Gianni Infantino against Russia and Israel bans, defends Trump’s Peace Prize",
  "author": "",
  "published_date": "Feb. 3, 2026",
  "content": "FIFA President Gianni Infantino has spoken out against banning Russia and Israel from international football — and also defended awarding U.S. President Donald Trump the FIFA Peace Prize in December.\n\nBoth FIFA, the world governing body, and its European counterpart UEFA banned the Russian national team from competing in 2022 after the country invaded Ukraine. There have been calls for FIFA and UEFA to impose a similar ban on Israel because of the ongoing conflict in Gaza and the country’s support of settlements in Palestinian territories.\n\nAlthough Russia’s ban is yet to be lifted, Infantino claimed it “has not achieved anything” and revealed he will be looking at removing the ban, as well as potentially changing FIFA’s statutes to prevent similar sanctions in the future.\n\nInfantino was speaking in an hour-long, in-person interview with Yalda Hakim, host of The World on Sky News, which was released online on Monday afternoon.\n\n“We have to,” Infantino responded when asked whether he is going to explore lifting the ban. “Definitely. Because this ban has not achieved anything, it has just created more frustration and hatred.”\n\nOn the possibility of changing FIFA’s statutes to stop national teams being banned, Infantino said they “should actually never ban any country from playing football because of the acts of their political leaders”.\n\nIn 2023, FIFA and UEFA lifted bans on Russia Under-17 teams from participating in international tournaments across the men’s and women’s game, provided they competed as the “Football Union of Russia”, and in the absence of their national flag, their national anthem, their national-team kit and equipment, and played in neutral colours.\n\nIn October, Amnesty International, the global human rights organisation, wrote an open letter to FIFA and UEFA to “suspend the Israeli Football Association until clubs from settlements in the Occupied Palestinian Territory are removed from its leagues”.\n\nThe letter also argued that “football cannot be separated from Israel’s unlawful occupation”, although Infantino told Sky News that implementing a ban on Israel “is a defeat”.\n\nIn a wide-ranging interview, the FIFA president defended handing Trump the FIFA Peace Prize ahead of the men’s World Cup draw in Washington at the beginning of December.\n\n“Whatever we can do to help peace in the world, we should be doing it, and for this reason, for some time we were thinking about (whether) we should do something to reward people who do something,” Infantino said of the award, before insisting that “objectively, he (Trump) deserves it”.\n\n“It’s not just Gianni Infantino who said it… (there’s) a Nobel Peace Prize winner (Maria Corina Machado) who said this. He was instrumental in resolving conflicts and saving thousands of lives.”\n\nCorina Machado, the leader of the opposition in Venezuela, presented her Nobel Peace Prize medal to Trump during a meeting at the White House on Jan. 15, saying it was “a recognition for his unique commitment (to) our freedom”.\n\nCorina Machado’s visit to Washington came weeks after Trump ordered U.S. forces to seize Venezuelan President Nicolas Maduro his wife, Cilia Flores, in a military operation in Caracas. Maduro and Flores were brought to the U.S. and have been charged in a drug-trafficking case.\n\nInfantino was also pressed on the calls for countries to boycott this year’s World Cup due to concerns relating to Trump’s rhetoric around invading Greenland and his domestic immigration policies.\n\nThe FIFA president dismissed that narrative and said nobody has suggested cutting diplomatic ties with the United States, essentially asking why football should be treated differently.\n\n“I think, in our divided world, in our aggressive world, we need occasions where people can come, can meet around the passion (for football).”",
  "paragraph_count": 17
}