{
  "url": "https://www.nytimes.com/athletic/7017713/2026/02/03/jack-doohan-haas-reserve-driver-f1/",
  "scraped_at": "2026-02-04T18:06:16.075312",
  "title": "Jack Doohan joins Haas as F1 reserve driver following Alpine exit",
  "author": "",
  "published_date": "Feb. 3, 2026Updated 7:14 pm GMT+8",
  "content": "Jack Doohan has joined Haas as a reserve driver ahead of the new Formula 1 season following his departure from Alpine.\n\nDoohan made seven F1 starts for Alpine after debuting at the 2024 season finale in Abu Dhabi, but was dropped after last year’s Miami Grand Prix and replaced by Franco Colapinto.\n\nThe Australian remained part of Alpine’s driver roster for the remainder of the year but he began to explore options away from the team, which included holding talks with Haas over a possible role.\n\nDoohan mutually split from Alpine last month, paving the way for Haas to announce it had signed him as a reserve driver on Tuesday.\n\nThe 23-year-old will share reserve duties at Haas with Japanese driver Ryō Hirakawa, who will also race for Toyota’s sports car team in the World Endurance Championship.\n\n“I’m thrilled to be joining TGR Haas F1 Team,” Doohan said in a statement. “It’s the ideal place to continue my Formula 1 career. I would like to thank the team for giving me the opportunity to grow and take on the great challenge of 2026 together. I’m eager to begin working with the team and collaborating on a successful season.”\n\nHaas offered no details on Doohan’s program for 2026 in the announcement, but as a reserve driver, he is set to attend grands prix as a back-up should either of its full-time racers, Esteban Ocon or Ollie Bearman, be sidelined.\n\nDoohan would also be able to accrue more F1 mileage through Haas’s private testing program using previous years’ cars, which the team started doing last year with Ocon, Bearman and Hirakawa.\n\nDoohan’s time on the F1 grid with Alpine was short and not very sweet.\n\nFrom the moment the team signed Colapinto last January as a reserve driver, it seemed inevitable that he would replace Doohan. Six races without points and a mighty crash at Suzuka prompted Alpine to take action right after the Miami Grand Prix.\n\nWith Haas, Doohan now has the chance to rebuild himself and remain on the radar within the F1 paddock. The American team can give him mileage through its private testing program, and he’ll be a driver with recent F1 experience to call upon if required as a race stand-in.\n\nDoohan is yet to firm up any racing plans for 2026. He conducted some testing over the winter for a possible seat in Super Formula, Japan’s premier single-seater category, but missed out on a full-time drive in the series.\n\nThe Haas role does at least give Doohan the opportunity for a fresh start within F1 away from Alpine, even if it’s only as a reserve, and try to build a case to be under consideration for a racing return in the future.",
  "paragraph_count": 13
}