{
  "url": "https://www.nytimes.com/athletic/7017833/2026/02/03/newcastle-jamaal-lascelles-leicester-transfer-confirmed/",
  "scraped_at": "2026-02-04T18:05:59.888215",
  "title": "Jamaal Lascelles brings Newcastle career to an end with Leicester move",
  "author": "",
  "published_date": "Feb. 3, 2026Updated 7:30 pm GMT+8",
  "content": "Newcastle United club captain Jamaal Lascelles has joined Leicester City, bringing an end to more than a decade on Tyneside.\n\nThe 32-year-old centre-back was made available for transfer, despite Newcastle’s defensive injury problems, with Fabian Schar ruled out until April following ankle surgery.\n\nLascelles made 253 appearances for Newcastle, leading them to promotion as captain in 2016-17 under Rafa Benitez, before becoming a mainstay in the Premier League.\n\nHowever, he has rarely been first choice since Eddie Howe took charge in November 2021 and, although Lascelles has been a valuable leader behind the scenes and did play during the Champions League campaign of 2023-24, he has barely featured since suffering am ACL injury in March 2024.\n\nLascelles only made two substitute appearances this season, the most recent of which came against Arsenal on September 28, and he has not featured in a matchday squad since November 9.\n\nHowe said earlier last month that Lascelles did not feel “great in his body” but that he did not have a specific injury. That was the head coach’s explanation as to why Lascelles was not featuring, alongside the fact he was expected to leave.\n\nSpeaking on Tuesday, Howe paid tribute saying: “Jamaal has been an incredible servant to the football club long before I came as you say captain at a really young age and some very difficult seasons for the football club, some relegation battles where he really had to stand up and lead the group, the difficult circumstances I think he did that with real integrity.\n\n“In class, a really strong person, a really strong leader, very vocal. And then talking about my time with him here, he had a time where he had to wait for his opportunity, but then ended up playing some unbelievable games for us, none more so than against PSG in the home game.\n\n“And our Champions League journey, he was pivotal to that and produced some unbelievable performances, probably some of the best that I’ve seen him play.\n\n“I pay tribute to him and thank him for all his service, everything that he’s given to the team and to his teammates and to the staff at the training ground. He’s a real credit to himself.”",
  "paragraph_count": 10
}