{
  "url": "https://www.nytimes.com/athletic/7015376/2026/02/02/karim-benzema-al-hilal-al-ittihad-transfer-news/",
  "scraped_at": "2026-02-04T18:06:54.496184",
  "title": "Karim Benzema joins Al Hilal from Saudi rivals Al Ittihad",
  "author": "",
  "published_date": "Feb. 3, 2026",
  "content": "Karim Benzema has joined Al Hilal from Saudi Pro League rivals Al Ittihad.\n\nThe 38-year-old French striker joined Al Ittihad on a three-year deal upon leaving Real Madrid in the summer of 2023, with his contract at the Jeddah-based club due to expire in June.\n\nFrench side Lyon, where Benzema came through as a youngster, explored a move for the striker in January 2024 after being absent from team duties over the Saudi Arabian mid-season break, leaving on holiday without permission before reporting late back to the team. He remained with Al Ittihad after that winter window closed, but his situation at there has remained complicated.\n\nBenzema was the Al Ittihad captain and has scored 54 goals in 83 appearances since arriving from Madrid. The former France international was one of several high-profile players who left European football for Saudi Arabia in the summer of 2023, as the country’s Public Investment Fund (PIF) took control of four of the biggest clubs, Al Ittihad, Al Nassr, Al Hilal and Al Ahli.\n\nAl Ittihad’s recruits that summer included midfielders N’Golo Kante from Chelsea and Fabinho from Liverpool, but Benzema felt his side’s additions were not sufficient. In April 2024, he publicly criticised the club’s transfer policy, saying he ‘needed other players’. Al Ittihad won the Saudi Pro League in the 2024-25 season.\n\nUpon moving to Al Ittihad, Benzema was made an ambassador for Saudi Arabia in its (now successful) bid to host the 2034 World Cup.\n\nThis season, Al Ittihad are sixth in the SPL after 19 games, 12 points behind leaders Al Hilal, who have a game in hand. Al Hilal’s squad includes former Wolverhampton Wanderers midfielder Ruben Neves, former Liverpool striker Darwin Nunez and Morocco international goalkeeper Yassine Bounou.",
  "paragraph_count": 7
}