{
  "url": "https://www.nytimes.com/athletic/7015491/2026/02/02/liverpool-jeremy-jacquet-transfer-confirmed/",
  "scraped_at": "2026-02-04T18:06:38.996195",
  "title": "Liverpool sign Jeremy Jacquet in £55m deal from Rennes",
  "author": "",
  "published_date": "Feb. 3, 2026",
  "content": "Liverpool have announced the signing of Rennes defender Jeremy Jacquet, who will join the club officially on July 1.\n\nThe 20-year-old has agreed a contract at Anfield until 2031 with the option of a further year after a deal worth £55million plus £5m in add-ons was struck between the two clubs.\n\nHe will officially move in the summer with Liverpool moving quickly to sign a player they believe can be a big piece of a significant squad rebuild that started last summer with the signings of Florian Wirtz, Alexander Isak, Hugo Ekitike and Milos Kerkez.\n\nLiverpool also pursued centre-back Marc Guehi last summer before he opted to join Manchester City in January.\n\nThe Premier League club view Jacquet as being a more valuable long-term acquisition than Guehi in their model hence the push to sign him this month.\n\nJacquet came through the youth ranks of Rennes and has featured for France up to to under-21 level at international level.\n\nBy Liverpool correspondent Andy Jones\n\nThe first thing that strikes you about Jeremy Jacquet is his size. Despite only being 20, physically he looks ready for a move to England.\n\nThe second is his approach to defending. He wants to be aggressive and on the front foot as much as possible and is happy to play in a high-line, all key attributes he will need when playing for Liverpool.\n\nThe 20-year-old uses his 6ft 2in frame and his speed to defend space and cover ground quickly. It also plays a role in his penalty box defending as he can recover and demonstrate his awareness and anticipation.\n\nIn possession, the youngster is comfortable and confident. He has the vision and bravery to punch line-breaking passes through opposition set-ups. Jacquet can also switch play to either flank and carry the ball forward himself.\n\nAdaptation will be required. He has been dominant aerially in Ligue 1, but the physicality of the Premier League has gone to another level. There will be lessons learnt and bumps along the road as is the case with most young defenders, so it may take a bit of time before he can replicate the aerial success he has had in France.\n\nHe is not the finished article, but he has talent and a lot of the raw ingredients that, if developed correctly, could turn him into an elite defender in the years to come.\n\nBy senior writer Chris Weatherspoon\n\nAt £55million, Jeremy Jacquet’s arrival represents another hefty outlay in the transfer market after a summer in which Liverpool spent over £400m on new players.\n\nHow can Liverpool afford it?\n\nFirstly, their summer spree came on the back of a season in which they banked record revenues — £702m, making them the highest earning English club for the first time in living memory.\n\nThat should only continue after new deals, including a kit manufacturing agreement with Adidas.\n\nAnd even though their wage bill went over £400m in 2024-25 for the first time, their proportion of wages to revenue actually dropped due to the income growth. Last season it was a six-year low of 60 per cent.\n\nThey are also now good sellers, moving on Luis Diaz, Darwin Nunez, Jarell Quansah and several more last summer for nearly £200m.\n\nThose sales will have lopped a chunk off the wage bill. All of which is to say that spending a further £55m on Jacquet remains within the confines of what Liverpool can reasonably do.",
  "paragraph_count": 21
}