{
  "url": "https://www.nytimes.com/athletic/7017538/2026/02/03/tennis-ball-eye-mpetshi-perricard-injury-retired-open-occitanie/",
  "scraped_at": "2026-02-04T18:06:24.271853",
  "title": "Tennis player retires injured after accidentally volleying ball into own eye",
  "author": "",
  "published_date": "Feb. 3, 2026",
  "content": "French tennis player Giovanni Mpetshi Perricard was forced to retire injured from his first-round match at the Occitanie Open in Montpellier, France after inadvertently hitting the ball into his own eye.\n\nDown 5-3, 30-0 to compatriot Arthur Géa, Mpetshi Perricard came forward to the net and hit a backhand volley designed to drop short over the net. Instead, the ball flicked up off Mpetshi Perricard’s racket frame and hit him in the left eye.\n\nThe 22-year-old, best known for having the biggest serve in the men’s game, was in considerable discomfort and knelt down on the court clutching his face. On the next ball, Mpetshi Perricard sent a forehand return so wide it nearly missed the doubles court, unable to see or read the ball properly.\n\nWith that, he lost the set, but his condition was the far bigger concern. Mpetshi Perricard went to his bench to receive treatment, and after a short interaction with a tournament trainer, he shook hands with Géa to end the match.\n\nFluke eye injuries are unsurprisingly rare in tennis, but can be serious. Former world No. 7 David Goffin suffered a similar injury during the 2018 Rotterdam Open semifinals against former world No. 3 Grigor Dimitrov. At the event in the Netherlands, a shot from Dimitrov flicked off the Belgian’s racket and hit him in the eye. Nicolas Mahut, also of France, was hit in the eye during the men’s doubles final, in one of the unluckiest matches for a player in recent history. Mahut was hit three times in the match, with the ball to his eye requiring a 10-minute stoppage and treatment with ice on changeovers.\n\nMpetshi Perricard is attempting to rebuild his ranking after an indifferent 2025 season. The 6-8 Frenchman rose from world No. 205 to world No. 31 in 2024, on the back of his winning titles at the Lyon Open, in his home city in France, and the Swiss Indoors Basel in Switzerland. His first serve can get as fast as 153 mph, but he also regularly hits second serves at over 120 mph, well above the ATP Tour average for the shot.\n\nHe won 38 of 63 tiebreaks played in 2024, a regular feature in his matches because of his return game not matching the potency of his serve, and won 48 matches of 73.\n\nBut Mpetshi Perricard finished the 2025 season with a 23-26 record, dropping to world No. 59 at the end of the year. He is 4-4 in 2026 so far.",
  "paragraph_count": 8
}