{
  "url": "https://www.nytimes.com/athletic/7017774/2026/02/03/west-ham-nuno-espirito-santo-compensation/",
  "scraped_at": "2026-02-04T18:05:51.967743",
  "title": "West Ham can dismiss Nuno Espirito Santo without compensation if they get relegated",
  "author": "",
  "published_date": "Feb. 3, 2026Updated 8:13 pm GMT+8",
  "content": "Nuno Espirito Santo can be sacked without compensation if West Ham United are relegated to the Championship.\n\nWest Ham gave Nuno a three-year contract when he succeeded Graham Potter as head coach, but a clause in his deal means that the 52-year-old would not receive a pay-off should he be jettisoned if the club suffer demotion to the second tier, according to sources briefed on the matter.\n\nThe hierarchy at the London Stadium has supported Nuno, with The Athletic reporting in January that there ws no immediate willingness to sack the Portuguese despite their precarious league position immediately following a 3-0 loss against bottom-placed Wolverhampton Wanderers, their first win of the season.\n\nSince Nuno’s appointment in late September, he has won four of his 19 Premier League games, drawing five and losing 10. Following last Saturday’s 3-2 defeat by London rivals Chelsea, West Ham remain in the relegation zone and are six points adrift of Leeds United (16th) and Nottingham Forest (17th).\n\nShould West Ham decide to sack Nuno, it will see the club make their fifth permanent managerial appointment in seven years, after David Moyes, Julen Lopetegui and Potter all had spells in charge of the first team since December 2019.\n\nNuno called the loss to Chelsea “frustrating”, saying after the game: “It’s sad that this game went away from us. The idea is to keep the same, the way we played in the first half. Chelsea were going to react, but we didn’t defend it. Crosses created a lot of problems for us. We have to react. This week, it’s about reacting, bouncing back and going again.”\n\nThe defeat by Chelsea ended a run of three consecutive victories in all competitions, two of which came in the Premier League.\n\n“It hurts,” captain Jarrod Bowen said after the defeat at Stamford Bridge. “Ultimately, we didn’t do enough in the second half and we need to look at ourselves. We can’t give up games as easily as I felt we did.\n\n“This is a blip. We’ve had some good performances, good results. We’ve shown what we can do, with and without the ball. We know we need points and we need results – that’s the position we’re in.”\n\nA busy January transfer window saw the €20million (£17.4m, $23.4m) arrival of Pablo Felipe from Gil Vicente and Taty Castellanos from Lazio, while Axel Disasi, Adama Traore and Keiber Lamadrid joined on loan from Chelsea, Fulham and Deportivo La Guaira respectively.\n\nWest Ham face 19th-placed Burnley on February 7, before hosting Manchester United on February 10.",
  "paragraph_count": 11
}