{
  "url": "https://www.nytimes.com/athletic/6424289/2026/02/02/west-ham-transfers-disasi-chelsea/",
  "scraped_at": "2026-02-04T18:06:31.538530",
  "title": "West Ham sign Axel Disasi on loan deal from Chelsea",
  "author": "Sebastian Stafford-Bloor",
  "published_date": "Feb. 3, 2026",
  "content": "Axel Disasi has joined West Ham United on a loan deal from Chelsea for the remainder of the season.\n\nThe 27-year-old, who had not made a senior appearance for Chelsea this campaign, has been a long-standing target for the east London club this window.\n\nThe centre-back has only played 161 minutes in youth competition this campaign and has been training away from the first team.\n\nThe Athletic reported that signing a centre-back was a priority for head coach Nuno Espirito Santo this window.\n\nToulouse’s Charlie Cresswell and Southampton defender Taylor Harwood-Bellis were among their other defensive targets. Last week on Thursday, the Championship side rejected West Ham’s £18million bid for Harwood-Bellis.\n\nAfter the termination of Igor Julio’s season-long loan from Brighton & Hove Albion, West Ham’s recognised central defensive options are Jean-Clair Todibo — set to serve a three-match ban for his dismissal in the 3-2 defeat against Chelsea — Max Kilman and Konstantinos Mavropanos.\n\nDisasi spent the second half of the 2024-25 season on loan at Aston Villa, where he made ten appearances including three in the Champions League, but did not feature in their final four league games and he returned to Stamford Bridge last summer.\n\nThe France international joined Chelsea from Monaco in the summer of 2023 on a six-year contract, off the back of a season where he registered six goals and four assists in 49 appearances from centre-back.\n\nHe made 44 appearances in all competitions in his first campaign at Stamford Bridge but failed to solidify himself as a regular starter in the 2024-25 season before going on loan.\n\nDisasi has made five appearances for the senior national team, the last of which was in November 2023.",
  "paragraph_count": 10
}