{
  "url": "https://www.nytimes.com/athletic/7017773/2026/02/03/womens-fa-cup-reforms-explained/",
  "scraped_at": "2026-02-04T18:05:39.287720",
  "title": "Women’s FA Cup changes proposed: Seeding, World Cup-style bracket, draw scrapped, lower league exclusion",
  "author": "",
  "published_date": "Feb. 3, 2026Updated 9:27 pm GMT+8",
  "content": "The Football Association (FA) has proposed a raft of significant reforms to the Women’s FA Cup including seeding four teams, replacing the draw with a World Cup-style bracket from the last 32 and excluding tier seven clubs from the competition.\n\nUnder the proposals, the four seeded teams would be the top-four clubs from the previous Women’s Super League (WSL) season, according to multiple sources, who wished to remain anonymous to protect relationships. The seeding would also mean the existing format of a draw to determine fixtures would be replaced by a bracket mapping out a route to the final from the last 32 onwards — the stage WSL clubs enter the competition.\n\nChanges arrive as part of the FA’s 2024-28 strategy to review the tournament in order to broaden its appeal and reach, as communicated in email correspondence and meetings with clubs, sources indicated.\n\nThe FA’s plans have faced fierce pushback from clubs, according to sources from the second tier and below, who said teams made clear their opposition during a consultation process. Additionally, clubs further down the pyramid claim the consultation process was far from exhaustive.\n\nAny changes could be implemented as early as next season, though final plans have yet been agreed and the FA insists “no decisions have been made at this stage”.\n\nThe FA is bidding to make its flagship competition more marketable, particularly in its later stages, sources say.\n\nAccording to documents disseminated with clubs earlier this week, the FA state the top-four seeding is a “temporary” measure and that the proposals will create the “highest chances of consistent high-quality matches throughout the later rounds” of the Cup.\n\nAccording to the FA’s proposal, a bracket strategy “enables the development of storytelling, and enhanced narrative to the competition. It enables clubs and fans to plot their road to Wembley Stadium, building momentum and excitement, whilst supporting operational planning.”\n\nAn FA Spokesperson said: “We committed in our women’s and girls’ game strategy, Reaching Higher, to review the Adobe Women’s FA Cup, recognising the need to evolve the competition and strengthen its commercial potential. This would enable us to reinvest more funding into both the competition itself and the wider women’s football ecosystem, which is vital for long-term, sustainable growth.\n\n“While a comprehensive review of the current format has been completed, no decisions have been made at this stage. Any future changes will be shaped in close consultation with stakeholders across the entire pyramid, including clubs, players, fans, and our broadcast and commercial partners.”\n\nThe proposals wield an especially profound effect on lower-tier clubs.\n\nAs part of the new proposals, tier seven teams would no longer be permitted to compete in the competition. Tier seven consists of multiple amateur, county leagues, and sits six divisions below the WSL and four below the National League.\n\nThe consultation process undertaken by the FA has been called into question by lower-tier clubs.\n\nAccording to numerous clubs in tier seven, the FA hosted meetings in January, one specifically for tier five, six and seven clubs, outlining potential changes to the competition.\n\nThe meeting outlined the plans for a bracket-style competition and seeding, with no mention of the impact for teams further down the pyramid. Until specifically asked about the involvement of lower-tier teams unlikely to reach the latter stages of the tournament, sources claim that they were then made aware of a proposed entry cut-off point.\n\nPrior to the January consultation, only one team of 50 in the seventh-tier Greater London Women’s Football League (GLWFL) was consulted directly about the proposal to remove seventh-tier sides, according to GLWFL chairman David Baker. When asked specifically about the consultation process by The Athletic, the FA declined to comment.\n\nThe suggestion is part of a tabled “entry tier review” for lower-league sides, with the FA citing a need to enhance minimum stadium standards. Tier seven standards across the national level vary greatly. Tier seven systems in London and Manchester, for example, are far more advanced than other areas and have more feeder leagues than elsewhere in the country.\n\nFour tier seven teams reached the first-round proper this season: Leyton Orient, South London Women FC, Maidstone United and Milbrook.\n\nTier seven clubs in London have expressed frustration at being removed due to the opportunity to develop that the competition provides.\n\nTier seven clubs currently enter the competition at the preliminary round. This season the winning club would receive £600 with the loser receiving £150. From the first, second and third-round qualifying stages, winning clubs receive £1,800, £3,000 and £4,000 respectively, with the losing clubs receiving £450, £750 and £1,000.\n\nReaching the first round proper would bring a windfall of £6,000 to the winner and £1,500 to the loser.\n\nAccess to these financial streams have the ability to change a club and its future direction, teams argue. There is no current alternative to the FA Cup.\n\nSeventh tier club South London Women FC, an independent women’s football club that competes in the Premier Division of the GLWFL, has received more than £20,000 over two seasons for progressing to the first-round proper.\n\nAccording to correspondence seen by The Athletic, tier seven clubs have told the FA of their concerns that potential exclusion would yield financially. One source likened the removal to the “pulling up of a drawbridge”. Another described a “detrimental impact on the ecosystem of the women’s game”, adding the FA Cup “is a fundamental engine for growth, as well as financial support and visibility that allows a grassroots club like ours to thrive.”\n\nAdditionally, the entry fee for clubs to compete in the FA Cup has tripled from £25 to £75, a significant sum for clubs further down the pyramid who fear a potential “pricing out” strategy being put in place.\n\n“The FA Cup is not broken for 99 per cent of clubs and the interests of the very few at the top of the game should never override the majority and lifeblood of our game,” said a source.\n\n“The FA has repeatedly committed to expanding the women’s football pyramid and ensuring ‘football is for all’. Removing tier seven clubs from the FA Cup feels like a step backwards from this mission,” added another.\n\nWhile seeding is claimed to be a temporary measure, numerous clubs from WSL2 and further down the pyramid have voiced displeasure with the proposition, claiming that it places the top WSL teams in an even greater advantageous position.\n\nChelsea, Arsenal, Manchester United and Manchester City would be the seeded teams this season based on last season’s WSL table. Incidentally they are the only clubs to have won the FA Cup since 2012, when Birmingham City, now in WSL2, lifted the trophy.",
  "paragraph_count": 29
}