{
  "url": "https://www.nytimes.com/athletic/7021073/2026/02/04/leeds-team-news-stach-bijol/",
  "scraped_at": "2026-02-05T09:39:49.909495",
  "title": "Anton Stach expected to miss Leeds’ next two matches with hip injury",
  "author": "",
  "published_date": "Feb. 4, 2026Updated 11:56 pm GMT+8",
  "content": "Leeds United will be without Anton Stach for Friday’s showdown with Nottingham Forest due to a hip injury, though Jaka Bijol could make a return to the matchday squad.\n\nSpeaking in his press conference ahead of the game, manager Daniel Farke said his German midfielder was likely to miss Tuesday’s trip to Chelsea too.\n\nBijol has been missing for three games with a hamstring injury, having made himself an important part of the three-man defence behind United’s resurgence since early December. The Slovenia international may not be included in the starting line-up on Friday, but he could at least be on the bench if his body reacts positively to his return in training.\n\n“In general, we have some mixed news and, in personal terms, some definitely good news,” said Farke. “Jaka Bijol, since today, is back in team training. We have to wait right now to see how his body reacts, but that’s definitely positive for us.”\n\nJames Justin seems set to continue in the back three in Bijol’s absence after Farke confirmed his injury-enforced substitution last Saturday was only a bruised, and not broken, toe. Lukas Nmecha is yet to return to team training from his hamstring strain and Farke considers him unlikely to make the Forest match.\n\n“James Justin is back in team training. Thank God it was just a bruise and not a broken toe. He’s also available for the weekend. Definitely good news.\n\n“Daniel James is making progress: very good news. Lukas Nmecha is not in team training yet. We have two more days. It’s probably unlikely he will make it for this game, but he’s also not too far away.”\n\nFarke says the medical staff have told him Stach could be missing for 10 to 14 days, which would also make him a doubt for the February 15 trip to Birmingham City in the FA Cup.\n\n“The only negative news is Anton Stach is struggling with some hip problems after the last game day and it looks like he’s likely to miss the game on Friday and also the Chelsea game,” he said. “Definitely not good news with him because he’s obviously an important player for us.\n\n“It’s probably a situation of probably being out for 10 to 14 days at least. That is what the doctor says at the moment.”",
  "paragraph_count": 10
}