{
  "url": "https://www.nytimes.com/athletic/7020034/2026/02/04/arsenal-chelsea-carabao-cup-report/",
  "scraped_at": "2026-02-04T19:18:13.968263",
  "title": "Arsenal are here to win, not entertain. And that’s just what they’re doing",
  "author": "",
  "published_date": "Feb. 4, 2026Updated 3:23 pm GMT+8",
  "content": "By the time Kai Havertz had pointed to the Arsenal badge on his chest in celebration, the substituted Noni Madueke was already halfway across the pitch, club coat trailing behind him.\n\nGabriel Martinelli was next on the scene, then Jurrien Timber, who was followed by a jubilant William Saliba, cavorting like a hyperactive toddler.\n\nAfter him came more substitutes: Riccardo Calafiori, Ben White, a hooded Gabriel Jesus. In the melee, Cristhian Mosquera lost his GPS tracker vest. A non-playing David Raya inexplicably arrived carrying his goalkeeper gloves. Before long, almost the entire matchday squad — even third-choice goalkeeper Tommy Setford — had gathered around Havertz. Myles Lewis-Skelly was one of the last into the fray, leaping onto his huddled team-mates.\n\nThere was furious patting of heads and slapping of Havertz’s back. There was an arm around the shoulder from fellow striker Viktor Gyokeres.\n\nThere was relief, catharsis and joy. It was over. It was bedlam.\n\nSome things are worth the wait.\n\nArsenal waited 97 minutes for a goal in Tuesday’s home Carabao Cup semi-final second leg against Chelsea, and when it came it was perfect: Havertz rounding Robert Sanchez to score against his previous club.\n\nThis club have waited six years to reach a men’s final again. Along the way, there have been four semi-final failures. But this is a different Arsenal — an Arsenal who believe that their time is now.\n\nLast night’s 1-0 win meant a 4-2 aggregate victory. Their semi-final hoodoo is banished and Mikel Arteta’s team have taken another huge stride towards ending the wait for silverware, with a final date at Wembley on Sunday, March 22 now looming against Manchester City or Newcastle United, who play their second leg tonight (Wednesday) at the Etihad Stadium.\n\n“I think everybody that knows Kai a little bit, we feel genuinely happy for him in a special way because he deserves the best,” Arteta added. “The way he works, the way he treats people, the way he behaves every single day. Today was a special moment for him and I hope that he enjoyed it, because he fully deserves it.”\n\nArsenal continue to fight across four fronts.\n\nThe relentlessness of their fixture list does not provide many opportunities to pause, to consider their progress to this point, and imagine what might be yet to come.\n\nAt full time on Tuesday, the home fans joined together in a chorus of the club’s North London Forever anthem. This rendition was louder than it had been at kick-off — indeed, louder than it has been sung for some time.\n\nIt was the sound of a support emboldened by the belief that this is their year, and that this might be just the start.",
  "paragraph_count": 14
}