{
  "url": "https://www.nytimes.com/athletic/7020745/2026/02/04/england-brendon-mccullum-harry-brook/",
  "scraped_at": "2026-02-04T19:18:23.164727",
  "title": "Brendon McCullum defends ‘outstanding leader’ Harry Brook: ‘He has work to do off the field’",
  "author": "",
  "published_date": "Feb. 4, 2026 7:10 pm GMT+8",
  "content": "Brendon McCullum has called white-ball captain Harry Brook “an outstanding leader on the field” with “work to do” off it as the scrutiny on the England head coach following the ill-fated Ashes Tour continues.\n\nBrook, 26, was disciplined for a late-night altercation with a bouncer in Wellington, New Zealand in October ahead of the team’s tour of Australia before being forced to admit last week that “others were present” and that he lied to “protect” them.\n\nMcCullum’s own position in the wake of the 4-1 series defeat is the subject of much debate while Brook’s role as leader of the limited overs side has also been called into question.\n\nSpeaking for the first time since Brook’s climbdown, McCullum backed his skipper as a young man and player with plenty still to learn.\n\n“I think Harry Brook is an outstanding leader on the field,” the New Zealander said. “I think his tactical acumen is as good as I’ve seen in a short period of time for a young man.\n\n“He has work to do off the field, no doubt, as do some of the other young lads we have in our side and that’s what happens when you come in at 20 and it’s your formative years and you’re growing up on a world stage with spotlight and fame and fortune and pressure that comes with it.”\n\nEngland’s own handling of the situation has been much criticised with the full details of the incident in Wellington and those involved only coming to light via newspaper reports while the team’s downtime in Noosa sparked allegations of a glorified ‘stag do’ and an official ECB investigation.\n\nFor McCullum’s part he feels some of the coverage of the team’s off-field behaviour has been “completely out of order” and amounted to a “pile on” and defended England’s process of dealing with it.\n\nAsked whether Brook had been protected enough by the hierarchy, McCullum continued: “I think he was quite keen to put his hand up when the information came that it was going to land in the media.\n\n“He was hopeful that it had been dealt with internally as we all were and obviously he was made aware of what happened during that night and he was quite keen to put his hand up.\n\n“He is a strong leader, he’s a young man but he’s got a very good head on his shoulders and I know people will say he’s not that clever. I couldn’t disagree with that more.\n\n“He wears his intelligence lightly and he’s a very strong leader and he’s someone that they play for in their dressing room as well and our job is to just keep looking after him because he is still young and he is involved in this game 12 months of the year, year on year on year.\n\n“He’s got his best days in front of him which is pretty exciting. We’ve just got to make sure we look after him.”",
  "paragraph_count": 13
}