{
  "url": "https://www.nytimes.com/athletic/7017769/2026/02/04/why-some-premier-league-clubs-choose-to-spend-nothing-in-january/",
  "scraped_at": "2026-02-04T19:18:05.778521",
  "title": "Eight Premier League clubs spent nothing in January. Why?",
  "author": "",
  "published_date": "Feb. 4, 2026 1:05 pm GMT+8",
  "content": "This article is an updated version of a piece first published in January 2025.\n\nAnother January transfer window has closed in the Premier League and, like so many before, its final hours provided a fitting full stop. Business was quiet across English football’s top flight, and for many, it turned out to be a day to carry little significance.\n\nThere was Jorgen Strand Larsen’s £43million move from Wolverhampton Wanderers to Crystal Palace and Sunderland’s £17.5m swoop for Anderlecht winger Nilson Angulo, but the deals involving a transfer fee could be counted on one hand.\n\nIt meant the winter window concluded with a collective outlay of £405m ($553m) in the Premier League, far more than any other league. It was still, though, an extension of a long-standing, cautious pattern.\n\nEight clubs ended the window without paying a fee to strengthen their first team, a group that included Manchester United, Chelsea and Newcastle United. Arsenal’s only business was to sign St Mirren teenager Evan Mooney for their academy, while it was agreed Liverpool’s £55m capture of Rennes defender Jeremy Jacquet could wait until July 1.\n\nThis was another season when January spending was dwarfed by the summer. The £405m of fees agreed in the opening 33 days of 2026 was broadly on par with January 2025, but it was less than 13 per cent of the campaign’s record-breaking spend of just over £3.5bn.\n\nThat put it marginally down on the historic trend. Since 2014-15, and not including this season, just £3.04bn of the Premier League’s £18.4bn cumulative spend on transfer fees was signed off during the January windows. Or, put another way, that means almost 84 per cent of business was concluded in summer.\n\nThere will always be exceptions, either the desperate or ambitious chasing betterment, but the January spending habits are well-established and clear. There is a collective will to sit on hands rather than rolling dice at the halfway point of a campaign.\n\nOver half of the Premier League’s clubs did not commit to a transfer fee in January 2024, and just four per cent of the division’s overall spend for 2023-24 came in the winter window. That might have been an exaggerated low, but it underlined the reservations that clubs will always carry into a new year.\n\n“I was talking with a club owner recently and he said he’s never liked signing players in January,” says one established agent with Premier League clients, who like everyone in this article, has spoken anonymously to protect working relationships. “And that he’d only ever do business if he absolutely had to. You find most clubs are very wary.”\n\nThat is borne out in the numbers.\n\nAt no point since the Premier League introduced its current transfer window system in 2002-03 has January spending exceeded that of the previous summer. The greatest figure proportionately, in fact, came in 2010-11 when 38 per cent of overall Premier League outlay for that season came in a winter window that included Fernando Torres’ £50m move from Liverpool to Chelsea and Andy Carroll’s subsequent £35m signing as an attacking replacement from Newcastle United.\n\nThere have been outlier years, such as January 2023, when Chelsea broke the British transfer record to sign Enzo Fernandez from Benfica for £106m. That spree helped ensure that almost a third of that season’s cheques were written in January, with the total spend of £815m unlikely to be topped any time soon.\n\nThere was a similarly high figure, relatively speaking, in 2018 when Philippe Coutinho’s £105m move to Barcelona helped Liverpool to fund the £75m capture of Virgil van Dijk in the same window.\n\nHistory tells us, though, that the biggest clubs do not enjoy January trading.\n\nReal Madrid have not made an addition to their first team during the January window since signing Brahim Diaz from Manchester City in 2019. And that is typical of the continental picture. Data compiled by Football Benchmark shows that the winter spending across European top-flight teams was, on average, 18 per cent of the summer outlay between 2018-19 and 2023-24. Summer windows, they say, generate five times as much spending, despite usually being only twice as long as winter periods.\n\nDeloitte’s own research, published in 2024, found that Europe’s big five leagues spent a combined £380m that January, months after spending £4.74bn in the summer.\n\nThose warm days and nights are when the vast majority of European football’s biggest business happens. Only two of the 20 biggest transfers of all time were signed off in January, with Fernandez’s move to Chelsea and Barcelona’s signing of Coutinho the only exceptions to the rule.\n\nManchester City, with powers diminished in the last two seasons, have unwittingly come to capture the essence of January. Up until last season, you had to go back to 2018, when Aymeric Laporte joined from Athletic Club for £57m, to find City’s last notable January window signing. Their dominance ensured they had little need to chase signings on the terms of others.\n\nThis season and last had a very different feel, however. City needed to strengthen to revive an ageing squad last January, eventually spending £178m on Nico Gonzalez, Omar Marmoush, Abdukodir Khusanov and Vitor Reis. More opportunities, the kind unlikely to stick around, presented themselves this season, with Antoine Semenyo and Marc Guehi signed for a combined £82m.\n\nArsenal, Manchester United and Chelsea, though, opted against recruitment in this winter window. They barely even threatened it.\n\nThe busiest tend to be those with something to lose. Crystal Palace, fearful of relegation, were the second biggest spenders when signing Strand Larsen, from Wolves, and Brennan Johnson, from Tottenham Hotspur, for £78m, while West Ham United were spending the proceeds of Lucas Paqueta’s sale long before it was completed, committing £50m to bring in Taty Castellanos, Pablo and Adama Traore in a bid to avoid relegation.\n\n“A club will only look to bring players in if they believe those players can either impact in a way that will help them win something or help keep them from something,” adds the agent. “It’s either fighting relegation or they’re in a scrap for a European place or promotion.\n\n“It’s different in the summer. Everyone has a blank sheet of paper. In January, the selling party knows exactly why the proposed buyers are interested in that player and what the potential rewards could be if they signed them. That typically leads to an upward pressure on the transfer fee.”\n\nThe January window does not have many friends in football. Sir Alex Ferguson was never a fan during his long reign as Manchester United boss, and Arsene Wenger even went as far as calling for its scrapping during his final season as Arsenal manager.\n\n“The ideal situation would be to have a transfer period that is closed 48 hours before the first game of the championship and to close it completely until after the season,” Wenger told reporters in 2017.\n\nThe theory behind a two-window system was to introduce greater contractual stability and certainty, with clubs previously free to trade up until March 31. Only having the summer window to move, it was decided, would be too rigid and restrictive for both player and club.\n\nCondensing post-summer business into a single month, though, brings its own problems. Player availability and financial value are usually in short supply and if those with the deepest pockets in the Premier League do not spend, the ripples are not felt elsewhere. Profit and sustainability rules (PSR) have also played their part, after the Premier League sanctioned Everton and Nottingham Forest for breaches that would bring eventual points deductions. Overspending now carries a price.\n\n“If there was no January window, I doubt there’d be much disappointment in the game,” says one experienced agent. “It’s superfluous. Clubs don’t want to sell key players. You only want to improve your squad and the only way to do that is by buying another club’s key players.\n\n“Players who are unhappy might go out on loan, there’s always that option, but it’s worth saying that most players don’t want upheaval in January. There’s no great passion from all sides; the selling club, the buying club, or the player.”\n\nOne sporting director, who has experience of both the Premier League and EFL, also points out the difficulty in a new signing making an immediate impact. There are January success stories, but a need to hit the ground running, particularly for a player new to the league, brings further reservations over investment. Summer, by contrast, can present a six-week bedding-in period with new team-mates.\n\n“It’s a tough enough ask moving clubs and making an impact, but when you’re brought in mid-season, asked to hit the ground running and become familiar with what’s expected, it becomes even more difficult,” says one agent.\n\n“That’s particularly important when you’re bringing in a player who is new to the league or the country. It might take them three months to settle, but if you sign them in January, then it’s the season over.\n\n“There’s also the issue of availability. In the summer, you can pretty much say that every single player has a price. You have time to find replacements. In January, it’s very different. The availability of players just isn’t the same.”\n\nAnd nor, as a result, is the spending. January is a month for firefighting and risk. The summer window will always be the preferred stage to invest.",
  "paragraph_count": 35
}