{
  "url": "https://www.nytimes.com/athletic/7020689/2026/02/04/brian-sorensen-everton-women-future/",
  "scraped_at": "2026-02-04T19:18:33.573635",
  "title": "Everton sack head coach Brian Sorensen",
  "author": "",
  "published_date": "Feb. 4, 2026Updated 7:08 pm GMT+8",
  "content": "Everton have sacked head coach Brian Sorensen with the club four points clear of the Women’s Super League’s relegation zone.\n\nAssistant coaches Stephen Neligan and Ashley Tootle have also been dismissed.\n\nThe Athletic reported Sorensen’s departure on Wednesday and the club later confirmed the news, with under-18s coach Scott Phelan placed in interim charge. He will be assisted by Jennifer Foster, who had been part of Sorensen’s backroom staff for the past 12 months, and goalkeeping coach Ian McCaldon.\n\nAccording to sources briefed on the situation, Sorensen was told on Wednesday morning of the club’s decision, while his staff and players were told during the day’s morning meeting at 10:15am (GMT).\n\nSorensen’s dismissal comes after Everton secured just their third league win of the season, and first since December 7, on Sunday with a 2-1 victory over Aston Villa thanks to an 89th-minute Martina Fernandez goal.\n\nThe result left Sorensen’s side ninth in the WSL, four points clear of Liverpool in the division’s single relegation spot. There is no automatic relegation place in the WSL this season, with the league’s bottom side entering a relegation play-off with the team that finishes third in WSL2.\n\nQuestions had been asked of the Danish coach’s efficacy from the Everton hierarchy after the 1-0 defeat to Brighton & Hove Albion on January 23, but there was no suggestion on Tuesday ahead of the transfer window’s close that a departure was imminent. Everton broke their club transfer record to sign Zara Kramzar for £250,000 from Roma on deadline day, and she was asked about working with Sorensen in her signing interview.\n\nSorensen, 45, had been at Everton since the summer of 2022 and signed a new two-year contract in April that had been due to run until 2027.\n\nThe Athletic reported on January 26 that there was recognition internally at the Merseyside club that the performances under Sorensen had not been good enough this season, with the club losing nine of their 14 matches so far.\n\nEverton brought in nine new signings in the summer, their first transfer window under the new ownership of the Friedkin Group, including midfielder Ruby Mace for a then club-record fee of approximately £200,000.\n\nThey have, however, been hit with key injuries, including to captain Megan Finnigan and forward Katja Snoeijs. France international striker Kelly Gago was made the club’s highest-paid player in the summer, but was involved in a transfer row in January following interest from elsewhere. Forward Toni Payne suffered a muscle injury after the Villa victory and is set to be out for around four to six weeks.\n\nDespite the injuries and absences, Everton’s winter business was remarkably sparse. Inma Gabarro was recalled from her loan at Sevilla. Eighteen-year-old defensive midfielder Laila Harbert was secured on loan from Arsenal and midfielder Kramzar was signed from Roma.\n\nWhile Everton broke their club-transfer record to sign Kramzar, according to sources briefed on the deal, Everton’s overall squad budget this season ranks among the lowest in the WSL.\n\nEverton’s women’s team relocated to Goodison Park this season following the men’s side’s move to the Hill Dickinson Stadium for the 2025-26 campaign.\n\nSorensen joined Everton in 2022 from Danish club Fortuna Hjorring and led the club to sixth in the WSL during his debut season in charge, followed by successive eighth-place finishes.\n\nEverton return to action against London City Lionesses on Sunday.",
  "paragraph_count": 16
}