{
  "url": "https://www.nytimes.com/athletic/7015299/2026/02/03/kante-transfer-fenerbahce-saudi/",
  "scraped_at": "2026-02-04T18:05:31.821887",
  "title": "Fenerbahce blame N’Golo Kante transfer collapse on Al Ittihad",
  "author": "",
  "published_date": "Feb. 4, 2026 12:52 am GMT+8",
  "content": "Fenerbahce have blamed Al Ittihad for the proposed transfer of N’Golo Kante falling through.\n\nIn a statement published on Tuesday, the Turkish club said all the necessary process for the France international moving to Istanbul, which would have seen striker Youssef En-Nesyri moving the other way, had been completed from their end.\n\nFenerbahce said agreements had “been reached with the players” for the transfers, Kante’s medical had been completed and that they had met their “obligations completely and on time”.\n\nThe Turkish club added “due to the opposing club’s incorrect entry of the relevant TMS information”, a request for an extension was requested and talks held with FIFA to help complete the deal, but “the opposing club has not completed the transactions without providing any justification to us. We understand and share the disappointment this process has caused within our community.”\n\nThe Athletic have approached Al Ittihad for comment.\n\nThe Athletic reported in January that talks were advancing for Kante to join the Turkish club after an official approach led by sporting director Devin Ozek was made.\n\nKante’s contract at Al Ittihad is expiring this summer, with a new deal not agreed. The Saudi Pro League team were previously not considering his departure in the winter window, though a winter exit was an alternative to losing him as a free agent in July.\n\nThe 34-year-old started Al Ittihad’s first 18 games league games of the season, recording two goals and one assist, though he was not included in the squad for the 1-0 win over Al Najma on Sunday.\n\nAl Ittihad’s star striker Karim Benzema left the club on Monday. The 38-year-old, who joined the Middle Eastern side in the summer of 2023, joined Saudi Pro League rivals Al Hilal.\n\nKante signed for Al Ittihad in the summer of 2023 after leaving Chelsea and has made 105 appearances, helping the club win the Saudi Pro League in 2024-25. It was the third league title of his career, after lifting the Premier League trophy with Leicester City in 2016 and with Chelsea in 2017. While at Chelsea, he also won the Champions League, Europa League, FA Cup and Club World Cup.\n\nAt international level, Kante made his debut in 2016 and has been capped 65 times, helping the nation win the World Cup in 2018.\n\nFenerbahce are second in the Turkish Super Lig, six points behind rivals Galatasaray.",
  "paragraph_count": 12
}