{
  "url": "https://www.nytimes.com/athletic/7020618/2026/02/04/ngolo-kante-fenerbahce-al-ittihad-transfer-news/",
  "scraped_at": "2026-02-04T18:05:02.105988",
  "title": "Fenerbahce sign N’Golo Kante, thank President Erdogan for help in resurrecting Al Ittihad deal",
  "author": "",
  "published_date": "Feb. 4, 2026Updated 5:51 pm GMT+8",
  "content": "Fenerbahce have completed the signing of N’Golo Kante from Al Ittihad.\n\nThe Turkish club released a statement on Wednesday thanking the country’s president Recep Tayyip Erdogan for his “significant support” in finalising the deal, a day after they had blamed the Saudi Pro League side for the proposed transfer falling through.\n\nFenerbahce had said in a statement on Tuesday that Al Ittihad had “not completed the (necessary) transactions” after Kante’s medical had been completed and a transfer extension had been requested.\n\nThe departure of the former Chelsea midfielder was later announced by his former club with a video on social media.\n\n“On behalf of myself and our club, I would like to express my gratitude to our president, Mr. Recep Tayyip Erdogan, for his significant support in ensuring the positive conclusion of this process, which will contribute to the development of both Fenerbahçe and Turkish football,” Fenerbahce president Sadettin Saran said on their website.\n\n“It should be known that throughout this process, the unwavering belief in the club, the strong support shown, and the confidence we felt from the great Fenerbahce fans have been our greatest source of motivation and strength.\n\n“Now is the time to bring that strength to the field and stand by our team.”\n\nKante, 34, had played in every league game this season for Al Ittihad, registering two goals and assists, but was left out of their recent win against Al Najma on Sunday. The France international joined the Saudi Pro League side in the summer of 2023 from Chelsea and made 105 appearances, helping the side to their league triumph in 2024-25.\n\nIt was the third league title of his career, after lifting the Premier League trophy with Leicester City in 2016 and with Chelsea in 2017. During his seven-year spell with the London club, he also won Champions League, Europa League, FA Cup and the previous iteration of the Club World Cup.\n\nKante has 65 caps for France and featured during their triumphant 2018 World Cup campaign. His most recent appearance came in a World Cup qualifying win against Ukraine in November.\n\nFormer Real Madrid forward Karim Benzema also left Al Ittihad in the closing stages of the winter transfer window, moving to rivals Al Hilal on Monday.\n\nFenerbahce are second in the Turkish Super Lig after 20 games, three points behind Galatasaray.",
  "paragraph_count": 12
}