{
  "url": "https://www.nytimes.com/athletic/7020879/2026/02/04/andy-carroll-court-case-not-guilty/",
  "scraped_at": "2026-02-05T09:39:57.247002",
  "title": "Former England striker Andy Carroll pleads not guilty to breaching non-molestation order",
  "author": "",
  "published_date": "Feb. 4, 2026Updated 9:03 pm GMT+8",
  "content": "Former England striker Andy Carroll has on Wednesday indicated a not guilty plea to breaching a non-molestation order.\n\nCarroll, who plays for Dagenham & Redbridge, arrived at Chelmsford Magistrates’ Court on Wednesday on crutches and wearing a protective boot on his left leg following surgery last week.\n\nThe 37-year-old was arrested on April 27 last year, in relation to an alleged offence in the previous month.\n\nCarroll said he wanted to have his case heard at a crown court rather than a magistrates’. He will next appear at Chelmsford Crown Court on March 4 for a plea and trial preparation hearing.\n\nAt that hearing, he will be asked to enter a plea and, if he pleads not guilty again, arrangements will be made for a trial. Carroll was placed on conditional bail.\n\nA non-molestation order is a court injunction that usually stops someone from contacting another person and may also ban them from going near their home or workplace.\n\nBreaching it is a criminal offence, with penalties ranging from a fine to up to five years in prison for the most serious cases.\n\nCarroll, who was wearing a long green coat and Arne trainers, gave his address as Hackney, in East London.\n\nHe has had an injury-disrupted season for Dagenham, who play in the National League South, the sixth tier of English football.\n\nLast week, Carroll posted on Instagram that he’d had surgery on his ligaments and a fracture. He missed the start of the season with a hamstring injury.\n\nCarroll was once Liverpool’s record signing when he joined from Newcastle United on a dramatic deadline day in January 2011 for £35million (now $48m), along with Luis Suarez, who arrived from Ajax.\n\nHe went on to have spells at West Ham United, Reading, West Bromwich Albion, Amiens and Girondins de Bordeaux, before signing for non-League Dagenham last summer, where he is also a minority shareholder.",
  "paragraph_count": 12
}