{
  "url": "https://www.nytimes.com/athletic/7018582/2026/02/03/inter-fans-ban-flare/",
  "scraped_at": "2026-02-04T18:05:23.882348",
  "title": "Inter fans banned for three away games after flare thrown towards Cremonese goalkeeper",
  "author": "",
  "published_date": "Feb. 4, 2026 1:23 am GMT+8",
  "content": "Inter fans have been banned from the team’s next three domestic away matches after a flare was thrown towards Cremonese goalkeeper Emil Audero in Sunday’s game between the two teams.\n\nSupporters of the Serie A leaders will be banned from travelling for those games and residents of the Lombardy region of northern Italy, which Milan is located in, will be banned from buying tickets for those matches.\n\nWith Inter leading 2-0 against Cremonese, a flare landed on the pitch next to Audero in the 49th minute and appeared to explode, with the Indonesia international immediately going to ground.\n\nThe referee stopped the game as medical checks were carried out on Audero. The 29-year-old appeared to be unharmed and was able to continue playing, with the scoreline remaining the same.\n\nThe Italian Interior Ministry issued a statement on Tuesday confirming the ban.\n\n“Following the serious disturbances that occurred, the Home Secretary has imposed a ban on away travel for Inter fans until 23 March 2026, as well as a ban on the sale of tickets to Lombardy residents for the same matches,” it said.\n\n“The measure is aimed at ensuring the protection of public order and safety and preventing the recurrence of incidents that could compromise the smooth running of sporting events.”\n\nThe ban covers Inter’s visits to Sassuolo on February 8, Lecce on February 21 and Fiorentina on March 22. Their Champions League play-off second leg against Bodo/Glimt on February 18 is not affected by the ban, nor is the Milan derby on March 8. Inter are regarded as the ‘away’ team at San Siro, though supporters will be allowed to attend the match as fans are not required to travel.\n\nInter are eight points ahead of second-placed AC Milan in the Serie A table, though their rivals have a game in hand.",
  "paragraph_count": 9
}