{
  "url": "https://www.nytimes.com/athletic/7018699/2026/02/03/la28-olympics-soccer-venues-announcement-stadiums/",
  "scraped_at": "2026-02-04T18:05:16.732160",
  "title": "LA28 Olympics announce six more venues across U.S. for soccer events",
  "author": "",
  "published_date": "Feb. 4, 2026Updated 4:44 am GMT+8",
  "content": "The organisers of the 2028 Los Angeles Olympics have announced six additional venues for the men’s and women’s soccer events, spreading the action across the United States.\n\nFrom east to west, the six new venues are NYCFC’s Etihad Park, which is under construction, Columbus Crew’s Scotts Miracle-Gro Field, Geodis Park in Nashville, St Louis City’s Energizer Park, San Diego’s Snapdragon Stadium, and PayPal Park in San Jose.\n\nOf these, San Diego’s venue is the largest, with a capacity of 35,000, and San Jose’s is the smallest, with 18,000 seats. But both competitions will play their final stages at the 90,000-capacity Rose Bowl in Pasadena.\n\nLA28 chief executive Reynold Hoover made the announcement during a presentation by the organising committee’s senior staff at the International Olympic Committee’s 145th Session in Milan on Tuesday.\n\nDescribing the venues as “premier, existing Major League Soccer stadiums”, Hoover said these cities “will help bring these Olympics to the world” and would spread “Olympic spirit coast to coast”.\n\nIn a press release timed to coincide with the Milan announcement, LA28’s chief of sport Shana Ferguson said the extra venues “mean more fans will witness this global event”.\n\nUnlike previous Games, the women’s competition at LA28 will feature 16 teams, in four groups of four, while the men’s competition will have only 12 teams, split into three groups of four. This means there will be 24 group-stage games in the women’s competition and 18 in the men’s, before both competitions progress to quarter-finals, semi-finals and two medal-round matches.\n\nThe men’s gold-medal match will take place at the Rose Bowl on 28 July, with the women’s final the following day. Ferguson added that the ticket draw for LA28 opens on 18 March and she urged “global football fans to register now for a chance to secure tickets”.\n\nThe match schedules will be revealed shortly before the first ticket drop in April, but the plan is to move the two competitions from east to west as they progress, in order to reduce travel demands and increase recovery time.\n\nStaging events outside an official host city is nothing new for the Olympics, with many previous hosts taking the same nationwide approach with the football tournaments. And LA28 had already announced that canoe slalom and softball competitions will be staged 1,300 miles east of Los Angeles in Oklahoma City.\n\nThe rest of the events, however, will take place in the Greater Los Angeles area and Hoover used the rest of his presentation to tell his audience that LA is ready, willing and very excited to host the Games for a third time.\n\nHe also addressed one of the Olympic family’s main concerns about LA28 by reassuring them that the organising committee has been in close contact with the U.S. federal authorities to insure that all athletes, coaches and officials will be able to enter the country without difficulty.\n\nWith this in mind, he said LA28 had just set up a “visa link” platform to help participants in the Games with their visa applications.\n\nAlso speaking in Milan, where the 2026 Winter Olympics open on Friday, were Casey Wasserman, the chair of LA28’s organising committee, and Gene Sykes, the president and chair of the U.S. Olympic and Paralympic Committee.\n\nSykes reiterated Hoover’s message on visas but was asked by IOC member Aicha Garad Ali, the former captain and coach of Djibouti’s handball team, if LA28 would copy Paris 2024’s idea of appointing a “visa ambassador” to lead in this area, as that had been “very helpful to African nations”.\n\nSykes said he was not aware of this particular role, or was not sure how it would work in the U.S., but assured her that LA28 would look at Paris’s efforts to see what they can learn and underlined the work that had already been done with LA28’s White House Task Force.\n\nWasserman used his speech to repeatedly talk up the Olympics’ power for uniting people in “complicated” and “challenging” times.\n\nIt has been a difficult week for sports and entertainment agency boss, as flirtatious emails between him and Ghislaine Maxwell, the jailed associate of sex offender Jeffrey Epstein, have just been published as part of the latest Department of Justice release of Epstein-related material.\n\nThe 51-year-old, whose grandfather was legendary Hollywood talent agent Lew Wasserman, issued a statement on Sunday that said he “deeply regrets” the emails, which are 22 years old but were sent when he was married to his former wife, and added that he had “no business or personal relationship” with Epstein.\n\nHe also pointed out that the emails were exchanged long before Maxwell’s complicity in Epstein’s crimes had come to light. She is currently serving 20 years for recruiting and trafficking girls to be sexually abused by Epstein.\n\nIOC president Kirsty Coventry was asked on Sunday if she was worried these emails might damage preparations for LA28 but the former Olympic swimming champion quickly dismissed the idea, saying it had not been discussed by the IOC’s executive board and she had nothing further to add.",
  "paragraph_count": 21
}