{
  "url": "https://www.nytimes.com/athletic/7018382/2026/02/03/man-city-pep-guardiola-ice-minnesota-palestine/",
  "scraped_at": "2026-02-04T18:05:09.342781",
  "title": "Manchester City manager Pep Guardiola speaks out on Minnesota killings, Palestine in news conference",
  "author": "",
  "published_date": "Feb. 4, 2026 6:30 am GMT+8",
  "content": "Manchester City manager Pep Guardiola used a news conference to speak out on a range of humanitarian issues, including calling the killings of Renee Good and Alex Pretti by U.S. federal agents indefensible and again expressing his support for Palestinians.\n\nGuardiola, 55, made the comments when speaking to the media ahead of City’s Carabao Cup match against Newcastle United on Tuesday.\n\nIt is not the first time Guardiola has spoken out on social issues during his 10 years as a Premier League manager. Most recently, last Thursday, the Spaniard gave a speech at a pro-Palestine concert in Barcelona, his hometown.\n\nOn Tuesday, Guardiola was asked about his players criticising referees and motivating them after perceived officiating injustices.\n\nAfter talking about his team and their performances this season, Guardiola then said: “We (City) have to do better, we have to find a way.”\n\nHe then began speaking about conflicts and suffering around the globe: “Never, ever in the history of humanity — never, ever have we had the info in front of our eyes watching more clearly than now: Genocide in Palestine, what happened in Ukraine, what happened in Russia, what happened all around the world, in Sudan, everywhere.\n\n“What happened in front of us. Do you want to see it? It’s our problem as human beings. It’s our problems.\n\n“In the end, it’s images, it’s not interpretation of good play, bad play, what happened here or there, should you play this player or that player.”\n\nThe U.N. has declared the situation in Gaza a genocide, but Israeli officials deny that and say they have allowed humanitarian aid.\n\nIn the same answer, Guardiola returned to the subject of his team and the Premier League, before then being asked a follow-up question about why the issues such as Palestine, Sudan and Russia matter to him to the extent where he is comfortable addressing them in public.\n\n“I appreciate it because it’s the first time in 10 years that one journalist asks me about that, it looks like you are not allowed to do it for your work, I don’t know,” Guardiola replied. “But is there somebody who sees the images from all around the world who is not affected?\n\n“Here, it’s not a question about right or wrong. Is there someone here that is not affected by what happens every single day?\n\n“Today, we can see it. Before, we could not see it. It hurts me. For me, it hurts. If it was the opposite side, it would hurt me. Wanting harm for another country? It hurts me. It’s not about the position. Every argument, I’m sorry, this is my feeling.\n\n“Completely kill thousands of innocent people, it hurts me. It’s no more complicated than that. No more. I have a lot of friends from many, many countries, a lot of friends, but when you have an idea and you need to defend (it) and you have to kill thousands, thousands of people, I’m sorry, I will stand up, always I will be there. Always.\n\n“I cannot imagine how anybody cannot feel that, when you see the images every single day, the fathers, mothers, kids, having happened what happened, their lives being destroyed and the people cannot feel a little bit of being attached? I’m sorry, I cannot feel it.”\n\nThe news conference returned to football matters before Guardiola was asked a final question on whether there is a reason he is speaking up more on these issues.\n\n“Not just for that situation — the genocide in Palestine,” he said. “Whatever cause that can (put) humanity in a better place … For many years I was (a supporter of the Spanish charity) Open Arms, here wearing (clothing), as the people go to the Mediterranean, running from countries because of the wars, people have to run away from their countries, go in the sea and go there and go on a boat to try to be rescued.\n\n“Don’t ask if it’s right or wrong, rescue him! It’s about the human being. After we can agree, we can criticise one thing or another thing but when you have an idea, you have to express it, but when people are dying, you have to help them. Protecting life is the only thing that we have, I was not happy, but not just about this part of the world, in every part of the world.\n\n“What happens right now with all the technological advances that we have, humanity is better than ever in terms of possibilities, we can reach the moon, we can do everything, but still right now we kill each other, for what? For what?\n\n“I see the images and I’m sorry it hurts, it hurts me, that’s why in every position I can help speaking up to be a better society — I will not change anything, but I try — I will be there. All the time.\n\n“It’s for my kids, for my family, for you, for all of you, for your families as well. For the kids and families of my players, all my staff. Everyone can do whatever he can in his job, in his life, (to be) the best, and the justice? From my point of view, justice — you have to talk.\n\n“You have to talk. Otherwise, justice moves on, moves on. Look what happened in the United States of America. With Renee Good and Alex Pretti. They have been killed, one a nurse — NHS (the UK’s National Health Service), imagine the NHS — five or six people around him, go on the grass, 10 shots. Tell me how you can defend that?\n\n“If you make something wrong, OK go to the tribunal, go and sue, go to jail if something is wrong, that is what happens in the modern (world). There is not a perfect society, I am not perfect, nobody is perfect, societies are not perfect but you have to work to be in a better place. A person who goes there to defend a woman, he is surrounded and killed for that. Who can defend that? I don’t know. I will be always in front of that.”",
  "paragraph_count": 23
}