{
  "url": "https://www.nytimes.com/athletic/7020697/2026/02/04/lionel-messi-newells-old-boys-return/",
  "scraped_at": "2026-02-05T09:40:04.554622",
  "title": "Newell’s Old Boys planning Lionel Messi return in 2027, vice president says",
  "author": "",
  "published_date": "Feb. 4, 2026Updated 7:31 pm GMT+8",
  "content": "The vice president of Lionel Messi’s boyhood team Newell’s Old Boys says the club are working on plans to bring the eight-time Ballon d’Or winner back to the side in 2027.\n\nMessi, 38, played for the Rosario-based club in Argentina from the ages of six to 13 before joining Barcelona’s La Masia academy.\n\nThe forward never played a senior game for Newell’s but scored 234 goals for their youth teams and one of the stands in their Estado Marcelo Bielsa home is named after him.\n\n“We are working on Leo playing for Newell’s in the first half of 2027,” the club’s vice president Juan Manuel Medina told Argentine publication TN, confirming that nothing had been decided or finalised but that the idea had started in 2024.\n\n“It’s a project that goes beyond Newell’s. It’s a project for the city of Rosario, the province, and Argentine football. It all depends on what we can offer in terms of infrastructure and a competitive sports program.”\n\nMessi joined Inter Miami in 2023 and signed a new contract with the club in October which runs until 2028.\n\nThe first half of 2027 is when Major League Soccer is planning a “transition season” and is scheduled to run from February to May, as the league is set to align their season with European calendars.\n\nMessi has spoken frequently of his affection for his hometown team and in 2017 expressed a desire to return at some point.\n\n“I’ve said many times that my dream is to play at Newell’s but I don’t know what will happen, and a part of that doubt is due to the way the country is at the moment,” he said via Marca. “I have a family and my children come first, and then me. I want them to grow up in a calm place, being able to enjoy life with security.”\n\nHe also paid tribute to his former club by revealing a Newell’s top after scoring for Barcelona in a 2020 La Liga match against Osasuna.\n\nMessi has scored 77 goals in 88 games since joining Miami in the summer of 2023 after two years at Paris-Saint Germain. He has won MLS Cup in 2025, the Supporters’ Shield in 2024 and the Leagues Cup in 2023.\n\nMessi spent over two decades at Barcelona after leaving his home country in 2000, winning ten La Liga titles and four Champions Leagues. He has frequently been linked with a return to Barcelona since his departure, but president Joan Laporta described this as “not realistic” in November.\n\nNewell’s are bottom in group A of Argentina’s Primera Division three games into the 2026 season, having finished bottom in 2025.\n\nMessi won the World Cup with Argentina in 2022, but at the time of the national team’s triumph, none of the starting line-up were playing club football in Argentina, Enzo Fernandez having transferred from River Plate that summer.",
  "paragraph_count": 14
}