{
  "url": "https://www.nytimes.com/athletic/7010600/2026/02/04/transfer-latest-winter-review-manchester-united-arsenal-liverpool-summer-plans/",
  "scraped_at": "2026-02-04T19:17:57.455471",
  "title": "The Transfer DealSheet: Latest summer window plans for Arsenal, Liverpool, Real Madrid and more",
  "author": "David Ornstein",
  "published_date": "Feb. 4, 2026Updated 5:56 pm GMT+8",
  "content": "Welcome to The Athletic’s review of the winter window — and our fifth and final edition of The Transfer DealSheet for this period of transfer business.\n\nOur team of dedicated writers, including David Ornstein, have taken you inside the market to explain the deals being worked on in this season’s winter transfer window. This included a look at the players who could arrive and the ones potentially on their way out, across the Premier League and beyond.\n\nThe information found within this article has been gathered according to The Athletic’s sourcing guidelines: unless stated, our reporters have spoken to more than one person briefed on each deal before offering the clubs involved the opportunity to comment. Those responses, when they were given, have been included in the Transfer DealSheet.\n\nIn this edition, we have Ornstein’s One To Watch in the summer window — and we review the business conducted by Arsenal, Chelsea, Manchester City, Manchester United, Newcastle United, Tottenham Hotspur, Barcelona and Real Madrid.\n\nThis article is long but detailed, so enjoy it all — or search for the team or player you want to read about.\n\nThe latest transfer window might have only just closed but already minds are turning to the next one and business that may be done during it.\n\nPremier League talents such as Elliot Anderson, Adam Wharton and Carlos Baleba will be back on the agenda — with prospects in other countries, such as Ayyoub Bouaddi, sure to attract interest and probable free agents, including Ibrahima Konate, Andy Robertson and Harry Wilson also having suitors. Few are more coveted, however, than Morgan Rogers, and admiration from elsewhere has only risen amid an impressive season for both Aston Villa and England.\n\nRogers was named PFA Young Player of the Year in August and signed a new contract three months later, which secures him until 2031, and that puts Villa in a strong place. The 23-year-old attacker looks on course to contend for personal accolades again this campaign, while he is an integral part of Villa’s title bid and appears set to figure prominently at the 2026 World Cup.\n\nHe was high on the transfer lists of leading suitors last summer, but his importance to Villa manager Unai Emery made that irrelevant, and the club naturally want Rogers at the heart of what they are building. Admirers from the UK and abroad are not expected to be dissuaded by such resistance, though, and it will be intriguing to see how Villa respond if their resolve is tested — especially should they miss out on qualification for the 2026-27 Champions League.\n\nBeyond the slick passing and perfectly-executed shots from distance, one of the key attributes that makes Rogers so highly coveted is his appreciation of space.\n\nWatching him play live is a joy at the best of times, but it is only when you see him up close that you understand just how often he is looking to maximise damage on the opposition by moving into the areas where they are not. Constant scanning, authoritative pointing to indicate what he thinks his team-mates ought to do, and a persistent demand to receive a pass will be guaranteed within a single sequence involving Rogers when Villa have possession.\n\nMapping his passes received shows just how liberated Rogers is when searching for the ball. He has played more often on the left side this season, but no part of the pitch is off limits for him to find space in Villa’s attack.\n\nGiven his long strides and wiry frame, Rogers’ driving runs through the heart of the pitch are also a feature of his game — which is highlighted in the graphic below. Get tight to him, and he can drop a shoulder to wriggle free in congested areas, but step off him, and he has the ability to take multiple players out of the game with a single lung-busting run.\n\nChris Weatherspoon\n\nHow much did they spend and how much did they bring in?\n\nCompared to last summer, virtually nothing. Arsenal went on a recruitment drive in the previous transfer window that could ultimately amount to more than £250million in expenditure, so it was not entirely surprising that they did not enter the market in this one.\n\nEqually, there were no major sales. Arsenal did, however, secure a loan fee for Ethan Nwaneri’s move to Marseille for the rest of the season — one that will be determined by how much playing time he gets in France.\n\nNwaneri has confirmed that the deal does not include any purchase option for Marseille. “Yes, that’s true. Anything is possible in football,” he told a press conference on Monday. “We’ll see what happens.”\n\nEqually, Arsenal do not have a recall clause for Nwaneri, so he cannot be brought back to ease any midfield concerns.\n\nWho have they signed?\n\nAt first-team level, there were no new arrivals.\n\nFor the majority of the month, there was no great urgency regarding January recruitment. Arsenal have a big squad, and a number of first-team players have returned to fitness recently. They were content to allow Nwaneri to join Marseille on loan and facilitate the permanent transfer of Oleksandr Zinchenko to Dutch club Ajax.\n\nIn the final few days of the window, however, the foot injury sustained by Mikel Merino prompted Arsenal to scour the market for a midfield signing.\n\nAs reported by The Athletic’s David Ornstein and Daniel Taylor, one of the conversations their sporting director Andrea Berta had related to Newcastle’s 25-year-old Italy international Sandro Tonali. Tonali’s representative reached out to Berta over the midfielder — a player admired by Arsenal for a long period of time.\n\nNaturally, Berta explored the opportunity — but Newcastle’s lack of interest in selling, plus the theoretical asking price being far beyond Arsenal’s financial capabilities, meant the conversation did not progress any further. No club-to-club talks took place.\n\nUltimately, Arsenal did not find any appropriate deal and will continue without first-team reinforcement.\n\nInstead, the majority of their transfer activity was focused on the academy.\n\nIn the days approaching the deadline, they explored a possible loan deal for Hearts’ 18-year-old striker James Wilson. That move failed to come to fruition, with neighbours Tottenham able to provide greater assurances over under-21s-level playing time and the possibility of a permanent move.\n\nArsenal did complete a move for another young Scottish talent, signing 18-year-old Evan Mooney from another Scottish Premiership side, St Mirren. They have also signed England Under-19 international defender Jaden Dixon, another who is 18, from Stoke City of the second-tier Championship.\n\nMooney and Dixon form part of a drive to supplement their academy group with external emerging talent. They join the likes of Victor Ozhianvuna and twins Edwin and Holger Quintero in committing their futures to Arsenal.\n\nWere there any deals they wanted to do that they didn’t get over the line?\n\nArteta was eager for Arsenal to add a new midfielder before deadline day to replace Merino. “When you lose a big player like this in the squad with four months to go and all the competitions to play for, you need to look, and we need to do everything that we possibly can to see if we have a player that is available,” he told a press conference on deadline day.\n\nDespite his words, given the proximity between that media session and the window shutting that night, Arteta must have been realistic about the prospect of a new signing.\n\nWith the deadline passed, Arteta must now make do with what he already has. Given the depth of talent assembled at the Emirates Stadium in recent years, that is not too onerous a task.\n\nAre there still any obvious gaps in the team?\n\nSimply put: no. Arsenal still have fantastic depth — illustrated by the fact that senior internationals such as Christian Norgaard and Myles Lewis-Skelly have had to be left out of matchday squads.\n\nWhat will their priority be in the summer?\n\nArsenal face the difficult task of improving an already impressive squad. After signing Martin Zubimendi, who turned 27 this week, and Norgaard, 32 next month, in the summer, they may look to introduce a younger profile into their midfield.\n\nSales will also be a priority: after the huge expenditure of last summer, they will need to start recouping cash through the market if they are to remain compliant with financial rules.\n\nWill they have money to spend?\n\nArsenal are expected to publish their annual financial results soon, which could offer some indications around their capacity to continue spending at such a high rate. Improving commercial revenues should facilitate further investment.\n\nAny prospective summer budget will be supplemented by two as yet undetermined factors: player sales and prize money.\n\nJames McNicholas\n\nHow much did they spend and how much did they bring in?\n\nNot much in either category, although Chelsea have made a profit. By getting Raheem Sterling off the books now, Chelsea feel they have made some major savings compared to if he had seen out the remaining 18 months of a contract worth over £300,000 a week.\n\nLoan fees always generate a tidy bit of extra income. The sales of academy talent Leo Castledine and Ato Ampah, in deals that have healthy sell-on clauses attached, improved their bank balance a little too.\n\nFacundo Buonanotte’s season-loan from Brighton & Hove Albion being cancelled made sense for the player. He was brought in as cover while Cole Palmer was coping with his injury issues, yet made only eight appearances. The attacking midfielder is now on loan at Leeds United until the summer.\n\nTyrique George has a great chance to prove himself on loan at Everton for the rest of the season. Outcast Axel Disasi, who was frozen out like Sterling, at least gets a chance to play senior football again on loan at West Ham United, also until the summer. The management of other loans was also a primary focus.\n\nWho have they signed?\n\nThere was only one significant addition in the end, the decision to recall centre-back Mamadou Sarr from loan at Strasbourg. The 20-year-old will compete for a first-team spot from the get-go. Sarr is rated highly at the club and, significantly, is also admired by new head coach Liam Rosenior, who worked with him for 18 months at Strasbourg until replacing Enzo Maresca in January. Chelsea see him as a similar profile of player to Dean Huijsen, who they tried to buy from Bournemouth last summer before he opted for Real Madrid.\n\nOn the academy front, Chelsea beat Manchester United to the signing of highly-rated Sheffield Wednesday left-back Yisa Alao. The initial fee for the 17-year-old is a six-figure sum, but add-ons can take it well past the £1million mark.\n\nWere there any deals they wanted to do that they didn’t get over the line?\n\nChelsea wanted to buy Jeremy Jacquet from Rennes but lost out to Liverpool. They were in discussions for most of the month, but the defender opted to move to Anfield. The switch will be officially completed in the summer.\n\nA major factor in Jacquet’s choice of Liverpool, Chelsea believe, could have been the competition he’d face from other young centre-backs at the London club. This includes Josh Acheampong, who they do not want to sell, and Sarr. There are no regrets that they missed out on Jacquet because of their decision to keep Acheampong and Sarr as part of their plans.\n\nThe club did make an enquiry to Juventus over a loan for Douglas Luiz, who spent the first half of the campaign on loan at Nottingham Forest. With Dario Essugo being ruled out until March, having not played all season, and Romeo Lavia being sidelined since November, they thought about adding some more depth to midfield. In the end, they decided against it, partly because Lavia is close to a first-team return and the form of Andrey Santos. After pulling out, Luiz went to Aston Villa, where he spent five years before joining Juventus in summer 2024, instead.\n\nAre there still any obvious gaps in the team?\n\nAs explained, Chelsea desire a centre-half (regardless of Sarr’s recall), a midfielder and an attacker. It should not be forgotten that a deal for Sporting CP winger Geovany Quenda is already in place for him to join in the summer.\n\nA decision will also be made whether goalkeeper Mike Penders, currently on loan at Strasbourg, will be added to the first-team squad to increase competition in that position.\n\nWhat will their priority be in the summer?\n\nTo sign players in the three positions highlighted above.\n\nWill they have money to spend?\n\nYes. Chelsea became the first Premier League club to make over £300million in sales last summer, and they will have more assets to sell in the next window too, to help fund further purchases. The fact that they were prepared to do business during January is a strong indication of where they stand financially.\n\nDo not forget, Chelsea banked in excess of £84million from winning the Club World Cup in July and have already brought in another £80m by progressing to the round of 16 in this season’s Champions League, with the possibility of more prize money to come.\n\nSimon Johnson\n\nHow much did they spend and how much did they bring in?\n\nWhile £3.5million was invested in academy-level youngsters, there were no incomings or outgoings to and from the first-team squad. The signing of 20-year-old central defender Jeremy Jacquet from Rennes of France in a deal that may rise to £60m will be part of Liverpool’s summer spend.\n\nAndy Robertson’s proposed move to Tottenham, in a deal that could have risen to around £5m, was called off after Liverpool decided they were not prepared to sanction his exit. The long-serving 31-year-old, who is set to be out of contract at the end of this season, saw his potential move shelved largely due to the club’s difficulties in recalling fellow left-back Kostas Tsimikas from his season-long loan at Roma to provide cover. Roma wanted a satisfactory replacement signed before letting Tsimikas return.\n\nHarvey Elliott’s situation at Aston Villa, where he is on a season-long loan, remained unchanged in the end.\n\nElliott started their most recent Europa League fixture last Thursday, but has rarely been in Unai Emery’s matchday squads. With no recall clause in last summer’s deal, the ball was in Villa’s court to negotiate a possible return to his parent club for the 22-year-old midfielder, but they were not prepared to incur that financial cost.\n\nWho have they signed?\n\nThe acquisition of Jacquet is a real coup, as he is viewed as one of the biggest prospects in that position, and there were several other centre-back additions to strengthen their academy ranks.\n\nMor Talla Ndiaye and Ifeanyi Ndukwe both caught the eye of scouts at November’s Under-17 World Cup. Ndiaye moved, in a £1million deal, from Senegalese club Amitie. The 18-year-old Senegal youth international has joined up with Rob Page’s under-21s squad.\n\nThe payment to Austria Vienna for Ndukwe could rise to £2.5million if all the various add-ons are triggered. Already 6ft 6in (198cm), the teenager played a key role in Austria’s journey to the final of that Under-17 World Cup, where they lost 1-0 to Portugal. He doesn’t turn 18 until next month, so he is expected to arrive on Merseyside for pre-season in July.\n\nLiverpool also added a third young centre-back from slightly closer to home: 19-year-old Noah Adekoya from fellow Premier League side Burnley.\n\nWere there any deals they wanted to do that didn’t get over the line?\n\nMarc Guehi was agonisingly close to becoming a Liverpool player in the summer, and there was an expectation that situation could be revisited in January.\n\nInstead, Manchester City signed the 25-year-old England international from Crystal Palace, with Liverpool deciding not to pursue the deal as it did not make financial sense for them.\n\nThe club were adamant that any January signing would be made with a view towards the long-term, rather than opting for a short-term fix, but the injury to Jeremie Frimpong, which left them without a fit right-back, did alter that.\n\nOptions were explored, but arranging a move for Lutsharel Geertruida, who played under Liverpool head coach Arne Slot at Feyenoord, with parent club RB Leipzig and Sunderland, where he is on a season-long loan, proved too complicated.\n\nAre there still any obvious gaps in the team?\n\nWhere do you want to start?\n\nAfter the Guehi deal fell through and summer signing Giovanni Leoni was lost long-term to an anterior cruciate ligament (ACL) knee injury in September, Liverpool have been light at centre-back. Joe Gomez has been the only backup to starters Virgil van Dijk and Ibrahima Konate.\n\nAnother issue has been the lack of depth in wide areas, after they decided not to directly replace Luis Diaz when he was sold to Bayern Munich in the summer. Other than Cody Gakpo and Mohamed Salah, Slot has only Federico Chiesa, who he is reluctant to use, and 17-year-old Rio Ngumoha, who he is managing carefully due to his age. Florian Wirtz has played on both flanks and Frimpong on the right, but those are not their preferred positions.\n\nThe struggles of both Gakpo and Salah for form have not helped, but the squad is also lacking certain characteristics, including pace and one-on-one duel winners.\n\nRight-back has been a persistent problem because of injuries to Conor Bradley and Frimpong. The former is not expected to play again this season after suffering knee bone and ligament damage at Arsenal in early January. Frimpong is out with a groin injury, which is more of a short-term issue.\n\nWhat will their priority be in the summer?\n\nCentral defence was an area that needed addressing, and Liverpool have been proactive by securing the signature of Jacquet. That was important because there continues to be no progress on a new contract for Konate. He is set to become a free agent in the summer.\n\nFurther additions in that area may be required, with Van Dijk another year older (he turns 35 in July) and because of Gomez’s lengthy injury history.\n\nAdding wingers will also be high on the off-season to-do list. As we’ve mentioned, Liverpool are short of options at those positions already, and there remains uncertainty over Salah‘s future after the comments he made in December about the club “throwing him under the bus”. He will turn 34 this summer.\n\nWill they have money to spend in the next window?\n\nYes, although they have already dipped into it.\n\nWhile they spent £450million on signings last summer, Liverpool also recouped over £200m through player sales, and they remain in a strong PSR position. They also generated £702m in revenue, according to analysis from financial firm Deloitte.\n\nHow much they can spend may depend on how their season turns out.\n\nLiverpool face a fight to qualify for the Champions League, even with the Premier League likely to have five places again in the 2026-27 edition. They remain in this season’s competition, but winning it — another route to qualification — will be very difficult. And missing out on the hugely lucrative top table of European club football would have financial ramifications.\n\nTheir small squad means there are not many players who could be sold to add to the funds available either.\n\nHow much did they spend, who have they signed, and how much did they bring in?\n\nCity spent an initial £20million ($27.6m) on Marc Guehi, plus the kind of large wage packet and other fees that the 25-year-old Crystal Palace and England centre-back would have been offered had he waited for a summer move, when he would have been out of contract.\n\nAntoine Semenyo cost £62.5million, which was ironed out late in the day as it was lower than the £65m release clause in his Bournemouth contract. Oscar Bobb’s move to Fulham brings in £27m.\n\nWere there any deals they wanted to do that they didn’t get over the line?\n\nNope. While City were criticised for not acting quickly on Semenyo — he scored a last-minute winner for Bournemouth against Tottenham on the same night City drew with Brighton last month — they moved for two players and got them both over the line with plenty of time to spare before Monday’s deadline.\n\nSemenyo has already played five times for City and looks at home in the team.\n\nAre there still any obvious gaps in the team?\n\nNot really, no. While there has been lots of talk of City’s spending over the past three windows, they have completely overhauled the team, and there may not need to be much business done in the summer as a result.\n\nRight-back is an area that would look weak if Matheus Nunes misses a few games, which is not a sentence anybody would have expected to read a year ago, but the former midfielder has excelled in defence.\n\nIf Bernardo Silva goes in the summer, then they would probably need to bring in a central midfielder to replace him, but there is no single area of the squad in desperate need of strengthening — as long as everybody is fit.\n\nWhat will their priority be in the summer?\n\nCity are monitoring right-backs, as well as a potential replacement for the long-serving Bernardo, who turns 32 this summer.\n\nWill they have money to spend?\n\nOf course, although there probably will not be a need to pay out huge amounts, and there may not be a desire to, either.\n\nThe squad overhaul begun last January has been largely funded by a couple of years of low spending/high income, combined with City obviously having money available for transfers. But part of that overhaul did include a drive to lower the wage bill and the belt has been tightened in other areas of the club over the last year or so, with various projects around the Etihad Campus ongoing.\n\nHow much did they spend and how much did they bring in?\n\nNothing spent, nothing really gained either. The only outgoing at anything approaching first-team level was Harry Amass’ loan to Norwich City of the Championship, after playing for Sheffield Wednesday in that division during the first half of the campaign.\n\nFrom a budgeting perspective, the most significant development of the month was confirmation that this will be Casemiro’s final season in Manchester.\n\nThe Brazil midfielder is one of United’s highest earners, with a salary of around £350,000-a-week in seasons where they are in the Champions League, and the club could have triggered an option in his contract to extend his stay for a fifth year.\n\nInstead, despite arguably playing as well and being as important as he has ever been during his three-and-a-half year spell at Old Trafford, the soon to be 34-year-old will leave at the end of the season, freeing up space in United’s wage budget.\n\nWho have they signed?\n\nNobody. Once the window opened, no major incomings were expected. United’s then head coach Ruben Amorim made that clear in his penultimate press conference before being dismissed.\n\nBefore the 1-1 draw at Leeds United on January 4, the Portuguese said that there were “no conversations” about incomings or outgoings at that stage, and that the window was “not going to change”. When asked if United’s budgets for the winter window had changed following conversations with director of football Jason Wilcox, Amorim simply told the reporter in question: “You are a smart guy.”\n\nWere there any deals they wanted to do that they didn’t get over the line?\n\nBy that point, United were already resigned to losing out on Antoine Semenyo, who was viewed as a potential January addition in the weeks leading up to the window, and qualified as a long-term target that they were willing to accelerate a move for.\n\nSemenyo was one of the options considered for Amorim’s two No 10 positions last summer. Amorim and Wilcox even dined with the then Bournemouth winger in London towards the end of last season, only for United to switch their focus to Bryan Mbeumo of Brentford. United revived their interest in Semenyo as the winter window drew near, holding talks with the 26-year-old’s camp, and could have paid his £65million release clause, but the player’s preferred destination was Manchester City, which is where he has ended up.\n\nPivoting towards Mbeumo and away from Semenyo last summer is not thought to have helped United’s cause in the race for a player who attracted interest from several Premier League rivals.\n\nAre there still any obvious gaps in the team?\n\nAmorim’s departure has led to a transition from his highly contentious 3-4-3 system to a more traditional 4-2-3-1 under interim replacement Michael Carrick. An obvious consequence of that switch is having one fewer centre-back on the pitch and one more midfielder, with Bruno Fernandes restored to his natural No 10 position.\n\nCasemiro, Kobbie Mainoo and Manuel Ugarte are the only established central midfield options for Carrick’s double pivot. An injury to one of those three would leave United light in the middle of the park. If two were unavailable at the same time, Carrick would have to find a makeshift alternative or turn to the academy.\n\nIf there was a case to make a short-term signing in any position, it was midfield. United’s left-hand side is also a little thin following Patrick Dorgu’s recent hamstring injury, which is expected to sideline the in-form Denmark international for 10 weeks.\n\nWhat will their priority be in the summer?\n\nCarrick is officially only the head coach for the rest of the season as things stand but he has said he is open to advising on the club’s midfield rebuild, which is all but certain to be United’s summer priority.\n\nThey are expected to be in the market for not just one but two midfielders, with Casemiro’s exit confirmed and Ugarte’s future uncertain. Elliot Anderson, Carlos Baleba and Adam Wharton are all hugely admired, with Anderson considered their first-choice target. Each of Nottingham Forest, Brighton & Hove Albion and Crystal Palace were always unlikely to allow one of their best and most valuable players to leave mid-season, but are expected to be more open to business come the summer.\n\nLeft-wing could also be looked at. During their talks with Semenyo, he was told he would not play as a wing-back in Amorim’s system but as a left-winger in a 4-3-3.\n\nWill they have money to spend?\n\nYes, but how much depends on a variety of factors, not least whether they return to the Champions League for next season. The riches that come with playing in European football’s elite club competition would make their summer a lot easier.\n\nWithout Champions League football in 2026-27, there is every chance United will have to borrow money to spend significantly and dip back into their revolving credit facility — essentially, a bank overdraft — which funded much of last summer’s £215million expenditure.\n\nAt last count, United had borrowed £295million of a possible £350m under their revolving facilities, leaving capacity to borrow a further £55m.\n\nMark Critchley\n\nHow much did they spend and how much did they bring in?\n\n£0 on the incoming front.\n\nA small amount was raised through the sales of youth products Ben Parkinson and Cathal Heffernan, to Falkirk of the Scottish Premiership and Harrogate in England’s fourth tier respectively, but nothing that dramatically alters their picture for profit and sustainability rules.\n\nWho have they signed?\n\nNobody new, much to fans’ frustrations, though tying Sven Botman down to a new deal until 2030 felt like an important step. The 26-year-old had entered the final 18 months of his contract and, despite persistent injury problems, remains a top-class defender with his prime ahead of him.\n\nEddie Howe did evoke unwanted comparisons with former Newcastle manager Alan Pardew when he repeated the phrase “like a new signing” back to a reporter in reference to Dan Burn during the final fortnight of January. The head coach was echoing the sentiment of the question — that having Burn back, given defensive injuries, would feel like a major boost — but, due to the lack of mid-season additions, that out-of-context quote was received negatively by some supporters.\n\nWere there any deals they wanted to do that they didn’t get over the line?\n\nNewcastle did not have any bids rejected, while defensively they never felt the ‘right player’ was ever achievable — even if Toulouse’s versatile Dayann Methalie and Club Brugge full-back Joaquin Seys were among those tracked.\n\nIn an ideal world, though, Kees Smit would have been Tyneside-bound. The 20-year-old AZ midfielder has a host of admirers across Europe. Newcastle recognised their best chance of trying to pull off an unlikely coup would probably have required a mid-season move, yet the expectation is the Netherlands Under-21 international will join one of the European giants this summer.\n\nMatt Targett also spent the month in limbo, unsure whether Newcastle would recall him from his successful loan spell at Championship neighbours Middlesbrough. Despite extending his recall clause, Newcastle were only ever going to exercise it in an emergency, and the 30-year-old remained on Teesside.\n\nOne deal they will not have wanted to do, and did not do, was selling Sandro Tonali. The midfielder was offered to Arsenal by his representative, but there were no talks with Newcastle. His theoretical asking price was also far beyond Arsenal’s financial capabilities.\n\nAre there still any obvious gaps in the team?\n\nBeyond their depleted defensive ranks — Tino Livramento and Fabian Schar are out injured until March and April respectively, leaving Howe short at full-back and centre-back, while Jamaal Lascelles, who admittedly has not played since September, has joined Leicester City of the Championship — Newcastle’s main deficiencies have been in attack.\n\nNick Woltemade made an impressive start to life on Tyneside, and Yoane Wissa has scored three goals since returning from injury, but neither has replaced summer departure Alexander Isak’s world-class finishing prowess (nor were they really expected to).\n\nIn midfield, too, Newcastle sometimes lack ingenuity, especially against sides defending in a low block, and a creative presence may offer a point of difference in those games. Alternatively, a metronomic passer in the engine room may aid Howe’s side on the ball, given their propensity to cede possession, especially in away games.\n\nWhat will be their priority in the summer?\n\nImproving and refreshing a first XI that has not been significantly reinforced through signings since the summer of 2023.\n\nFull-back, midfield and goalkeeper are priority positions, but in reality, Newcastle are considering options all over the pitch as they aim to take the next step in their evolution. The likelihood is that a young forward will arrive, with incomings and outgoings expected in midfield, and a youthful centre-half or two being sought, while replacing one of their wingers is not out of the question.\n\nSenior players, including 35-year-old Kieran Trippier, are also likely to depart, with 34-year-old Schar potentially following, meaning the squad-leadership group needs to be redrawn.\n\nWill they have money to spend?\n\nThe £125million ($172.4m) British-record sale of Isak to Liverpool on deadline day in September had a transformative effect on Newcastle’s finances and there is capacity to invest in multiple incomings during the off-season (even after spending an initial £241m last summer).\n\nThere are still limitations to what Newcastle can spend — especially on wages, with their disciplined salary structure still significantly lower than the so-called ‘Big Six’ average — but there is strong room for manoeuvre. The introduction of Premier League squad cost rules (SCR) in place of PSR (profitability and sustainability rules), which moves the system from being loss-based to ratio-based, for next season should also benefit Newcastle.\n\nWhile strategic sales may be made to offset incomings, offloading a key player against their will is not expected to be necessary.\n\nChris Waugh\n\nHow much did they spend and how much did they bring in?\n\nIt was a modest winter window from a net-spend perspective. Brennan Johnson — who was sold to Crystal Palace for £35million ($48m), a club-record signing for the south Londoners — was their only permanent departure.\n\nSpurs added Conor Gallagher from Atletico Madrid on a “long-term” deal for a very similar fee of €40million (£34.7m; $46.6m), while teenage Brazilian left-back Souza joined from Santos for a deal worth north of £10m.\n\nWho have they signed?\n\nGallagher is their marquee signing of the window, with Spurs having beaten outside-title-challengers Aston Villa to his signature. The 25-year-old has plenty of time to develop as a player and leader at Tottenham Hotspur Stadium, but brings a wealth of experience at the highest level, including international football with England. For a player who does not just bring quality on and off the pitch but also adds to the squad’s homegrown contingent, it appears a smart bit of January business.\n\nHe is joined in north London by Souza, who was confirmed as a Tottenham player on January 22 after an extended work permit application. Souza, 19, is relatively new to top-flight football, having only broken into Brazilian side Santos’ first team in 2025, but he is a highly-rated talent tipped as one for the future. While he may not be relied upon to play many minutes this season, particularly with Spurs already out of the FA Cup, he could flourish in the coming years, given time to adjust.\n\nOn deadline day, they also signed 18-year-old striker James Wilson on loan from Scottish league leaders Hearts in a deal including an option to make the move permanent in the summer. He will link up with the club’s under-21 squad.\n\nWere there any deals they wanted to do that they didn’t get over the line?\n\nYes, quite a few. Tottenham have been in the market for a starting left-winger in the summer, having targeted Antoine Semenyo at the start of the window, then at Bournemouth, and Manchester City and Brazil winger Savinho. They revisited Semenyo’s situation ahead of the winter window, but faced competition from England’s biggest and most successful clubs. With his final contribution in a Bournemouth shirt being a stoppage-time winner against Spurs, Semenyo left the south-coast club to join City on January 9.\n\nTottenham also asked about RB Leipzig forward Yan Diomande, who has had an excellent debut season in the Bundesliga, but were met with a swift rejection, with the German club unwilling to entertain interest until the end of the season. Diomande, 19, may be revisited as a target again in the summer, with the asking price indicated to be in the €100million range.\n\nThey were also in surprise negotiations to sign Andy Robertson, whose contract with Liverpool expires in the summer. As a two-time Premier League winner and part of the Anfield club’s 2019 Champions League-winning side, Robertson would have brought a wealth of experience and leadership, as well as on-pitch quality, to a squad short on proven winners.\n\nBut Spurs could not complete the deal, with Liverpool failing to secure a replacement for the 31-year-old Scotland international in time. Tottenham may revisit the situation in the summer, when Robertson will be a free agent, provided he does not extend his contract with the defending English champions.\n\nAre there still any obvious gaps in the team?\n\nTottenham need another starting-quality wide forward and a midfield controller. Mathys Tel’s emergence following Johnson’s departure will have given head coach Thomas Frank some encouragement that he can provide quality contributions as a starter and from the bench until the summer, with Dejan Kulusevski and Mohammed Kudus in line to return from their injuries well before then. And with Wilson Odobert enjoying his best stretch since signing from Burnley in 2024, there may just be enough to tide Spurs over.\n\nIn midfield, Pape Matar Sarr’s return following the Africa Cup of Nations gives the manager another senior player to use, though he is not a natural line-breaking passer. For that reason, Yves Bissouma could prove to be among Frank’s most pivotal players, having demonstrated his passing quality against Aston Villa and Burnley since playing his first minutes of the season for Mali at AFCON.\n\nBissouma has had conduct issues with Frank and previous coaches, but if he can stay disciplined for the remainder of the season, he has the quality to lift this Spurs team in possession.\n\nWhat will their priority be in the summer?\n\nThey will largely be the same as in the winter window, but they may find more joy. Robertson, who could be a free agent at that point, will likely still be a target as an on- and off-field leader. Spurs will look again for a starting wide attacker, and Diomande and Savinho could remain on their list of potential signings.\n\nIn midfield, Tottenham are likely to look again for positive, passing central midfielders. They may also look to strengthen in the goalkeeping department after a particularly difficult winter period for Guglielmo Vicario.\n\nWill they have money to spend?\n\nYes. Part of the reason for selling Johnson was to improve the club’s position in relation to the profit and sustainability regulations (PSR), allowing Spurs to remain aggressive and ambitious in the market.\n\nTottenham are a wealthy club, and under the Lewis family, whose stated ambition is to “win more matches, more often”, there is a desire to support the head coach with player investment. The question will be whether they can do the right deals.\n\nElias Burke\n\nPremier League clubs topping the £3billion mark last summer meant the 2025-26 season was always going to set a new benchmark in gross transfer spending, and a further £400m spend over the past month pushed the total on new players above £3.5bn.\n\nIt is a huge, unedifying sum, but one which nevertheless welcomes analysis.\n\nA way to dissect collective spending this year is to look at the age profile of players signed by England’s richest clubs.\n\nThe idea of football being a young man’s game was given more credence by the fact that just £49million (one per cent) was spent on players aged 29 or over. That’s not an especially surprising finding, and nor is how, for the eighth season running, Premier League clubs spent more money on players aged between 21 and 24 than any other cohort — £1.7bn went on that grouping this season, 49 per cent of the total spend.\n\nPerhaps of greater interest was the fact that a further £1.2billion went on players older than that. Signings aged between 25 and 28, generally considered a player’s peak years, comprised a third of spending this season, their highest share since 2018-19. Two 25-year-olds, Alexander Isak and Bryan Mbeumo, accounted for around £190m of that sum, but in general, there was a greater appetite to spend big on players for whom resale value will be difficult to achieve.\n\nOf the 16 players to command a fee of £50m or more, six were aged 26 or more: Matheus Cunha, Antoine Semenyo, Martin Zubimendi, Eberechi Eze, Viktor Gyokeres and Yoane Wissa. By comparison, in 2024-25, only one player fell into that same category of age and fee: Dominic Solanke.\n\nChris Weatherspoon\n\nHow much did they spend and how much did they bring in?\n\nBarcelona spent nothing on their first team and got one player in on loan: Joao Cancelo. On the other hand, they cashed in €8million for Dro Fernandez, a teenager who told the club he wanted a clearer path to first-team football and joined Paris Saint-Germain.\n\nMarc-Andre ter Stegen’s departure only freed up a small amount on the wage bill, as the deal with Girona was for a straight loan, with Barca covering the vast majority of the goalkeeper’s salary.\n\nWho have they signed?\n\nFull-back Cancelo, 31, joined on a loan until the end of the season from Saudi Arabian club Al Hilal. Barcelona are only contributing a share of his wage, around €4.5million in total. That is the amount freed up by defender Andreas Christensen’s anticipated long-term absence following a December knee injury. Barca were once again able to take advantage of the fine print in La Liga’s salary limit rules, which allow for some flexibility around long-term injuries.\n\nThe club did not spend more money, mostly because they couldn’t, as they are still over their salary limit. However, they did make several signings for Barcelona Atletic, their reserve team currently in Spain’s fourth tier.\n\nJuwensley Onstein, an 18-year-old Netherlands youth international, signed from Belgian club Genk. Egypt youth international striker Hamza Abdelkarim also joined from Cairo’s Al Ahly on a six-month loan. England youth international Ajay Tavares, a 16-year-old winger who also has a Portuguese passport, is expected to arrive from Norwich City of the Championship, while 19-year-old Uruguay youth international Patricio Pacifico has been signed on loan, with an option to buy, from Defensor Sporting Club.\n\nWere there any deals they wanted to do that they didn’t get over the line?\n\nAt the start of the window, coach Hansi Flick wanted to sign a centre-back. The club explored this and found there was no suitable candidate available on favourable terms. Instead, they switched their attention to Cancelo. Despite not being the perfect fit, he offers a temporary solution in defence.\n\nAre there still any obvious gaps in the team?\n\nBarcelona could clearly use another top-level centre-back. Flick is short of options in that department, with Christensen expected to be out for months and Eric Garcia, one of his most trusted lieutenants, often needed in other positions.\n\nBut none of the players Barca identified to cover that gap were available in the winter window — at least not for a price they could afford.\n\nWhat will their priority be in the summer?\n\nRobert Lewandowski is nearing the end of his contract, and Barca do not plan, for now, to offer him a new one. With the 37-year-old expected to leave, after four seasons at the club, a new No 9 will be the top priority.\n\nBarcelona will also have the option of signing Marcus Rashford for €30million (£25.9m; $35.5m at the current rates) when his season-long loan from Manchester United comes to an end in June. Barca want to keep him, but it is still unclear whether they will trigger that option or explore other ways to sign him. Either way, it will not affect their search for a new central striker.\n\nA new centre-back is also wanted. Barca have lacked an established defensive partnership this season, partly because of the multiple injuries they’ve suffered. The departure of Inigo Martinez last summer has not been properly addressed, despite Gerard Martin’s solid redeployment at the position, and a new addition would be welcomed by the coaching staff.\n\nWill they have money to spend?\n\nThis is still very unclear. Barcelona sources say they are confident the club can bring itself fully in line with La Liga spending rules, which would mean more freedom to operate in the summer transfer window, but those messages have been shared many times before.\n\nThe defining factor will once again be their salary limit. The goal is to reach the golden target known as the ‘1:1 rule’. That would mean Barca being able to re-invest all funds generated back towards salaries and registering new signings. New sources of income, mainly from commercial deals or player sales, would help in that department.\n\nLa Liga usually updates clubs’ salary limits shortly after the close of the winter window, so we should know more about Barcelona’s situation soon.\n\nHow much did they spend and how much did they bring in?\n\nThere was zero investment. No players arrived and in some ways, this was not a surprise.\n\nThe last first-team signing Madrid made in a winter window was Brahim Diaz, from Manchester City, in January 2019. The club argue that the market is inflated at this time of year, so the few good options available are too expensive.\n\nMadrid’s senior figures also believe the squad is good and complete enough to compete for all titles as it stands — even though only La Liga and the Champions League remain as possibilities after their recent Copa del Rey defeat by second-division Albacete.\n\nWere there any deals they wanted to do that they didn’t get over the line?\n\nDespite continuous offers of players from agents, Madrid rejected them all. The club did not even work on any deal.\n\nBack in the summer, then new (since fired) head coach Xabi Alonso wanted them to bring in more reinforcements, further to the €180million (£155m; $212m) spent on Alvaro Carreras, Dean Huijsen, Franco Mastantuono and Trent Alexander-Arnold.\n\nAre there still any obvious gaps in the team?\n\nThere is a consensus that Madrid need at least a centre-back and an organising midfielder.\n\nIn central defence, Antonio Rudiger and Eder Militao have suffered recurrent injuries, a situation surely influenced by Madrid’s intense schedule. Summer signing Huijsen has suffered two muscle injuries and academy product Raul Asencio has been playing for weeks while not fully fit. In midfield, the team is lacking creativity. There has not been a successful transition from the generational midfield of the now 40-year-old Luka Modric, who was not offered a renewal last season, and Toni Kroos, who retired in 2024.\n\nA source present at the club’s Valdebebas training centre on a daily basis last season told The Athletic in January that Madrid need “a right-back, a centre-back, a right winger and, above all, a central midfielder”. Alonso also asked for a central midfielder in the summer.\n\nWhen he was sacked last month, one of the complaints from those close to him was that the club had not given him the necessary tools to fully develop his vision for the team.\n\nWhat will their priority be in the summer?\n\nMadrid are looking at the market for centre-backs and midfielders.\n\nIn midfield, there is great admiration for Paris Saint-Germain’s Vitinha and Enzo Fernandez of Chelsea, but those players are considered almost impossible to sign from a financial point of view.\n\nPortugal international Vitinha renewed his contract last year until 2029 and is a key player for the French and European champions, with whom Madrid do not have good relations. Argentina international Fernandez might like the idea of playing for Madrid one day, but he is under contract until 2032 and Chelsea don’t want to sell him.\n\nCarlo Ancelotti asked for Alexis Mac Allister, now at Liverpool, before Alonso succeeded him in the summer. Although no deal was ever fully explored, Madrid received positive feedback from those around the Argentinian, now 27. Mac Allister is well-liked at the club, and his contract at Anfield until 2028 might make a deal more feasible.\n\nOne name that stands out is Como’s Nico Paz, another Argentina international, who has a strong chance of returning to his boyhood team in the summer after two seasons in Italy. That is the view of the club and the general expectation in the football world, with potential rival suitors parking their interest because of Madrid’s strong position. They have an option to buy back their 21-year-old academy graduate in June for around €9million.\n\nOther profiles with very positive reports are AZ’s Kees Smit and Adam Wharton of Crystal Palace. The Dutch club wants around €60million for Smit and have given leading agent Jorge Mendes a mandate to negotiate on their behalf. Both players were mentioned in conversations at Madrid last summer — although now Smit, 20, seems the more favoured of the two.\n\nMadrid are also aware that a final decision will have to be made soon over Dani Carvajal’s future. Their captain’s contract expires in June, and there are doubts about his renewal. If the 34-year-old were to leave, the right-back position would need reinforcing. Carvajal has played fewer than 30 minutes since returning from injury in early January, but feels ready to have more time on the pitch.\n\nWho has left and who could leave in the summer?\n\nEndrick departed on loan to French side Lyon, with no obligation or option to buy included in the deal. Madrid are counting on him in the future and did not understand why he played so little under Alonso. The 19-year-old striker’s priority is to succeed at the Bernabeu, but he wants to have a real chance to show his qualities, so his agents will review the matter in the summer.\n\nLeft-back Fran Garcia, who is under contract until 2027 but now fourth-choice in his position, could also leave. The 26-year-old wanted to join Bournemouth on loan in January, but Madrid blocked the move.\n\nHis situation is similar to that of 29-year-old Dani Ceballos, who was open to a departure in January if his former club Real Betis had made an offer. The midfielder has asked to leave in each of the past two summers, and the situation is expected to be repeated. Betis are his preferred destination, but no club has been able to afford Madrid’s asking price and the player’s salary (around €4.5million a year).\n\nDavid Alaba is expected to leave when his contract expires at the end of June, the month the defender will turn 34, as the club are not planning to offer him a renewal.\n\nWill they have money to spend?\n\nIn theory, yes. Their financial picture looks healthy. According to a recent deep dive by our football finance writer, Chris Weatherspoon, there would be margin to invest in the squad. However, except last summer, Madrid have been reluctant to do so in recent years. Departures could help financially, but the club is pessimistic, arguing that nobody wants to leave.\n\nMario Cortegana",
  "paragraph_count": 237
}