{
  "url": "https://www.nytimes.com/athletic/7021765/2026/02/04/anthony-davis-trade-mavericks-wizards-nba-deadline/",
  "scraped_at": "2026-02-05T14:41:10.475174",
  "title": "Anthony Davis traded from Mavericks to Wizards, capping Luka Dončić deal fallout: Sources",
  "author": "Christian Clark",
  "published_date": "Feb. 5, 2026Updated 7:44 am GMT+8",
  "content": "The Dallas Mavericks are turning the page on the biggest part of last season’s disastrous Luka Dončić trade.\n\nDallas is sending Anthony Davis to the Washington Wizards in a multi-player trade that will involve Washington’s sending back several draft picks, league sources confirmed to The Athletic.\n\nDavis will head to Washington, along with Jaden Hardy, D’Angelo Russell and Dante Exum. Dallas will receive Khris Middleton, AJ Johnson, Malaki Branham, Marvin Bagley III and draft compensation. The Wizards are likely to waive Exum but plan to keep Russell and Hardy, a team source said.\n\nAccording to a league source, Dallas will receive the least favorable 2026 first-round pick from the LA Clippers, Houston Rockets and Oklahoma City Thunder, meaning it likely will be 30th in the NBA Draft order. The 2030 first-round pick came from the Wizards’ Chris Paul-for-Jordan Poole trade with the Golden State Warriors a few years ago, and it will convey only if it falls from No. 21 to No. 30. Dallas will also receive three future second-round picks, though none were originally owned by the Wizards.\n\nThe Wizards envision a frontcourt of Davis, Alex Sarr and Bilal Coulibaly as being one of the best defensive frontcourts in the league. That statement should not be interpreted as meaning wing Kyshawn George will not be a starter or part of the Wizards’ long-term plans. Indeed, George is a central part of Washington’s nucleus and is highly valued for his two-way ability. It’s just that Coulibaly is Washington’s top perimeter defender, and a frontcourt of Davis, Sarr and Coulibaly ought to be a switchable, lengthy defensive menace, capable enough to help compensate for Trae Young’s deficiencies as a defender.\n\nHaving Davis and Young should help Washington’s young nucleus — which includes Tre Johnson, Bub Carrington, Will Riley, Coulibaly, George and Sarr — be more competitive in 2026-27 than it has been this season.\n\nBecause Davis is recovering from a hand injury, he may play only sparingly the remainder of this season and therefore would not diminish the Wizards’ chances in May’s draft lottery.\n\nA league source said this deal “came out of left field.”\n\nOne of the reasons the Wizards are said to be ecstatic is that the outgoing first-round picks have relatively little value.\n\nWhen healthy, Davis is one of the best defenders of his era. Meanwhile, the Utah Jazz on Tuesday agreed to a trade for Jaren Jackson Jr., another superb frontcourt defender, in which the Jazz had to send out three first-round picks.\n\nIn terms of outgoing draft capital, the price the Wizards paid to bring aboard Davis is much lower than the price the Jazz paid to bring aboard Jackson.\n\nDallas, meanwhile, needed to do two things with a Davis deal: shed salary and restock its cupboard of draft picks. The Mavericks had the fourth-highest payroll in the NBA, controlled only two first-round picks outright until 2031, and had no second-round picks until 2030, before the Davis trade. This move gives them more flexibility and ammunition as they try to reset around Cooper Flagg.\n\nThe trade will put an end to Davis’ tumultuous time in Dallas after he appeared in only 29 games in a calendar year.\n\nThe Mavericks acquired Davis last February in the Dončić trade. Former Mavericks general manager Nico Harrison had a long-standing relationship with Davis through Nike, with whom Harrison spent 19 years. Their rapport — and Harrison’s fractured relationship with Dončić — contributed to the Mavericks’ overlooking obvious concerns about doing the deal, namely Davis’ health.\n\nDavis was recovering from an abdominal strain when the Mavericks traded for him. He made his Mavericks debut last Feb. 8, when Dallas tallied a franchise-record 18 blocks in a win over the Houston Rockets. But Davis suffered a left adductor strain in the third quarter, which kept him out of the lineup for the next six weeks.\n\nDavis’ adductor strain was the first of four significant injuries in his one-year stint with the Mavericks. He had surgery to repair a detached retina in his right eye last summer. Davis then strained his left calf in Dallas’ fifth game of this season, causing him to miss the next 14 contests.\n\nIn a Jan. 8 loss to the Jazz, Davis sustained ligament damage in his left hand, which is expected to keep him out until at least late February.\n\nIn Davis’ time with the Mavericks, the team had a 16-13 record when he played and a 16-38 record when he didn’t. Davis’ inability to stay on the court was one of the biggest factors in the Mavericks’ decision to fire Harrison on Nov. 11 amid the team’s 3-8 start.\n\nDavis, who turns 33 in March, is owed $58.5 million next season and holds a $62.8 million player option in 2027-28. Davis had an interest in extending his contract with the Mavericks this summer, but it became clear Dallas would instead reset around Flagg.\n\nThe Mavericks hoped they could be a dangerous playoff team if they could ever get fully healthy this season. That never happened. Davis and Kyrie Irving had dreamed for years about becoming teammates but were able to share the court in only one game in Dallas. Irving tore the ACL in his left knee in March while Davis was still out with an adductor strain.\n\nThe Mavericks went to great lengths to make Davis feel comfortable in Dallas, in ways they never did with Dončic. Keith Chamberlain, Davis’ cousin, was given an official title with the team as a player relations manager, and Davis’ personal security guard, Garrett Partman, was brought on board as a player development manager.\n\nDavis was productive when he played, averaging 20.2 points and 10.8 rebounds, and was well-liked within the locker room. But he was never healthy enough to execute Harrison’s “vision” of contending for championships with Davis as a focal point.\n\nIt’s possible, depending on how the Lakers build around Dončić, that all the first-round picks Dallas received in the Davis and Dončić trades will be in the mid- or late first-round. But the Mavericks had to move Davis, whether it was now or this summer.\n\nThey chose now. It’s Flagg’s team now.",
  "paragraph_count": 24
}