{
  "url": "https://www.nytimes.com/athletic/7023625/2026/02/05/brighton-crystal-palace-spending/",
  "scraped_at": "2026-02-05T20:14:28.710544",
  "title": "Brighton boss Fabian Hurzeler ‘not jealous’ of Crystal Palace’s January spending",
  "author": "",
  "published_date": "Feb. 5, 2026 6:25 pm GMT+8",
  "content": "Brighton & Hove Albion head coach Fabian Hurzeler says he is “not jealous” of the big spending by rivals Crystal Palace during the January transfer window.\n\nSunday’s visitors to the Amex Stadium shattered their transfer record twice to bolster their forward line, paying £35million for Brennan Johnson from Tottenham Hotspur and an initial £43m on deadline day for Jorgen Strand Larsen from Wolverhampton Wanderers.\n\nThe only fee paid by Brighton in the winter window was around £1.7m to bring 34-year-old midfielder Pascal Gross back from Borussia Dortmund, as the club maintained a policy of concentrating their main business on the longer summer transfer window.\n\n“I’m not jealous, I am really happy with the squad we have here,” said Hurzeler during his news conference on Thursday for the Palace game. “I am focusing on my squad, our process, our development. We know we still have a lot of work to do, but we also know we have a lot of potential in the squad and I have a lot of belief.\n\n“I think that is the main thing, the belief I have in this group to achieve the things we want to achieve is unbelievably high, because I see them working together, how they support each other, how they hold each other accountable, how they just behave with each other. This togetherness is sometimes more important than spending a lot of money. Mentality, togetherness can beat individual quality. That has always been the way for Brighton.”\n\nSweden international Yasin Ayari is ruled out by a shoulder injury sustained in Saturday’s 1-1 home draw against Everton. That leaves Hurzeler choosing between Gross, Jack Hinshelwood, Diego Gomez or Matt O’Riley to partner Carlos Baleba in midfield on his 100th Brighton appearance.\n\nGross scored against Everton playing at No 10 for the second match running. Hinshelwood and Gomez are back from illness and a training injury respectively, while O’Riley has returned from a loan spell with Marseille.\n\nBrighton are 13th after one win in 11 league games. They are two points and two places above Palace, who have gone nine matches without a league victory.",
  "paragraph_count": 8
}