{
  "url": "https://www.nytimes.com/athletic/7024036/2026/02/05/jamie-gittens-injury-chelsea/",
  "scraped_at": "2026-02-06T00:18:45.908166",
  "title": "Chelsea’s Jamie Gittens set for ‘long-term’ absence after hamstring tear",
  "author": "",
  "published_date": "Feb. 5, 2026Updated 10:27 pm GMT+8",
  "content": "Head coach Liam Rosenior has confirmed Jamie Gittens has suffered a hamstring tear and is expected to be a “more long-term” absentee for Chelsea.\n\nThe winger was substituted in the 26th minute of Chelsea’s 3-2 comeback win over West Ham United on Saturday and was not in the squad for their Carabao Cup trip to Arsenal on Tuesday evening.\n\n“Jamie is looking a little bit more long-term,” Rosenior said. “He’s got a tear in his hamstring, which is a real shame for him.\n\n“Obviously, I’ve not worked with him for too long, I’ve known about his career and what an outstanding player he is, so that’s going to be a big miss for us. It’s too early to say (how long he will be out for).”\n\nGittens has made 27 appearances for Chelsea since joining from Borussia Dortmund in the summer, scoring one goal and providing five assists. His absence leaves Alejandro Garnacho, Pedro Neto and Estevao as the remaining natural wingers in Rosenior’s squad after Tyrique George departed for Everton on deadline day.\n\nNeto and captain Reece James also missed Tuesday’s 1-0 (4-2 aggregate) defeat, and Rosenior said it was too early to confirm whether the pair would be available for Saturday’s trip to Wolverhampton Wanderers.\n\nCole Palmer and Estevao are both fit to play a full 90 minutes against Wolves. Rosenior was also asked how long it would be until Palmer, who has struggled with injury this season, would be able to play full games back to back.\n\n“There isn’t a time frame where he’s going to be perfect in a month or two months or three months, it’s just game to game,” Rosenior said. “And that’s the way that we’ve been working with him and I think that’s the way we’ll have to continue working with him and a few of our players.\n\n“He has been magnificent, he wants to be playing every minute of every game. We know the player that he is, the character that he is, but he’s also maturing as a human being and he understands the bigger picture, which is his career.\n\n“The lads played in the Club World Cup and then they went through the summer with no break and they’ve got to play so many games, our schedule has been crazy, then they have World Cups to go to and international games to play. I want to make sure that the wellbeing is correct for these players for their careers as well.”",
  "paragraph_count": 10
}