{
  "url": "https://www.nytimes.com/athletic/7024334/2026/02/05/chelsea-arsenal-rosenior-respect-semi-final-carabao-cup/",
  "scraped_at": "2026-02-06T00:18:18.010408",
  "title": "Chelsea’s Liam Rosenior accuses Arsenal coaching staff of lacking respect in Carabao Cup semi-final",
  "author": "",
  "published_date": "Feb. 6, 2026Updated 12:17 am GMT+8",
  "content": "Chelsea head coach Liam Rosenior says Arsenal’s coaching staff showed a lack of respect after accusing them of encroaching on his side’s half of the pitch during the half-time warm ups in Tuesday’s Carabao Cup semi-final defeat.\n\nFootage captured by Sky Sports showed the 41-year-old coach appearing to shout “that’s your half! That’s your f****** half. F****** stay there,” during the two side’s half-time preparations at the Emirates Stadium.\n\nRosenior was asked about the incident during Thursday’s press conference and clarified he had taken issue with the alleged behaviour of Arsenal’s coaching staff, not the opposition players.\n\n“It wasn’t the (Arsenal) players,” Rosenior said. “When you warm up, you have your half, the other team have their half. I’ve never asked my team or my coaches to encroach on the opposition’s territory. In that moment, I didn’t think it was right where they were operating.\n\n“They were affecting my lads’ warm-up and my staff’s warm-up. So, I asked them, maybe not politely, to make sure they stay in their half. I’m not here to have mind games. It’s just what I think is right and respectful. Hopefully, we respect that and other teams do too.\n\n“There are certain etiquettes in football. I always try to be as respectful as possible. I’ve never asked my coaches. I don’t have an issue with anyone at Arsenal Football Club.\n\n“(They have) a fantastic manager. Mikel Arteta is someone I’ve got so much respect for. It was just in that moment, I didn’t think that respect was shown to my team.”\n\nArteta was not on the pitch while Rosenior criticised the Arsenal coaching staff.  When asked about the new Chelsea boss on January 13, prior to their meeting in the first leg, Arteta said: “I know people who have worked with him (Rosenior).\n\n“I know people who have been close to him in his journey, especially in his journey as a coach, and they talk really highly of him.”\n\nA stoppage-time goal from former Chelsea forward Kai Havertz secured a 1-0 victory for Arsenal on the night (4-2 on aggregate) and their passage to the final. The north London side will face Manchester City at Wembley Stadium on March 22.\n\nFollowing Tuesday’s victory, the Arsenal manager again praised his Chelsea counterpart, saying: “The margins were going to be small because they (Chelsea) are a really good side. They compete so well and they are really well coached.”\n\nRosenior also confirmed in the same press conference that Jamie Gittens has suffered a hamstring tear and is expected to be a “more long-term” absentee.",
  "paragraph_count": 12
}