{
  "url": "https://www.nytimes.com/athletic/7024394/2026/02/05/cristian-romero-outburst-dealt-with-internally-by-tottenham-thomas-frank/",
  "scraped_at": "2026-02-06T02:20:38.908055",
  "title": "Cristian Romero outburst ‘dealt with internally’ by Tottenham – Thomas Frank",
  "author": "",
  "published_date": "Feb. 6, 2026Updated 1:09 am GMT+8",
  "content": "Thomas Frank, the Tottenham Hotspur head coach, says Cristian Romero’s latest outburst on social media has been ‘”dealt with internally” by the club.\n\nIn an Instagram post, uploaded around half-an-hour after Monday’s 7pm transfer deadline, Romero said it was “unbelievable but true and disgraceful” that Spurs “only had 11 players available” for the 2-2 draw with Manchester City a day earlier.\n\nSpurs lost a number of players to injuries last month, leaving Frank admitting last week that his squad was weaker at the end of the window than the start – in spite of the additions of Conor Gallagher from Atletico Madrid and young full-back Souza.\n\nRomero was named Spurs captain by Frank in the summer following the departure of Son Heung-min to Major League Soccer.\n\nAsked his view on his skipper’s post, Frank said: “If you want to know what he meant, you of course need to ask him. That’s the right way to take that question.\n\n“Cuti is a very passionate character and player who wants to leave everything on the pitch and is very ambitious. He wants to win every single time. Sometimes when you are like that, sometimes there can be an outburst. It happened this time and it’s something we of course dealt with and dealt with internally.\n\n“There are a lot of ways of doing things,” continued Frank, who declined to say if Romero had been fined by the club.\n\n“Cuti has been very good for us this season and the past seasons. I think that is very important to be aware of. I wouldn’t have done it. That is my message.”\n\nIt is not the first time the Argentine, who came off at half-time against City due to illness, has appeared to criticise the Spurs hierarachy on social media. After the 3-2 defeat at Bournemouth in January, Romero said “it should be other people coming out to speak” but “they only show up when things are going well, to tell a few lies”. He later re-uploaded the post without the part about “lies”.\n\nLast season, after a painful defeat to Chelsea in December 2024, Romero appeared to take aim at Spurs’ lack of ambition in an interview with Spanish broadcaster Telemundo Deportes, comparing their spending unfavourably with the likes of Manchester City, Liverpool and Chelsea.\n\n“The last few years, it’s always the same – first the players, then the coaching staff changes, and it’s always the same people responsible,” he added.\n\nIn another apparently pointedly-timed post, Romero paid tribute to Frank’s predeccessor Ange Postecoglou hours after the Dane’s appointment was announced in the summer, saying the Australian succeeded “despite the many obstacles that always existed and always will exist”.\n\nAsked about Romero’s repeated blow-ups, Frank said: “First and foremost, I don’t know if it’s four (separate incidents). Maybe you got better numbers than me. I know after the Bournemouth game and this game (Manchester City), those are the two (incidents) I can relate to. Of course, like with a lot of things, we’re dealing with it internally in terms of what we’re taking care of it. That’s my main message to that.\n\n“I think it shows that Cuti is extremely passionate, he wants to win, he wants to do everything he can together with his teammates to achieve great things, but you need to ask him (what it means) next time you speak to him.”\n\nRomero is available for Saturday’s lunchtime kick-off against Manchester United at Old Trafford, and is expected to be partnered at centre-half by Micky van de Ven, who has missed the last two matches.\n\n“Micky is good, he trained today,” said Frank. “He is available for selection for Saturday. Djed (Spence) is getting closer. He will be a little bit touch and go but there is a good chance he could be ready.”",
  "paragraph_count": 16
}