{
  "url": "https://www.nytimes.com/athletic/7021027/2026/02/05/cristiano-ronaldo-al-nassr-transfers-release-clause/",
  "scraped_at": "2026-02-05T18:17:23.405844",
  "title": "Cristiano Ronaldo’s Al Nassr absence, transfer frustrations and €50m release clause",
  "author": "Dan Sheldon",
  "published_date": "Feb. 5, 2026 1:14 pm GMT+8",
  "content": "Cristiano Ronaldo is the highest-paid footballer on the planet.\n\nSaudi Pro League (SPL) club Al Nassr pay him more than £175million ($240m) a year but Ronaldo, who turns 41 on Thursday, was not involved in their last game following a disagreement over how the club is being managed.\n\nThe former Manchester United and Real Madrid player, who has a €50million (£44m, $60m) release clause in his contract, was not part of Al Nassr’s squad for their 1-0 win against Al Riyadh on Monday night, and there has been no guarantee that he will be back for their match on Friday against Al Ittihad.\n\nSources at Al Nassr, speaking on the condition of anonymity, said “it’s totally impossible to predict” what will happen next with Ronaldo, adding “it will be day by day”.\n\nIt was the first SPL match that Ronaldo, Al Nassr’s captain, has missed this season and it has prompted questions over his long-term future in Saudi Arabia, even though he only signed a new two-year contract last summer to keep him at the club until at least 2027.\n\nAl Nassr are one of the four SPL clubs majority-owned by Saudi Arabia’s Public Investment Fund (PIF), with PIF also owning 75 per cent stakes in Al Hilal, Al Ahli and Al Ittihad.\n\nHere, The Athletic answers the key questions surrounding Ronaldo’s situation at Al Nassr…\n\nAs you would expect from a player closing in on 1,000 career goals after moving to a weaker league, Ronaldo has continued to find the back of the net at a similar rate to his spells with Real Madrid and Juventus.\n\nBut even though he has scored 111 goals in 127 matches for Al Nassr, the significant trophies are yet to follow.\n\nThey were top of the SPL when he joined in January 2023, but they finished second to Al Ittihad that season and have not won the league title or reached the final of the AFC Champions League since Ronaldo arrived. The only trophy he has won at Al Nassr is the Arab Club Champions Cup in August 2023.\n\nThis season could be different, though, as Al Nassr are second in the league, only one point behind Al Hilal, and have won five games on the bounce.\n\nWhen Ronaldo signed his extension seven months ago, the club posted a short video on social media that ended with him saying, “Al Nassr forever,” which should give an indication of how satisfied he seemed to be with their direction of travel.\n\nRonaldo feels let down by the Al Nassr hierarchy because he believes they did not adequately strengthen the squad during the January transfer window, only signing Abdullah Al-Hamdan, a Saudi Arabia international centre-forward, from Al Hilal, and Haydeer Abdulkareem, an Iraqi midfielder, from Al-Zawraa SC.\n\nDespite winning five games in a row, Al Nassr lost against Al Ahli and Al Hilal in January, their two main rivals for the SPL title.\n\nThe former Manchester United forward is desperate to win the league with Al Nassr and they are in a position to achieve that goal, so the fact they did not make any marquee signings in January to help them get over the line has irked him.\n\nInstead, Ronaldo watched as another PIF majority-owned club, Al Hilal, significantly strengthened their squad by signing former Real Madrid team-mate Karim Benzema from Al Ittihad.\n\nThis has led Ronaldo to feel there are different levels of ambition at the PIF clubs and that Al Nassr have not shown the same level of intent, while perhaps overlooking the impact his £175million salary must have on their ability to spend.\n\nIn the summer, Al Nassr paid €30m up front to sign Joao Felix from Chelsea, with add-ons potentially taking the overall package to €50m, and also spent big — a reported €45m — to land Mohamed Simakan from RB Leipzig after an initial loan spell.\n\nDespite Ronaldo’s absence on Monday night, Al Nassr continued their good form, with Sadio Mane scoring the only goal against Al Riyadh.\n\nAl Nassr were contacted for comment on various points in this article.\n\nSenior sources at Al Nassr with knowledge of Ronaldo’s thinking, speaking on the condition of anonymity, noted on Wednesday that the player’s frustration does not solely stem from the Benzema transaction.\n\nThey say Benzema’s transfer was the final trigger but that Ronaldo’s irritation goes far deeper, believing the club is not being supported operationally and financially.\n\nRonaldo’s protestations, the senior source added, are about defending the club’s interests and wanting equal treatment.\n\nHowever, sources close to PIF stressed that the sovereign wealth fund has no role in sporting decisions at any of the four clubs, and none of the PIF representatives sit on the sporting committees of their teams.\n\nThe same sources noted that there are clear and deliberate divisions between the investment, sporting and business sides of the PIF-owned clubs, enabling them to operate independently as opposed to being run as one group.\n\nPrince Alwaleed bin Talal controls the minority stake in Al Hilal and the deal to bring in Benzema, 38, is understood to have been plotted and bankrolled by the billionaire, rather than it being a PIF initiative.\n\nInterestingly, Ronaldo and Benzema, as well as being handsomely paid by their clubs, are also ambassadors for the 2034 men’s World Cup, which is being hosted in Saudi Arabia, with Ronaldo saying in one promotional video that it will be “the best ever” edition of the tournament.\n\nBecause of his commercial ties to the 2034 World Cup, you might expect Ronaldo would rather not rock the boat too much over how Al Nassr is being run.\n\nThere is also Ronaldo’s relationship with the Saudi crown prince Mohammed bin Salman, with whom he attended a dinner at the White House as guests of Donald Trump, the president of the United States, in November.\n\nIt is important to separate how the four PIF-owned clubs operate compared to the other 14 SPL sides, especially for recruitment.\n\nCentral to how the SPL clubs conduct their transfer business is the Player Acquisition Center of Excellence (PACE) programme, implemented in 2023-24 and led by Michael Emenalo, the director of football for the SPL and a former technical director at Chelsea.\n\nThis PACE system sets a central budget and allocates funds to the SPL clubs and works with teams to target new signings.\n\n“The clubs choose the players and we document that through request forms signed by the clubs and both the technical and financial departments of the SPL,” Saad Al Lazeez, the former vice chairman of the SPL, said in a statement explaining how the recruitment process works in May 2024.\n\n“Once a player is selected and the green light is given to negotiate with them within the allocated budget, the club has the full freedom to negotiate the deal based on the player’s market value and the assigned budget.”\n\nThe four PIF majority-owned sides are in a different boat, though.\n\nThey can fund transfers in a way others can’t due to their vast resources. However, it is worth noting there are myriad projects taking place in Saudi Arabia that require sizeable investment, so the spending still needs to be measured.\n\nSince Ronaldo joined during the 2022-23 season, Al Nassr have spent a considerable amount of money on player acquisitions.\n\nDuring his first summer transfer window at the club, they spent — according to Transfermarkt — more than €150million on players including Mane (€30m), Otavio (€60m), Aymeric Laporte (€27.5m) and Seko Fofana (€25m).\n\nThe spending continued the following season, with another nine-figure outlay on multiple signings. Jhon Duran joined in January 2025 on a five-and-a-half-year deal from Aston Villa for €77m, only to leave on loan to Fenerbahce for the 2025-26 campaign six months later — not long after Ronaldo signed his contract extension.\n\nThis season, Al Nassr added Simikan and Joao Felix to their squad, and also signed Kingsley Coman from Bayern Munich, taking their overall expenditure above €100m once again.\n\nSince Ronaldo’s arrival, Transfermarkt shows that Al Nassr’s spending (€414m) is similar to Al Ittihad (€380m) and Al Ahli (€386m).\n\nAl Hilal, on the other hand, have spent considerably more, with their overall outlay since January 2023 totalling around €650m. This includes the signings of Neymar, Ruben Neves, Malcom, Joao Cancelo, Kalidou Koulibaly and Darwin Nunez.\n\nGiven his stature, Ronaldo is an extremely influential figure.\n\nJose Semedo, the club’s Portuguese chief executive, is close to Ronaldo, as is Simao Coutinho, Al Nassr’s Portuguese sporting director, so it is not as though the five-time Ballon d’Or winner lacks allies on the board.\n\nThat said, the real power at a football club lies with the owners. They are the ones who sign off on transfer budgets and other important decisions.\n\nRonaldo has shown in the past that he is not afraid to speak out if he is unhappy, perhaps most famously in November 2022, when his interview with broadcaster Piers Morgan led to his Manchester United contract being terminated.\n\nNobody at the club was safe from his stinging criticism, whether it was Erik ten Hag, then his boss at United, or the Glazer family’s running of the club.\n\nRonaldo joined Al Nassr at the end of December 2022 as a free agent after being released from Manchester United.\n\nThen 37, he became the figurehead of the league’s aggressive plans to attract the biggest players in football, seemingly no matter the financial cost. Other names, including Neymar, Riyad Mahrez, Mane and Benzema, joined before the 2023-24 season.\n\nThree years on, Ronaldo remains the most prominent footballer in Saudi Arabia, and is arguably the most famous player on the planet.\n\nAlthough the two-year contract he signed last summer further cemented his relationship with PIF and Al Nassr, it will only have 12 months remaining once the summer window opens.\n\nHis €50m clause can be triggered this summer, too, but it remains to be seen whether one of Europe’s leading sides or an MLS team would be willing to compile a significant financial package for a 41-year-old.\n\nSaudi Arabia’s sovereign wealth fund has made plenty of big splashes in sport, whether that is buying Newcastle United in October 2021, launching LIV Golf the following year at a staggering expense, or their investments in the four SPL sides.\n\nThey also recently led the $55billion acquisition of Electronic Arts, the gaming company most famous for its EA Sports FC game, in October.\n\nAnd with World Cup preparations underway, you would expect their investments to continue. However, there has been a shift in PIF’s strategy over the past couple of years, which, as the Financial Times reported, has seen the fund focus on the domestic economy rather than international deals.\n\nRonaldo has not commented publicly on his situation at Al Nassr. What will happen between him and the SPL side remains unclear.\n\nAl Nassr’s next match is against Al Ittihad on Friday. On Thursday, he posted an image of himself training with the first team, but there was no confirmation from the club that he would be part of the matchday squad for the Al Ittihad game.\n\nAl Nassr need to keep up their winning form to maintain the pressure on Al Hilal, and there is every possibility that Ronaldo feels as though he has made his point and returns to the fold.\n\nBut if he is absent once again, it will fuel speculation that the rift may not be salvageable.",
  "paragraph_count": 59
}