{
  "url": "https://www.nytimes.com/athletic/7023024/2026/02/04/los-angeles-dodgers-white-house-visit/",
  "scraped_at": "2026-02-05T14:42:10.502658",
  "title": "Dodgers expected to visit White House to celebrate World Series win: Source",
  "author": "",
  "published_date": "Feb. 5, 2026Updated 12:08 pm GMT+8",
  "content": "Despite further calls from their fan base asking the team to skip the tradition, the Los Angeles Dodgers are expected to visit the White House to celebrate their back-to-back World Series championships, a league source confirmed to The Athletic on Wednesday.\n\nThere hasn’t been a date set for the team’s potential visit and the organization hasn’t formally accepted an invitation, though a White House official told the California Post that the team plans to attend. President Donald J. Trump initially invited the Dodgers shortly after they knocked off the Toronto Blue Jays in seven games to become baseball’s first repeat World Series champions in 25 years.\n\nThe Dodgers declined comment to The Athletic.\n\nTeam president Stan Kasten told the Los Angeles Times this past weekend that the organization didn’t have anything yet to announce about a potential visit. The Dodgers visited the White House in 2021 with President Joe Biden and last April with Trump.\n\nWhile their 2025 visit was met with backlash, the club cited baseball tradition. All members of the 2024 title-winning team who were part of the traveling party were in attendance. That included Mookie Betts, who skipped the White House visit when Trump was in office for the Boston Red Sox’s 2019 celebration, and Kiké Hernández, who called for Trump to “show some humanity” in 2017.\n\n“It’s not a political stance that I’m taking,” Betts said last April. “I know no matter what I say, what I do, people are going to take it as political, but that’s definitely not what it is. This is about an accomplishment that the Dodgers were able to accomplish last year.”\n\nDodgers manager Dave Roberts told the Los Angeles Times this weekend that he would attend if the organization accepted the invitation.\n\n“I’ve never tried to be political,” Roberts said. “For me, I am going to continue to try to do what tradition says and not try to make political statements, because I am not a politician.”\n\nLast year’s visit came before the organization suddenly found itself in the midst of the nation’s push against illegal immigration. In June, the organization said federal agents tried to gain access to Dodger Stadium’s parking lots; the team denied the agents access and announced plans to donate $1 million to families affected by the Trump administration’s raids in the city.",
  "paragraph_count": 9
}