{
  "url": "https://www.nytimes.com/athletic/7022673/2026/02/04/eagles-ol-coach-jeff-stoutland-leaving/",
  "scraped_at": "2026-02-05T14:43:29.303742",
  "title": "Eagles OL coach Jeff Stoutland, a Philly mainstay, is leaving the organization",
  "author": "",
  "published_date": "Feb. 5, 2026Updated 10:09 am GMT+8",
  "content": "PHILADELPHIA — Jeff Stoutland is leaving the Philadelphia Eagles after 13 years as offensive line coach. Stoutland announced the news on social media.\n\n“When I arrived here in 2013, I did not know what I was signing up for,” Stoutland wrote. “I quickly learned what this city demands. But more importantly, what it gives back.\n\n“The past 13 years have been the great privilege of my coaching career. I didn’t just work here, I became one of you.”\n\nThe Eagles wanted Stoutland back, according to a league source. He made the decision to step away, although he will be welcome around the team in an unofficial capacity. With a new offensive coordinator in Sean Mannion and adjustments to the offense, it’s unknown how his role would have changed in 2025. Stoutland had also been the Eagles’ run game coordinator.\n\n“His passion for the development of young players set the bar not only for our organization but for the entire National Football League,” the Eagles said in a statement. “It is hard to fathom another coach investing more personally and professionally in their players than Jeff Stoutland.”\n\nStoutland, 63, joined the Eagles in 2013. He’s since worked under three different head coaches, a testament to his reputation as perhaps the NFL’s best offensive line coach. He has been a coach for 43 years in the NFL and college.\n\nIn 2025, Stoutland earned the Paul “Dr. Z” Zimmerman Award from the Professional Football Writers of America for lifetime achievement as an assistant coach in the NFL.\n\nStoutland had a Pro Bowler on his offensive line in all 13 seasons with the Eagles. That’s the longest streak for any team since the merger in 1970, according to the PFWA. He’s had five players earn All-Pro honors: Lane Johnson (2017, ’21-24), Jason Kelce (2017-19, ’21-23), Jordan Mailata (2024), Evan Mathis (2013) and Jason Peters (2013-14). LeSean McCoy and Saquon Barkley both led the NFL in rushing behind his offensive lines.\n\nThe Eagles made nine playoff appearances in Stoutland’s 13 seasons, winning the NFC East six times and the Super Bowl twice.\n\n“Although he will not be competing with us on game day, he will always be a beloved member of the Eagles family,” the team said in its statement. “His impact on this franchise and our community is immeasurable, and it’s safe to say he will always be welcome in the City of Brotherly Love.”",
  "paragraph_count": 10
}