{
  "url": "https://www.nytimes.com/athletic/7024030/2026/02/05/fabio-paratici-tottenham-fiorentina-sporting-director/",
  "scraped_at": "2026-02-06T00:18:39.022133",
  "title": "‘Fiorentina have a serious set of owners’: Fabio Paratici on why he left Tottenham",
  "author": "",
  "published_date": "Feb. 5, 2026 10:23 pm GMT+8",
  "content": "Fabio Paratici has revealed Fiorentina’s late owner Rocco Commisso didn’t persuade him to leave Tottenham Hotspur to become the club’s new sporting director. It was the other way around.\n\nNews of Paratici’s decision to leave Tottenham so soon after he was formally brought back into the fold by the club as Johan Lange’s co-sporting director in October came as a real surprise this winter.\n\nSpeaking at his unveiling at the Viola Park, Paratici said it’d be “banal” to reduce his decision to return to Serie A to the “weather and the pasta”.\n\n“The Premier League right now is football’s NBA,” he said. “At the same time, as an Italian, I had the desire to come back and compete in Serie A. It’s a top league, very tough.\n\n“To do this job with a club like Fiorentina was a source of real motivation. To do it with these owners, who are very serious, and infrastructure that’s super international, a brand known all over the world and people who share my ideas on the game was more than enough for me to come back and work here.\n\n“I decided to join Fiorentina on the 15th or 16th of December. Fiorentina had six points at the time. (The club’s general manager) Alessandro (Ferrari) came to London to meet me and I decided there and then to join Fiorentina.\n\n“It may have seemed like a rash decision but it was actually a brave one. Brave because when you make a rash decision you don’t know what you’re doing. When you make a brave one it’s because you’ve weighed it up and mulled over the reasons to take it.\n\n“In my case Fiorentina have a serious set of owners, a very serious set of owners who are of great value.\n\n“Rocco didn’t have to persuade me. I was the one who had to convince him to take me on.”\n\nCommisso passed away on January 17 before Paratici could formally begin his new role. In the interim, Commisso’s son Giuseppe has become president. Paratici will report to him, CEO Mark Stephan and Ferrari.\n\n“I’d like to thank Tottenham, my former club, for the opportunity they granted me to join Fiorentina, return to Italy and the opportunity to spend five wonderful years in the Premier League,” Paratici added.\n\n“It was an incredible experience. They made me feel at home and stood by me in tough times so I feel obliged to thank Tottenham.”\n\nParatici brings with him Lorenzo Giani, the scout he hired in his first spell at Tottenham, and is reunited with players Moise Kean and Nicolo Fagioli, with whom he worked at Juventus.\n\n“Fiorentina are not a second division team,” he said. “They are not a second division team even if we are in the relegation zone. I did not ask for guarantees in spending. That’s not how I operate.\n\n“All I asked was for autonomy in decision making in the sporting side of the business. I’m not going to be getting rid of anyone. I am going to assess them. Wherever I’ve been I’ve always got to work with serious people. Giani is the only person I am bringing with me. I’m not bringing 10 people.”\n\nAs for his view on Fiorentina coach Paolo Vanoli, he observed: “The coach is the Lion King of the dressing room. We’re here to help and support him, not replace him. He’s the Lion King. Luckily this is a club where you can have no excuses. We get paid on time, we have everything to do our job at the highest level. We live five star, we train five star, we eat five star. There are no excuses.”\n\nParatici also took the opportunity to rubbish reports he has a release clause in case of relegation.",
  "paragraph_count": 17
}