{
  "url": "https://www.nytimes.com/athletic/7022938/2026/02/04/floyd-mayweather-showtime-lawsuit-haymon-espinoza/",
  "scraped_at": "2026-02-05T14:42:03.261010",
  "title": "Floyd Mayweather Jr. sues Showtime, former exec for $340 million, alleging years of fraud",
  "author": "",
  "published_date": "Feb. 5, 2026 12:25 pm GMT+8",
  "content": "Former boxing champion Floyd Mayweather Jr. is suing Showtime Networks and the former president of Showtime Sports, alleging the company helped facilitate an extended fraud scheme that denied him roughly $340 million in earnings.\n\nMayweather filed the lawsuit Tuesday in California state court, seeking repayment for the alleged misappropriated funds plus millions of dollars in damages for missed investment opportunities that money could have gone toward.\n\nThe lawsuit focuses on the business practices of Al Haymon, Mayweather’s former agent and financial advisor. It alleges that Showtime and former top executive Stephen Espinoza, who brought Mayweather to the network and negotiated terms for many of his early fights, ignored red flags indicating Haymon was siphoning millions from the boxing star.\n\nHaymon is not named in the suit, which paints him as a highly secretive person who intentionally avoids leaving paper trails by dealing almost entirely via faxes and in-person meetings. It lays out a timeline of his relationship with Mayweather, who the suit said viewed Haymon as a father figure and confidant.\n\nRather than taking the 33 percent cut of fight payoffs that boxing managers typically accept, the suit said Haymon made a verbal agreement with Mayweather in 2004 to receive 10 percent of his earnings. That arrangement extended for more than 15 years despite the lack of a written agreement between the two.\n\nDuring that time, Haymon allegedly set up a series of bank accounts under his name and those of people working with him without disclosing the details to Mayweather. Haymon then began working with Espinoza to serve as a sort of financial middleman on the boxer’s behalf, the suit alleges. Instead of going to Mayweather directly, his earnings were deposited into Haymon’s network of bank accounts, which he maintained with an associate named Jeff Morris. Those accounts would then transfer the money to Mayweather after deducting Haymon’s cut.\n\n“Given the size of the transfers (hundreds of millions) and the unusual nature of paying a fighter via a third-party lawyer’s trust account, this should have raised red flags within Showtime,” the lawsuit states. “On information and belief, Stephen Espinoza and other Showtime executives were aware that Al Haymon was the de facto controller behind those accounts. …\n\n“Thus, Defendants knew that by sending funds to Jeff Morris’s account, they were knowingly participating in a structure that kept Mayweather from directly receiving or overseeing his own earnings.”\n\nThose transfers were often short tens of millions of dollars by the time they reached Mayweather, according to the suit. That’s because Haymon allegedly deducted large cuts marked as “reimbursements,” creating the image on paper that he was recouping money he previously fronted Mayweather. Mayweather’s lawsuit states that was not the case and that those moves were solely to enrich Haymon.\n\nWhen asked for information about the transactions, Haymon would allegedly hide or destroy documents, sometimes sending just signature pages instead of full copies of deals to hide contract details. The lawsuit points to his general avoidance of electronic communication as a tactic to avoid leaving evidence of his dealings.\n\n“On at least one occasion, Haymon or his agents allegedly altered a document to conceal wrongdoing,” the lawsuit states. “Mayweather’s representatives have an example of a faxed authorization form in which the date appears to have been manually altered (whited-out and rewritten) to misrepresent when it was signed.\n\n“That same document, which purported to authorize Jeff Morris to pay himself a large sum from Mayweather’s account, had a telling notation initially — ‘We need to cover our a–‘ — which was crossed out in the version sent to the bank.”\n\nShortly after Haymon suffered a stroke in 2023, Mayweather began working with a new management and financial team to review his earnings from the prior decade. The group of lawyers and forensic accountants, however, faced significant hurdles as they began reaching out to Showtime and Haymon’s associates, according to the suit.\n\nHaymon allegedly claimed many records were destroyed in a flood at a storage facility or had been lost. That constituted a breach of California laws that require fiduciaries to maintain certain records and provide them at a client’s request. Showtime repeatedly refused to provide documents as well, according to the lawsuit, claiming many were unavailable or unnecessary to turn over for various reasons.\n\n“Instead of a cooperative stance, Showtime raised the specter of the statute of limitations, suggesting that any claims related to fights as far back as 2015 might be time-barred,” the lawsuit stated. “This position is deeply ironic because the only reason Mayweather did not discover the issues sooner was the elaborate concealment — missing records, falsified statements, trust in his fiduciary, etc. …\n\n“By attempting to hide behind time limits while having contributed to the delay in discovery, Showtime essentially confirmed its complicity.”\n\nNamed as an individual defendant in the lawsuit, Espinoza is accused of helping Haymon hide and redistribute the ill-gotten millions during his tenure atop Showtime Sports from 2011 to 2023. Espinoza was responsible for signing Mayweather to a six-fight deal in 2012, which went on to include blockbuster matches with Canelo Álvarez, Manny Pacquiao and Conor McGregor that broke revenue records.\n\nThose dealings all went through Haymon, and the lawsuit alleges Espinoza was aware that the details of Mayweather’s earnings and contracts were being shielded from the boxer. Showtime laid off Espinoza in 2023 as part of a corporate restructuring, and he “has since reportedly joined Al Haymon in his boxing enterprise, illustrating a continued relationship with Mayweather’s fiduciary,” the lawsuit states.\n\nThe lawsuit specifically notes irregularities with multiyear delays on payouts from the Mayweather-Pacquiao event in 2015, the most lucrative match in boxing history. In its description of the Mayweather team’s recent investigation, the suit outlines one particular $20 million “reimbursement” by Haymon that was recorded as repayment for a separate fight Mayweather had with Andre Berto four months after the Pacquiao fight.\n\n“These inquiries implied that someone had used the huge Pacquiao revenue pool as a slush fund,” the lawsuit states.\n\nShowtime allegedly participated in fraudulent financial reporting because it included outsized deductions like that in its own accounting records, which “gave a paper justification to withhold money from Mayweather.”\n\nMayweather has requested a jury trial and is seeking $340 million in compensatory damages, along with additional damages “at least equal to the compensatory damages (or as allowed by law and the evidence) against each Defendant.” If he were to win the requested compensation, Mayweather stands to collect more than $680 million in damages from the lawsuit, as well as payment for his legal fees and the forensic accounting analysis involved.\n\nHaymon’s company, Haymon Sports LLC, now owns Premier Boxing Champions, which produces televised fights for Prime Video and other licensees. Two months after the company’s first show in 2015, PBC and Haymon were the subjects of a $300 million lawsuit by former boxer Oscar De La Hoya’s Golden Boy Promotions. The $300 million suit accused Haymon of violating antitrust laws and illegally acting as a manager and promoter, a practice banned under the Muhammad Ali Boxing Reform Act. That law is meant to protect boxers from being exploited by someone managing their business affairs while simultaneously controlling payouts and making deals with their opponents to promote a fight. Golden Boy’s lawsuit was dismissed in 2017.\n\nA 15-time world champion across five weight classes, Mayweather’s career ranks among the greatest in boxing history. He retired in 2017 after defeating McGregor by technical knockout, lifting his pro record to 50-0. Since then, he has continued to fight in exhibition bouts. He last faced John Gotti III, the grandson of famed mob boss John Gotti, in August 2024. It was the second meeting between the two after the first ended in a no-contest due to “excessive trash-talking,” which sparked a brawl in the ring between the fighters’ entourages.\n\nMayweather is reportedly contracted to fight in an exhibition against fellow legend Mike Tyson, who said in September that the fight would take place in Africa this March. Those details have not been confirmed since. Tuesday, former kickboxing champion Mike Zambidis (who, like Tyson, goes by the nickname “Iron Mike”) also teased a fight with Mayweather in Athens for June 2026. That bout also has yet to be confirmed.",
  "paragraph_count": 25
}