{
  "url": "https://www.nytimes.com/athletic/7021787/2026/02/04/lane-kiffin-lsu-transfer-portal-class/",
  "scraped_at": "2026-02-05T14:43:51.388147",
  "title": "Lane Kiffin has high expectations for top-ranked portal class: ‘They need to produce’",
  "author": "",
  "published_date": "Feb. 5, 2026 6:23 am GMT+8",
  "content": "Lane Kiffin is known for his social media antics and the havoc he often brings to college football.\n\nBut there’s no arguing with the work done by the self-proclaimed “Portal King” in reconfiguring LSU’s roster this offseason.\n\nIn his first public comments since his introductory news conference in early December, Kiffin shed some light Wednesday afternoon on his star-studded transfer class, which ranks No. 1 nationally and features stars like quarterback Sam Leavitt from Arizona State, edge Princewill Umanmielen from Ole Miss and offensive tackle Jordan Seaton from Colorado.\n\n“Where that puts us now is we have a really talented roster,” he said. “Does that mean we’re gonna win games? Not necessarily. Does that mean we’re gonna be a great team? No. We have a lot of work to do.”\n\nThe Tigers ultimately lost 34 players to the portal in the wake of Brian Kelly’s firing in November, but that wasn’t necessarily all bad for Kiffin, who was able to evaluate the roster.\n\n“In those evaluations, you usually come in and make a lot of changes,” he said. “And especially if the program made a change and fired a staff because they didn’t like the direction of the football program, which is what happened. So I know at first there was a lot of skepticism about so many players going in the portal, but I just looked at it and was like, ‘OK, what’s my answer to you as the fans and media, too, if we just kept the same players?’ We are good coaches, I think, but we also don’t have magic dust, too. So we changed a lot because there needed to be changes.”\n\nKiffin stopped short of badmouthing Kelly’s methods but made it clear that as the new head coach, he needs to make decisions he believes are in the best interest of LSU. He declined to get into the specifics of the financial resources LSU was working with to help lure this class, but praised the program for having an organized strategy.\n\n“I just felt that there was a really good plan here in place and an alignment from the top down about how the resources were here and then the plan of how they could be structured within those contracts in order to sign the players,” Kiffin said.\n\nThat said, Kiffin was adamant that it’s now the job of the staff and players to produce, which was the theme of his staff meeting on Tuesday and his team meeting on Wednesday.\n\nHe sounded confident about retaining top talent and pointed to his success in keeping top players at Ole Miss, or “the previous place” as he called his former employer, but was sure to make it known that he understands his $13 million annual salary comes with major expectations.\n\n“If you go get a staff and pay them what you do, you expect a lot,” he said. “(It’s) no different than these players that are sitting here. We pay a player a lot, and we have a lot of expectations for them. They need to produce.”\n\nLeavitt, No. 3 in The Athletic’s transfer portal QB ranking, missed all of November and December with a foot injury and will be limited in spring practice, Kiffin confirmed.\n\n“Sam will be able to throw some and participate in 7-on-7 stuff in the spring, probably not the team stuff,” Kiffin said.\n\nThe Tigers also signed two other transfer QBs — Husan Longstreet, a five-star recruit in the Class of 2025 who spent the fall at USC, as well as Landen Clark from Elon.\n\nWhen Kiffin took the job on Nov. 30, five-star high school defensive linemen Lamar Brown and Richard Anderson were initially expected to wait until this week’s signing period to make their LSU commitments official. But Kiffin made both in-state prospects immediate priorities, and the duo ultimately ended up signing in December, giving the Tigers the two best players in Louisiana.\n\n“I did think about that, like, ‘Can you imagine having to wait to sign those two guys until today?’” Kiffin said. “That would have been a long wait.\n\n“I get some credit for that when people are like, ‘Oh, Lane Kiffin signed the No. 1 player in the country.’ OK, LSU signed him. We don’t even have a D-line coach at the time solidified, and they still signed with LSU. That’s not because of Lane Kiffin. That’s not because of (former LSU assistant) Frank Wilson. That’s the power of a place that they would decide to sign … because they both knew it was LSU.”",
  "paragraph_count": 17
}