{
  "url": "https://www.nytimes.com/athletic/7023623/2026/02/05/liverpool-news-jacquet-van-dijk-future-plan/",
  "scraped_at": "2026-02-05T20:14:20.750976",
  "title": "Liverpool’s Jeremy Jacquet part of long-term plan after Virgil van Dijk, Arne Slot says",
  "author": "",
  "published_date": "Feb. 5, 2026Updated 7:43 pm GMT+8",
  "content": "Arne Slot says Liverpool’s signing of Jeremy Jacquet is a key part of the club’s long-term plan for life after captain Virgil van Dijk.\n\nThe 20-year-old French centre-back will move to Anfield in the summer after a £60million ($81.5m) deal was agreed with Ligue 1 club Rennes last weekend. The transfer was announced Monday February 2, deadline day.\n\nIt’s an area of the squad Liverpool have been keen to reinforce with Ibrahima Konate out of contract at the end of the season. Van Dijk turns 35 in July and, like fellow defender Joe Gomez, his current deal runs until 2027.\n\n“This club does everything they do for a reason,” Slot said.\n\n“It’s never from panic, it’s a long-term idea — something that has been thought about for a long time by multiple people. Of course, we are aware of the fact that Virgil won’t play for this club for another 10 years. But he has one and a half years on his contract left.\n\n“He will be with us for that period of time and maybe even longer if he keeps staying as fit as he is. What a compliment to him at his age to always play every three days, not just for his club but also for his country.\n\n“But we are not stupid. We know somewhere in the upcoming years there will be life for this club without Virgil. I could say the same for every position. This club isn’t just thinking about the short term but also the mid to long-term future with the decisions we make.”\n\nAs well as securing the services of France under-21 international Jacquet, Liverpool recently brought young centre-backs Mor Talla Ndiaye and Ifeanyi Ndukwe to the club, with the pair impressing at the Under-17 World Cup in Qatar in November.\n\nNdiaye, 18, has linked up with the under-21s squad at Kirkby after a £1m ($1.3m) switch from Senegal club Amitie, while Ndukwe, 17, will move from Austria Vienna for £2.5m ($3.4m) this summer.\n\nAsked about the signing of Jacquet, Slot said: “Very pleasing. He’s a very big talent. We weren’t the only ones interested in him so it’s a big compliment to the people working really hard to sign players.\n\n“It’s another example of the model we’re using at this club — young, very talented players sometimes at the start of their careers or sometimes already a few years into it, but always players that are young and can improve us and help us in the short term, but also definitely in the long term.”\n\nThere was speculation linking Curtis Jones with a possible loan move to Inter prior to the transfer deadline, but Slot insists there was never any chance of the club sanctioning the midfielder’s departure.\n\nJones, 25, who hasn’t started a game since the 1-1 draw with Burnley in mid-January, is inside the final 18 months of his contract.\n\nSlot said on the England international: “Curtis has played a lot of minutes, not all of them. He’s also been unlucky in the sense that it’s probably the only line where we haven’t had injuries. In that (midfield) line, we have a lot of players but we need these midfielders in different positions as well.\n\n“Of course, we kept him. His situation hasn’t changed. He’s one of the 16 outfield players we have available, with two really young players in Trey (Nyoni) and Rio (Ngumoha) included. It would have been a bit strange if we had let anyone go.\n\n“Talks (over a new contract) are not taking place here. Talks are taking place in other places in this building. I am aware, the club is aware and he’s aware that he only has one and a half years left.”\n\nLiverpool are next in action against second-placed Manchester City in the Premier League on Sunday. Jeremie Frimpong (groin) remains sidelined but Slot hopes to have Gomez back in the squad.\n\nGomez, 28, has missed the past two matches with a hip injury and could be named among the subs with Dominik Szoboszlai expected to start once again as a makeshift right-back.",
  "paragraph_count": 18
}