{
  "url": "https://www.nytimes.com/athletic/7024393/2026/02/05/rio-ngumoha-liverpool-chelsea-fee/",
  "scraped_at": "2026-02-06T04:10:21.974465",
  "title": "Liverpool to pay at least £2.8m for Rio Ngumoha after Chelsea compensation decided",
  "author": "",
  "published_date": "Feb. 6, 2026 2:56 am GMT+8",
  "content": "Liverpool must pay an initial fee worth £2.8million ($3.79m) — which could rise by a further £4m — for the signing of Rio Ngumoha from Chelsea.\n\nNgumoha moved to Anfield as a 16-year-old in September 2024 after leaving Chelsea’s academy.\n\nThat entitled the Stamford Bridge club to receive costs for the winger’s training and development, with the amount being decided by a Professional Football Compensation Committee (PFCC) tribunal.\n\nThe settlement is non-negotiable but bonuses can follow the fixed price if certain milestones are met.\n\nIt was ruled that Liverpool will owe their Premier League rivals up to £6.8m once performance-related contingencies have been included — plus 20 per cent of the profit if he is sold.\n\nThose add-ons relate to senior appearances, contracts and Ngumoha, 17, achieving potential honours representing his country.\n\nAnalysis by Liverpool correspondent Andy Jones\n\nThere has been plenty of hope and expectation surrounding Ngumoha since his arrival at Anfield and an impressive pre-season — where he scored two goals and provided two assists — saw the then 16-year-old become impossible for head coach Arne Slot to ignore.\n\nThe first sight Liverpool fans had of him was when he made his debut in the FA Cup third round against Accrington Stanley last season. The talent was obvious as he showed off his technical skills and dribbling qualities.\n\nThings got even better for the winger on his Premier League debut, when he netted a 100th-minute winner against Newcastle United in the second game of this season. With Liverpool pegged back from 2-0 up, there was huge pressure on the youngster when the ball fell to him inside the box after Dominik Szoboszlai’s dummy. His finish, though, was excellent.\n\nLiverpool’s decision to not replace Luis Diaz, partly to avoid blocking Ngumoha’s pathway, opened up the opportunity for further first-team minutes this season due to a lack of depth behind Cody Gakpo and Mohamed Salah.\n\nSo far, the England youth international has made 13 appearances in all competitions, totalling 349 minutes. Liverpool have wanted to manage his time on the pitch to help rather than hinder his development.\n\nNgumoha’s impact has varied when he has had playing time opportunities. Often, he has been turned to when Liverpool are chasing a result and Slot is keen to bring on more attacking players.\n\nLiverpool’s season has been a disappointment and it is likely Ngumoha would have been given more minutes if they had been in more commanding positions heading into the final 15 minutes of games. His most recent appearances in the final Champions League league-phase match against Qarabag was an example, as Liverpool were 5-0 up when he was brought on after 67 minutes.\n\nThe future looks very bright for the youngster and Liverpool will hope that in the years to come, this compensation fee will look like a bargain.",
  "paragraph_count": 15
}