{
  "url": "https://www.nytimes.com/athletic/7022735/2026/02/04/luka-garza-michigan-state-rim-tampering-allegations/",
  "scraped_at": "2026-02-05T14:42:24.907563",
  "title": "Luka Garza has a ‘conspiracy theory’ about Michigan State’s tougher rim",
  "author": "",
  "published_date": "Feb. 5, 2026Updated 11:33 am GMT+8",
  "content": "Boston Celtics center Luka Garza was National Player of the Year in 2021 and would finish his college career as Iowa’s all-time leading scorer. But he couldn’t light up the scoreboard whenever his team visited Michigan State. He thinks he knows why.\n\nOn the “White Noise Podcast,” co-hosted by fellow Celtics player Derrick White and White’s former college teammate Alex Welsh, Garza hypothesized why he and his teammates seemed to have particular trouble scoring at the Breslin Center at MSU. He said MSU has one tight rim — one that doesn’t offer many nice rolls — and moves it around.\n\n“I think Michigan State purposely puts the basket that they’re going to shoot on in the first half on that side on purpose,” Garza said on the podcast. “Because the rim, you have to swish it or it doesn’t go in. I think they do it to themselves so they’re down in the first half, and then they come back in the second half. Every time we go there, it’s the same story. This is my conspiracy theory.”\n\nFor the record, Garza played three games there during his Hawkeye career. His numbers:\n\nThat’s a combined 12-for-42 on field goal attempts, a 28.6 percentage. The Hawkeyes lost two of those games. Garza shot .546 in four years at Iowa.\n\n“It’s the worst rim in college basketball,” he said. “They only shoot on it in the first half. So the other team comes in the second half and can’t buy a bucket, and [the Spartans] always come back and win.”\n\nWhether Garza’s claim has any merit, the Spartans have had no issues winning this season. They are 19-3 overall and 9-2 in the Big Ten — 4-2 on the road.\n\nIn his five-year NBA career — spent with the Detroit Pistons, Minnesota Timberwolves and Celtics — Garza has a .522 field goal percentage.\n\nMichigan State did not immediately respond to a request for comment.",
  "paragraph_count": 9
}