{
  "url": "https://www.nytimes.com/athletic/7024255/2026/02/05/manchester-united-schedule-gaps-friendlies/",
  "scraped_at": "2026-02-06T00:18:25.139466",
  "title": "Manchester United to use schedule gaps in ‘different ways’ after friendly talks – Michael Carrick",
  "author": "",
  "published_date": "Feb. 5, 2026Updated 11:37 pm GMT+8",
  "content": "Michael Carrick says Manchester United are prepared to use gaps in their schedule in “different ways” amid discussions over mid-season friendlies.\n\nUnited only have 14 games remaining this season after being eliminated from both domestic cup competitions and failing to qualify for Europe.\n\nCarrick’s side have 13 days without a match between next Tuesday’s trip to West Ham United and their meeting with Everton on February 23.\n\nUnited then face a 10-day gap between the trip to Newcastle United on March 4 and Aston Villa’s visit to Old Trafford on March 15.\n\nThere is a 22-day gap between their games against Bournemouth and Leeds United on March 20 and April 11, although those fixtures are either side of the March international break.\n\nUnited have been exploring options to play mid-season friendlies since the autumn, as revealed by The Athletic in October.\n\nAnother option is a warm-weather training camp. United were also offered the opportunity to embark on a warm-weather training camp in Florida during their spare weeks in the second half of this season, although this was turned down.\n\n“At this stage, there is nothing confirmed,” Carrick said when asked about the potential for mid-season friendlies.\n\n“We’re aware of the schedule and there are some spaces we can use in different ways. It’s all up for discussion at the moment.”\n\nRuben Amorim, Carrick’s predecessor, had said that United “have to” play mid-season friendlies last October to offset the financial cost of failing to qualify for Europe.\n\n“We have to do it. We knew that when we missed Europe, and there’s a lot of things (to consider),” he said. “We have our fans, the budget. We have to compensate (for) a lot of things.\n\n“We have to do it, so we will do it. We want to be with our fans around the world, so we will put it all together to do that.\n\n“If we have to do it, we have to manage and to find the space to do it.”",
  "paragraph_count": 13
}