{
  "url": "https://www.nytimes.com/athletic/7022482/2026/02/04/man-city-guardiola-carabao-cup-marc-guehi-arsenal-inelgible-final/",
  "scraped_at": "2026-02-05T09:39:13.153249",
  "title": "Manchester City to lobby EFL to allow Marc Guehi to play in Carabao Cup final – Guardiola",
  "author": "",
  "published_date": "Feb. 5, 2026Updated 7:01 am GMT+8",
  "content": "Pep Guardiola, the Manchester City head coach, says the club intends to write to the English Football League (EFL) to request a rule change so that Marc Guehi is available for the Carabao Cup final against Arsenal on March 22.\n\nEngland centre-half Guehi was ineligible for City’s 3-1 win over Newcastle United in the semi-final decider on Wednesday night because he joined the club from Crystal Palace after the first leg of the last-four tie against Eddie Howe’s side.\n\nA rule change for this season means players have to be registered before the start of the semi-final tie in order to be eligible to take part in the remainder of the competition.\n\nAntoine Semenyo also joined City from Bournemouth in January but was signed in time for the first leg, scoring in the 2-0 victory at St James’ Park before playing a key role as Guardiola’s side set up a meeting with Arsenal with another two-goal win over Newcastle.\n\n“Hopefully we can convince the Carabao Cup that Marc can play in this competition (in) the final,” Guardiola told Sky Sports after the match. “Because it’s difficult to understand that the club makes a big investment to take one player, (he) belongs to us and I don’t understand why he cannot play in the final. Honestly.\n\n“Hopefully we make a letter and hopefully the Carabao Cup can understand. Once you buy a player for a lot of money and he’s not able to play (because of) a rule that I don’t understand why. Hopefully they can change it and he can play.”\n\nSpeaking minutes later at his post-match press conference, Guardiola joked that City were unlikely to be successful.\n\nThe Catalan added: “I said to the club they have to ask (the EFL), yeah definitely.\n\n“I don’t understand the reason why he (Guehi) cannot play in the final of the Carabao Cup. In March he will have been here for a long time. The rules to buy players does not depend on me, it depends on FIFA or UEFA or the Premier League to say the transfer window is open, if you buy a player he has to play in the competitions, it’s logic.\n\n“I don’t understand why he could not play today and in the final in two months’ time, of course we are going to ask if he can play, it’s pure logic.\n\n“Why should he not play? Why not? We pay his salary, we hire him, he’s our player, why should he not play? It’s quite similar in the Champions League, right? In the last two games (of the initial phase) he could not play.\n\n“They make the rule when the transfer window is open or closed, so when it closes if you have a player and tomorrow you have a game, he can play, no? Why shouldn’t he? So hopefully he can play in the final.”\n\nA first half double from Omar Marmoush and a Tijani Reijnders strike put City 5-0 up on aggregate on the night. Anthony Elanga pulled a goal back for Newcastle, who lost Anthony Gordon to a suspected muscle injury in the first half.\n\nArsenal beat Chelsea 1-0 at the Emirates Stadium in their semi-final decider on Tuesday to progress to Wembley Stadium with a 4-2 aggregate victory over their London rivals.",
  "paragraph_count": 14
}