{
  "url": "https://www.nytimes.com/athletic/7023047/2026/02/04/trinidad-chambliss-waiver-appeal-denied-ncaa-ole-miss/",
  "scraped_at": "2026-02-05T14:42:32.180433",
  "title": "NCAA denies Ole Miss’ appeal for a 6th year of eligibility for QB Trinidad Chambliss",
  "author": "",
  "published_date": "Feb. 5, 2026Updated 11:58 am GMT+8",
  "content": "The NCAA has denied Ole Miss’ appeal for an additional year of eligibility for Trinidad Chambliss, putting the quarterback’s future in the hands of a Mississippi court.\n\nThe NCAA confirmed the decision, first reported by ESPN, on Wednesday night.\n\nOle Miss’ original request for Chambliss to be granted a sixth year of eligibility was denied last month. The decision came the day after Miami eliminated the Rebels from the College Football Playoff semifinals. Chambliss has already spent five seasons in college (four at Division II Ferris State and one at Ole Miss).\n\nSoon after the decision, attorneys for Chambliss’ filed a lawsuit against the NCAA in Lafayette County, Mississippi, where the university is located, challenging the decision. A preliminary injunction hearing is scheduled for Feb. 12 in the Mississippi Chancery Court. If granted, that could clear the way for Chambliss to play next season while his case is pending.\n\nChambliss’ agent Fletcher Smith II told The Athletic, “Trinidad looks forward to having his day in court and telling his story,” in response to the NCAA’s decision on Wednesday.\n\nThe NCAA, when asked for comment, referred back to a statement made in January, saying, in part, “Approval requires schools to submit medical documentation provided by a treating physician at the time of a student’s incapacitating injury or illness, which was not provided.”\n\nOle Miss pushed back on that assertion in a statement Wednesday night, calling the NCAA’s decision “indefensible in light of the undisputed facts.”\n\nThe school said Chambliss should have been granted a sixth year due to his missing the entire 2022 season, “while suffering from severe, incapacitating medical conditions. Those conditions were fully and contemporaneously documented by his treating physician.”\n\nDays before the waiver request was officially denied, Chambliss agreed to a revenue-sharing deal to return to Ole Miss if he does play another season of college football. It is unknown how much Chambliss would make, but top quarterbacks in the transfer portal this cycle have been receiving deals in the $4-$5 million range.\n\nA person familiar with Chambliss’ deal told The Athletic the quarterback would be among the highest-paid in college football next year. The person spoke on condition of anonymity because no one was authorized to speak publicly about Chambliss’ agreement with Ole Miss.\n\nChambliss’ agent told The Athletic last week that his client was also mentally preparing for the possibility of entering the NFL draft.\n\nThe lawsuit says doing so would likely cost Chambliss millions of dollars.",
  "paragraph_count": 12
}