{
  "url": "https://www.nytimes.com/athletic/6927796/2026/02/04/nikola-jokic-triple-double-ties-oscar-robertson/",
  "scraped_at": "2026-02-05T14:42:38.849666",
  "title": "Nikola Jokić ties Oscar Robertson for NBA’s triple-doubles, trails only Russell Westbrook",
  "author": "",
  "published_date": "Feb. 5, 2026Updated 12:27 pm GMT+8",
  "content": "Nikola Jokić continues to cement his place among basketball’s all-time greats.\n\nThe Denver Nuggets center recorded his 181st career regular-season triple-double, tying him with Hall of Famer Oscar Robertson for second on the NBA’s all-time list, Wednesday night against the New York Knicks at Madison Square Garden, adding to his increasingly impressive résumé. Denver lost the double-overtime matchup 134-127 as Jokić finished with 30 points, 14 rebounds and 10 assists. He now needs 26 more triple-doubles to tie the all-time leader, Russell Westbrook, who has added four to his total this season as a member of the Sacramento Kings.\n\nJokić notched his 181st career triple-double in his 781st regular-season game, in his 11th NBA season.\n\nRobertson recorded his 181st career triple-double in his 1,039th regular-season game — in the next-to-last regular-season game of his remarkable 14-year career.\n\nNicknamed the “Big O,” Robertson won the 1963-64 MVP award as a member of the Cincinnati Royals and won his lone NBA championship as a member of the 1970-71 Milwaukee Bucks. Robertson remains one of the most complete point guards in NBA history. During the 1961-62 season, he became the first player in league history to average a triple-double over an entire season, with per-game averages of 30.8 points, 12.5 rebounds and 11.4 assists.\n\nFifty-five years passed before another player accomplished that feat, with Westbrook doing so during the 2016-17 season, averaging 31.6 points, 10.7 rebounds and 10.4 assists per game. Westbrook won his lone NBA MVP award that season.\n\nWestbrook averaged a triple-double in three of the next four seasons. He broke Robertson’s record for career triple-doubles on May 10, 2021, in his 940th career regular-season game.\n\nWestbrook is averaging 15.4 points, 6.0 rebounds and 6.7 assists this season, making him a threat to add to his own record and potentially making Jokić’s pursuit more difficult.\n\nJokić became the all-time leader in assists for centers on Dec. 18, passing Kareem Abdul-Jabbar.\n\nEleven days later, Jokić, a three-time NBA MVP, hyperextended his left knee during a road game against the Miami Heat and missed Denver’s next 16 games. He is on pace to join Westbrook as the only players in league history to average a full-season triple-double on multiple occasions. He leads the NBA with 17 triple-doubles this season and can become the first qualified scorer to shoot at least 60 percent and 40 percent on 3-pointers for an entire season.\n\nAlthough the Joker has now tied one legend and eyes another, he’s poised to continue etching his own tier in NBA history.",
  "paragraph_count": 11
}