{
  "url": "https://www.nytimes.com/athletic/7023798/2026/02/05/triestina-house-of-doge-police-investigation/",
  "scraped_at": "2026-02-06T02:20:11.217060",
  "title": "Police search House of Doge-owned Triestina in alleged money laundering investigation",
  "author": "",
  "published_date": "Feb. 6, 2026 2:12 am GMT+8",
  "content": "The offices of Triestina, one of Italy’s most historic clubs, were among a series of properties searched by police on Wednesday as part of an investigation into alleged money laundering offences.\n\nThe third tier club has been deducted 23 points over the last year for missed tax payments and administrative violations. They are unsurprisingly bottom of Serie C group A.\n\nIn September they were acquired from LBK Capital by the House of Doge, the corporate arm of Dogecoin, the cryptocurrency that X, Space X and Tesla owner Elon Musk has publicly supported.\n\nIn a post in 2019, Musk said it “might be my fav cryptocurrency.”\n\nA statement released by Italy’s Guardia di Finanza confirmed “searches of premises and persons at the places of residence and work of 15 individuals under investigation for corporate, tax and money laundering offences” were carried out.\n\nIt added: “Preliminary investigations have led to the hypothesis of possible money laundering involving millions of euros, which, between 2022 and 2025, flowed into the coffers of Triestina Calcio and can be traced back to Italian and foreign companies.”\n\nTriestina had three different owners in the timeframe under scrutiny; Atlas Consulting, LBK Capital and, since last autumn, the House of Doge.\n\n“The investigations are aimed at ascertaining possible false corporate communications relating to fictitious entries in the balance sheet of capital contributions in lieu of actual loans, as well as the use of invoices for non-existent transactions amounting to approximately €900,000,” the statement continued.\n\n“In accordance with the provisions of Legislative Decree No. 188 of 8 November 2021, it should be noted that, in accordance with the principle of presumption of innocence, the guilt of persons under investigation will only be definitively established if a judgment is handed down.”\n\nTriestina acknowledged the investigation in a press release on Thursday. “In relation to yesterday’s reports, US Triestina Calcio 1918 s.r.l. wishes to clarify that it is at the disposal of the judicial authorities in order to offer any cooperation and clarification necessary to ascertain the legitimacy of the current club management’s actions.”\n\nAlthough Triestina have not been in Italy’s top flight since the late 1950s they were the club with whom Cesare Maldini made his debut and Nereo Rocco invented a style that became synonymous with Italian football for decades.\n\nIt was in honour of his memory and contribution to calcio that Triestina named their home ground the Stadio Nereo Rocco.",
  "paragraph_count": 12
}