{
  "url": "https://www.nytimes.com/athletic/7023579/2026/02/05/premier-league-lgbtq-switchboard/",
  "scraped_at": "2026-02-05T20:14:13.624188",
  "title": "Premier League launches new LGBTQ+ initiative after ending Stonewall partnership",
  "author": "",
  "published_date": "Feb. 5, 2026 7:04 pm GMT+8",
  "content": "The Premier League has launched a new initiative to promote LGBTQ+ inclusion after ending its partnership with Stonewall.\n\nThe Athletic revealed plans for the campaign last month. These will ask less of individuals and not suggest players wear pride or rainbow-themed warm-up tops, laces or captain’s armbands — exploring the idea of a pride-themed football instead. This season will come too soon for the ball initiative.\n\nMatches in the top flight across February 6-12 — which includes two rounds of fixtures — will be dedicated to the Premier League With Pride initiative. The league is also collaborating with a LGBTQ+ confidential listening service, Switchboard, to promote awareness of the free support.\n\n“I am pleased that progress has been made in recent years and we will maintain our work with clubs to ensure this continues,” Premier League CEO Richard Masters said in a release on Thursday. “This includes taking action against discrimination both in stadiums and online, as well as celebrating the LGBTQ+ community.\n\n“We want everyone involved in football to feel welcome, supported and comfortable being themselves. Education is important to help people develop a stronger understanding of LGBTQ+ inclusion and the importance of showing support, challenging inequality and making the case for greater representation.”\n\nThe Premier League’s new campaign comprises, among other things, more education resources, including teaching academy players about identity and inclusion, celebration of LGBTQ+ supporters’ groups and an observer programme at matches to begin an evidence-based approach to discrimination. It will also highlight the league’s specialist team which proactively monitors social media platforms to identify and report abusive content directed at players and managers, as well as their families.\n\nThere was controversy last season over the previous campaign, particularly over the rainbow-coloured captain’s armband. Former Crystal Palace captain Marc Guehi, now at Manchester City, wrote a religious message on his armband, to which the English FA reminded the defender of its rules prohibiting religious statements on equipment.\n\nManchester United players then abandoned the club’s plans to wear a jacket in support of the LGBTQ+ community before their league fixture against Everton, after Noussair Mazraoui refused to wear it.\n\nMultiple current and former employees of Premier League clubs told The Athletic last month that while some players were happy to be part of the former campaign, others were difficult to engage or opposed it.",
  "paragraph_count": 9
}