{
  "url": "https://www.nytimes.com/athletic/6987117/2026/02/04/artemi-panarin-trade-rangers-kings-nhl/",
  "scraped_at": "2026-02-05T14:41:17.884178",
  "title": "Rangers trade Artemi Panarin to Kings for conditional third-round pick, prospect",
  "author": "",
  "published_date": "Feb. 5, 2026Updated 7:40 am GMT+8",
  "content": "NEW YORK — The New York Rangers traded star winger Artemi Panarin to the Los Angeles Kings on Wednesday for a conditional third-round draft pick and prospect Liam Greentree, the Rangers announced. Per league sources, once the trade was completed, Panarin signed a contract extension with the Kings for two years at an $11 million annual average value.\n\nThe deal came in the aftermath of a letter Rangers president and general manager Chris Drury wrote to fans explaining that the team is entering a “retool.” The day of the letter, Drury met with Panarin, a pending unrestricted free agent, and informed him that the team would not offer him a contract extension.\n\nGreentree, 20, was selected by the Kings with the 26th pick in the 2024 NHL Draft. The forward has 23 goals and 45 points over 34 games for the Windsor Spitfires of the OHL. The pick from the Kings will be the better of L.A.’s two third-rounders, but, if they win a playoff round, it will become a second-round selection. If the Kings win two rounds, they’ll add a 2028 fourth-rounder, per a team source.\n\nESPN’s Adam Schefter and Emily Kaplan were the first to report the news.\n\nNow 34, Panarin signed a seven-year, $11.64 million AAV deal with the Rangers in summer 2019. New York will retain 50 percent of his cap hit for the remainder of the season, meaning the Kings will be adding $5.82 million to their books for the rest of the season. He has 19 goals and 57 points in 52 games this season. The Rangers made him a healthy scratch for roster management purposes from Jan. 28 until the time of the trade.\n\nPanarin had full control of his situation with his no-movement clause. The Kings were his desired destination after talking to teams, a league source said, so there was not a chance for a bidding war. The Rangers got what they felt was the most they could from Los Angeles.\n\nPanarin played 482 career games with the Rangers and had 607 career points, which ranks ninth in team history. He’s the franchise leader in points per game (1.26) and twice finished in the top five of Hart Trophy voting. He had one of the greatest individual Rangers seasons during the 2023-24 Presidents’ Trophy-winning campaign, scoring 49 goals and 120 points. Only Jaromír Jágr (123 points in 2005-06) has had a higher-scoring season with the Rangers.\n\nThough his production rates dipped in the playoffs, Panarin was part of the Rangers’ runs to the Eastern Conference final in 2022 and 2024. He scored overtime-winning goals during both postseasons, including a series winner in Game 7 of the 2022 first round against the Pittsburgh Penguins. He had 35 points in 46 playoff games with New York.\n\nCoach Mike Sullivan, asked Jan. 19 about the decision not to offer Panarin an extension, said, “It boils down to, I think, big-picture decision making.”\n\n“I think this is obviously a discussion that probably predated me (joining the team in summer 2025),” the first-year Rangers coach continued. “A lot of it has to do with where the group is at and where the group can go in the short term but also in the long term.”\n\n“It’s hard to say how I feel,” Panarin said after the team told him it wouldn’t offer him an extension. “I’m still confused, but the GM decided to go in a different direction. I’m OK with that.”\n\nThe Panarin deal is Drury’s second trade since sending his letter to fans. He also moved defenseman Carson Soucy to the New York Islanders for a third-round pick.\n\nThe Rangers’ primary return is Greentree, a right wing and the captain of the Spitfires. The Athletic’s Corey Pronman has him as the No. 134 player on his league-wide rankings of top under-23-year-old prospects. Greentree was the only Kings player on the list, and Pronman projects him as a middle-of-the-lineup player.\n\nPanarin is a top-of-the-line winger capable of boosting a power play. He led the Rangers in points for all six of his full seasons with the team.\n\nPanarin’s Rangers tenure included off-ice controversy. In 2024, he and Madison Square Garden Sports, the company that owns the Rangers, “paid financial settlements to a Rangers employee after she alleged that Panarin sexually assaulted her,” The Athletic’s Katie Strang reported last year. Panarin declined to comment when asked multiple times about the settlement.\n\nPanarin also took a personal leave of absence from the team in 2021 after a Russian newspaper printed claims that he was involved in a physical altercation with a woman in 2011. The Rangers denied the allegations in a statement, saying they were an “intimidation tactic being used against him for being outspoken on recent political events.” (The month before the Russian newspaper article, Panarin posted a picture of Russia’s then-opposition leader Alexei Navalny with a caption translated to “Freedom for Navalny.”)\n\nFor King fans who prefer the club build for a bigger future than this 2025-26 season, the addition of Panarin will not satiate their wishes. However, when it comes to their current push to make the playoffs for a fifth consecutive season, this major move to add a supremely offensive talent should provide an injection for a team that’s usually defensively stout but often struggles to put the puck in the net.\n\n“The main goal is to win the Stanley Cup and if your GM thinks that adding somebody helps, it’s always positive,” Kings winger Kevin Fiala said after the team’s morning skate, before the trade occurred. “You just take it. You’ve got to accept it and do the best out of it.”\n\nThe Kings are third in the NHL in goals against per game (2.72) but have often been hampered by an offense that ranks 28th (2.57). With just a 15.6 percent success rate, their power play is also woeful — besting only Calgary, Colorado and Utah. It is apples to oranges, of course, in terms of who Panarin has played with in New York and who his teammates will be in L.A., but the winger’s 57 points would make him the Kings’ leading scorer by a large margin (Adrian Kempe was the previous team leader with 45). It will be on Kings coach Jim Hiller, whose future could be on the line, to find the best fits for Panarin at five-on-five and on the power play.\n\nIt could be a boost for someone like Kempe, who signed an eight-year, $85 million contract extension in November, or Quinton Byfield, who has slumped to just 11 goals and 19 assists in 53 games after consecutive seasons topping 20 goals and 50 points. And it clearly shows what direction the Kings and first-year general manager Ken Holland are going in now and in the immediate future.\n\nOn top of that, captain Anze Kopitar is retiring after this season and 36-year-old franchise stalwart Drew Doughty has this season and next remaining on his contract.\n\nWill this move help the Kings finally break their first-round hex after series losses in four consecutive springs to the Edmonton Oilers? First, they must qualify. It’s a dogfight not only in the Pacific Division, but also for the two wild-card spots in the West. There is no guarantee that L.A. grabs a playoff berth, much less wins a round, but the organization is betting on Panarin giving the Kings a shot in the arm. As for the cost of Greentree, well, it’s obvious that the thought of a retool or even a rebuild is being kicked down the road.\n\nFiala, who has three more years left on his contract after this season, said he and other players couldn’t get caught up in whatever decisions the Kings’ front office makes. Furthermore, focusing on off-ice issues would distract them from performing well on it.\n\n“We don’t want to imagine what would happen if we would get this and this and this,” he said.\n\nStill, the winger with 18 goals and 38 points added, “There’s a lot of good players out there. Let’s see.” Now he and the Kings will see what comes of their latest big purchase. — Eric Stephens, Kings staff writer",
  "paragraph_count": 25
}