{
  "url": "https://www.nytimes.com/athletic/7024654/2026/02/05/real-madrid-news-rodrygo-suspension-champions-league-benfica/",
  "scraped_at": "2026-02-06T02:20:32.065293",
  "title": "Real Madrid’s Rodrygo to miss Champions League play-off games due to two-match ban",
  "author": "",
  "published_date": "Feb. 6, 2026 1:18 am GMT+8",
  "content": "Real Madrid forward Rodrygo will miss his side’s Champions League play-off games against Benfica after being handed a two-match ban for abusive language.\n\nThe 25-year-old was shown two yellow cards in the space of a minute during stoppage time of the Spanish side’s dramatic 4-2 defeat to Benfica on the final day of the league phase on January 28.\n\nThe Brazil international was dismissed after showing dissent to Italian referee Davide Massa. UEFA have now confirmed that he has been handed a two-match ban that rules him out of both legs of the play-off round against the Portuguese side on February 17 and 25.\n\nIt was the first red card Rodrygo had been shown in his Madrid career. Benfica went on to qualify for the play-offs after a dramatic 98th-minute goal from goalkeeper Anatoily Trubin.\n\nRodrygo apologised to Madrid fans on social media on January 29, saying: “Yesterday, I got carried away in the heat of the moment when complaining about time wasting. That’s not how I usually behave.\n\n“I had never been sent off playing for Real Madrid and I am aware of the consequences. I apologise to the fans, the club, my teammates and the coach. We will continue to stand together and fight for this badge and for this Champions League.”\n\nRodrygo has scored three goals and provided six assists in 26 games this season, scoring one in five Champions League games this campaign.\n\nMadrid may also be without Jude Bellingham for the games against Jose Mourinho’s Benfica.\n\nThe Athletic reported on February 1 that the Spanish club fear that the 22-year-old England international could be out for around a month after the midfielder was forced off with a hamstring injury early in Sunday’s La Liga game at home to Rayo Vallecano at the Bernabeu.",
  "paragraph_count": 9
}