{
  "url": "https://www.nytimes.com/athletic/7021663/2026/02/04/keys-gray-bein-sports-leave/",
  "scraped_at": "2026-02-05T09:39:28.151434",
  "title": "Richard Keys and Andy Gray set to leave beIN Sports after current season",
  "author": "",
  "published_date": "Feb. 5, 2026Updated 3:48 am GMT+8",
  "content": "Richard Keys and Andy Gray are expected to leave the Qatar-based network beIN Sports at the end of the current Premier League season.\n\nSources familiar with the situation, who asked to remain anonymous as they were not authorised to speak on the matter, said the pair’s current deal is up at the end of the campaign and, while there has been no falling-out between the parties, there is not expected to be an extension.\n\nKeys and Gray are also not currently slated to present beIN’s coverage of this summer’s FIFA World Cup, unlike in 2022 when Qatar hosted the tournament, but sources cautioned that no final decision has been made or communicated.\n\nKeys, a 68-year-old English broadcaster, and Gray, a 70-year-old former Scotland international forward, were previously the faces of Sky Sports’ football coverage for much of the first two decades of the Premier League, which was founded in 1992.\n\nTheir careers in British television were suddenly curtailed in 2011, when Gray was sacked after making sexist remarks about assistant referee Sian Massey, while Keys resigned after clips of his part in the scandal became public. Barney Francis, then managing director of Sky, described the comments as “inexcusable”.\n\nMassey has subsequently said that Keys called her to apologise, although he has alleged he was set-up and previously claimed that “dark forces” were at work against him.\n\nThey found a fresh lease of life, however, in the Middle East, where they have been presenting the English language coverage of live Premier League action for Qatar’s beIN Sports since 2013. The rights currently encompass Turkey, the Middle East and North African region and the pair have been joined over the years by former Premier League coaches and players, including Arsene Wenger, David Moyes, Nigel de Jong and Jason McAteer.\n\nThe motivation for a change is multi-faceted, with both Keys and Gray having entered or being close to their seventies, while the nature of match analysis is fast-changing and the appetite for conventional pre-match and post-match television shows is diminishing amid the rise of social media, podcasts, YouTubers and fan channels.\n\nbeIN Sports have been approached for comment but did not respond by the point of publication.",
  "paragraph_count": 9
}