{
  "url": "https://www.nytimes.com/athletic/7023179/2026/02/05/seahawks-nick-emmanwori-injures-ankle/",
  "scraped_at": "2026-02-05T14:41:40.675041",
  "title": "Seahawks safety Nick Emmanwori injures ankle during Super Bowl practice",
  "author": "",
  "published_date": "Feb. 5, 2026Updated 2:05 pm GMT+8",
  "content": "Seattle Seahawks rookie safety Nick Emmanwori, a key component of one of the NFL’s best defenses, injured an ankle during practice Wednesday, four days before their Super Bowl 60 showdown against the New England Patriots.\n\nEmmanwori suffered the injury while defending a pass late in practice, according to the Seahawks pool report. It was not specified which ankle was injured. He walked off the field on his own and was officially listed as limited.\n\nWednesday was the team’s only practice with pads before Sunday. It was held at the practice field at San Jose State University, about 8 miles from Levi’s Stadium, the site of the Super Bowl.\n\n“He had an ankle (injury) today,” Seattle coach Mike Macdonald said. “We brought him in to look at it, and we’ll kind of go from here and figure out, ‘What are the next steps?’”\n\nEmmanwori, the 35th pick of the 2025 NFL Draft, suffered a high ankle sprain on his right ankle just four snaps into the regular-season opener in September. He missed three games, then returned and became a mainstay at nickelback over the remainder of the season. The Seahawks played five or more defensive backs on a league-high 92.6 percent of plays.\n\nThe 21-year-old totaled 81 tackles (nine for loss), 2.5 sacks, four quarterback hits and 11 passes defensed, becoming a finalist for Defensive Rookie of the Year. The winner of the award will be revealed Thursday night at the NFL Honors show.\n\nIn the NFC Championship Game victory over the Los Angeles Rams, Emmanwori allowed two receptions for 8 yards on five targets, according to Next Gen Stats.\n\nAlso limited in Wednesday’s practice were quarterback Sam Darnold (oblique), left tackle Charles Cross (foot), swing tackle Josh Jones (ankle, knee) and fullback Robbie Ouzts (neck). All had the same injuries listed before facing the Rams, and all but Ouzts played.\n\nDarnold has been limited in practice since tweaking his oblique in practice ahead of the divisional-round game against the San Francisco 49ers, but he has not shown any signs of its bothering him in two playoff games, throwing for 470 yards with four touchdowns and no turnovers.",
  "paragraph_count": 9
}