{
  "url": "https://www.nytimes.com/athletic/7024125/2026/02/05/serge-gnabry-bayern-munich-contract-extension/",
  "scraped_at": "2026-02-06T00:18:32.032632",
  "title": "Serge Gnabry signs Bayern Munich contract extension through to 2028",
  "author": "",
  "published_date": "Feb. 5, 2026Updated 11:12 pm GMT+8",
  "content": "Bayern Munich forward Serge Gnabry has signed a contract extension through to 2028.\n\nThe 30-year-old’s deal had been due to expire this summer but his new terms are set to take him beyond a decade at the Bundesliga club.\n\nGnabry has registered seven goals and eight assists across 26 appearances in all competitions this season, helping Bayern to a six point lead over Borussia Dortmund at the top of the Bundesliga.\n\n“I’m excited to get to play for Bayern for more years. Talks were always positive,” Gnabry said in a press release. “When I started at Bayern, I never would’ve thought that I’d be here for 10 years by the end of this contract.\n\n“My goals are to keep things going. We’re a real unit and can achieve something big. The reasons to renew my contract are the team, the coaches, the whole club, the fans, the city and the environment. I feel very much at home at Bayern.”\n\nGnabry has played 311 times for the German champions since joining from Werder Bremen in the summer of 2017, winning six Bundesliga titles and the Champions League in 2020.\n\n“Everyone can see how much Serge Gnabry enriches our game,” sporting director Christoph Freund said on Thursday. “He’s versatile in attack, quick, skilled on the ball and in finishing.\n\n“We’re delighted he’ll continue to play for Bayern, as he also has an important role in our team with his demeanour and character.”\n\nGnabry made his professional debut for Arsenal, appearing 18 times over the 2012-13 and 2013-14 seasons before moving to Werder Bremen.\n\nHe spent his first season at Bayern on loan at Hoffenheim, before establishing himself in the first team the following campaign.\n\nGnabry has made 57 senior international appearances for Germany, scoring 31 goals, since his debut in 2016.\n\nBayern are next in action against Hoffenheim on Sunday before facing RB Leipzig in the DFB-Pokal quarter-final on Wednesday.",
  "paragraph_count": 12
}