{
  "url": "https://www.nytimes.com/athletic/7021739/2026/02/04/brian-angelichio-pittsburgh-steelers-oc/",
  "scraped_at": "2026-02-05T14:43:58.617345",
  "title": "Steelers hire former Vikings assistant Brian Angelichio as offensive coordinator",
  "author": "",
  "published_date": "Feb. 5, 2026Updated 6:19 am GMT+8",
  "content": "The Steelers’ new coaching staff continued to take shape Wednesday. Former Vikings tight ends coach/passing game coordinator Brian Angelichio has been named offensive coordinator, and former Commanders defensive coordinator Joe Whitt Jr. has been named assistant head coach/secondary coach, the team announced.\n\nAdditionally, Frank Cignetti Jr. will hold the title of Senior Offensive Assistant, a league source told The Athletic.\n\nAngelichio, 53, has strong connections to Pittsburgh and to head coach Mike McCarthy. He spent four seasons as a tight ends coach at the University of Pittsburgh (2006-2010) and three years alongside McCarthy in Green Bay, where he coached tight ends from 2016-2018. Most recently, Angelichio served as the Minnesota Vikings’ passing game coordinator and tight ends coach under Kevin O’Connell for four seasons. He also worked with tight ends at the NFL level with the Buccaneers (2012-2013), Browns (2014-2015), Washington (2019) and Panthers (2020-2021).\n\nWhile McCarthy made it clear in his opening news conference that he will call plays, Angelichio is still a key addition to the staff. Typically on teams with a play-calling head coach, the offensive coordinator remains heavily involved in game planning and occasionally will have the opportunity to suggest plays.\n\nWhitt, a former Auburn wide receiver, spent time with McCarthy at two different stops. In Green Bay, he held the titles of defensive quality control (2008), cornerbacks coach (2009-2017) and passing game coordinator (2018). After stints with the Browns (2019) and Falcons (2020), Whitt joined McCarthy in Dallas as the passing game coordinator/secondary coach from 2021-2023.\n\nWhitt spent the last two seasons with the Commanders as defensive coordinator. In early November, head coach Dan Quinn took play-calling responsibilities from Whitt, and eventually fired him after the season.\n\nCignetti’s relationship with McCarthy dates back to 1989, when they were both graduate assistants at the University of Pittsburgh. Over the last three-and-a-half decades, Cignetti has worked for more than a dozen college and NFL programs, often as a quarterbacks coach and/or offensive coordinator. He overlapped with McCarthy again in 2018 as the Packers’ quarterbacks coach. Cignetti returned to the Panthers (for the third time) to serve as offensive coordinator and quarterbacks coach in 2022 and 2023. Most recently, Cignetti spent the 2025 season as the Indiana University of Pennsylvania (IUP) offensive coordinator, a school where his late father (Frank Sr.) and brother (Curt) have deep roots.\n\nThe Steelers staff is now nearly complete. Here is a list of the known hires:\n\nOffensive coordinator: Brian Angelichio\nSenior offensive assistant: Frank Cignetti Jr.\nQuarterbacks coach: Tom Arth\nRunning backs coach: Ramon Chinyoung Sr.\nWide receivers coach: Adam Henry\nOffensive line coach: James Campen\nAssistant offensive line coach: Jahri Evans\n\nDefensive coordinator: Patrick Graham\nAssistant head coach/ secondary coach: Joe Whitt Jr.\nDefensive pass game coordinator/ DBs coach: Jason Simmons\nInside linebackers coach: Scott McCurley\nOutside linebackers coach: Shawn Howe\nDefensive line coach: Domata Peko\nDefensive quality control: Pat Reilly\n\nSpecial teams coordinator: Danny Crossman\nChief of staff: Steve Scarnecchia",
  "paragraph_count": 11
}