{
  "url": "https://www.nytimes.com/athletic/7022987/2026/02/05/tate-mcrae-olympics-backlash-promoting-team-usa/",
  "scraped_at": "2026-02-05T14:41:33.385965",
  "title": "Tate McRae responds to backlash over Team USA ad: ‘I’m Canada down’",
  "author": "",
  "published_date": "Feb. 5, 2026 1:44 pm GMT+8",
  "content": "Tate McRae insists the maple leaf doesn’t fall too far from the tree.\n\nA day after NBC aired an ad in which McRae — born and raised in Calgary, Alberta — promoted Team USA and not Canada, the global singing star tried to set the record straight.\n\nPosting a photo of herself as a child on Instagram holding a mini Canadian flag, McRae wrote, “y’all know I’m Canada down.”\n\nThe post came in response to backlash over the NBC promo, in which the Grammy-nominated singer tells a snowy owl, “I’m a bit lost. I’m trying to get to Milan for an amazing opening ceremony and meet Team USA. Then it’s the weekend with America’s best skating for gold, and Lindsey Vonn’s epic comeback, then back to the States for the big game, Super Bowl 60.”\n\nIn the background of the ad is the music from her latest hit single, “Nobody’s Girl.”\n\nMcRae’s journey to stardom began with her appearance on the reality TV show, “So You Think You Can Dance” in 2016, and she later released the hits “Too Young To Be Sad” and “You Broke Me First.” She has had a string of top-selling albums and singles, and was nominated for a Grammy Award for the song “Just Keep Watching” in the Best Dance Pop Recording category.\n\nShe moved from Canada to Los Angeles in 2021, according to a Time profile, and has spent plenty of time in the States. She said on a soundcheck during her “Miss Possesssive” world tour last summer that “Canada doesn’t feel like home anymore, which is weird. Not like the country but just like Calgary, where I’m from, feels like a little less homey than L.A.”\n\nMcRae isn’t the first non-American to promote U.S. stars for NBC. In November, the network aired another ad in which UK singing star Dua Lipa also promotes Team USA’s female athletes.",
  "paragraph_count": 8
}