{
  "url": "https://www.nytimes.com/athletic/7021446/2026/02/04/skeleton-helmet-team-gb-cas-olympics/",
  "scraped_at": "2026-02-05T09:39:35.534789",
  "title": "Team GB goes to CAS over skeleton helmet ban at Winter Olympics",
  "author": "",
  "published_date": "Feb. 5, 2026 12:54 am GMT+8",
  "content": "The British Bobsleigh & Skeleton Association (BBSA) has asked the Court of Arbitration for Sport (CAS) to overturn the International Bobsleigh and Skeleton Federation’s (IBSF) decision to ban the new helmets Team GB’s skeleton athletes hope to wear at Milan Cortina 2026.\n\nLast week, the IBSF rejected an application from the British team to use these helmets at the Winter Olympics, saying their aerodynamic shape does not comply with the rules.\n\nThe BBSA believes the helmets are compliant with the rules and says it has been working on this design in order to comply with next season’s greater safety standards. It also claims these helmets provide better protection than anything currently being used in the sport.\n\nThe British filed their appeal on Monday with CAS’s ad hoc division, the appeals tribunal that has been set up in Milan to provide expedited decisions this month. The hearing will take place on Friday and a decision should come quickly.\n\nThe five-strong team wore the helmets for the first time last week in a training session in St. Moritz, and while they would clearly like to use them once the racing starts at the Cortina Sliding Centre on February 12, they have not been doing too badly in this season’s equipment.\n\nDouble world champion and world number one Matt Weston has won five of the seven IBSF World Cup races this season, with teammate and world number three Marcus Wyatt winning the other two. In all seven of those races, they wore IBSF-approved helmets.\n\nThe women’s team is led by Tabitha Stoecker, the world number three and two-time world silver medalist in the mixed team event with Weston.\n\nNo nation has won more Olympic medals in the high-speed event than Great Britain and Northern Ireland and there are high hopes that the sport will make a big contribution to Team GB’s overall target of four to eight medals in Italy this month. Team GB’s best-ever medal return from a Winter Games is five, which was achieved in 2014 and 2018.\n\nUK Sport, the government agency that invests National Lottery and exchequer money in Olympic and Paralympic sport, has provided £5.8million ($7.9m) in funding for the skeleton team’s preparations for Milan Cortina.\n\nThe BBSA and IBSF have been approached for comment.",
  "paragraph_count": 10
}