{
  "url": "https://www.nytimes.com/athletic/7020985/2026/02/05/the-alternative-premier-league-table-no-25-goals-from-summer-signings/",
  "scraped_at": "2026-02-05T18:17:31.440047",
  "title": "The Alternative Premier League Table: No 25 – Goals from summer signings",
  "author": "",
  "published_date": "Feb. 5, 2026 1:08 pm GMT+8",
  "content": "Welcome to another edition of The Alternative Premier League Table, where each week, The Athletic analyses the entire division through a specific lens.\n\nThis time we are looking at how each team’s summer signings have performed in front of goal. There will be callbacks to Week 10, when we tackled the same topic. With the winter window having slammed shut earlier this week, it’s too early to assess just how well the Premier League’s 33 January recruits will do just yet, but we do have a sizeable sample for the players signed in the summer.\n\nSo, this week’s Alternative Table will focus on goals from summer 2025 arrivals and what percentage those make up of a team’s total, while highlighting standout individual performers.\n\nAs with the Week 10 table, the numbers include external signings and academy players promoted to the first-team squad this season.\n\nKey takeaways include:\n\nAs usual, the article that follows is long and detailed, so please settle down and enjoy it all — or use the index lower down the page to jump to a specific club.\n\nAfter the first nine weeks, Dominic Calvert-Lewin had scored just one of Leeds’ six goals from new signings, with Noah Okafor the only player to score two.\n\nBut the last 15 games have seen the former Everton man strike eight times, helping his side move six points clear of the relegation zone. Calvert-Lewin has received a helping hand from fellow summer signing Lukas Nmecha, who has scored five times, while Anton Stach has three.\n\nJames Justin, Sean Longstaff and Jaka Bijol have added a goal each, too, though Okafor is yet to add to his account. January arrival Facundo Buonanotte, signed on loan from Brighton & Hove Albion, could add some threat. If Leeds stay up, their decisions last summer will have played a major part.\n\nManchester United’s summer activity focused solely on changing up their frontline, and so far, it has worked.\n\nUnited have put up their third-best goal tally of the last eight seasons after 24 league games, with 44 (only behind 50 in 2020-21 and 48 in 2018-19). That is a significant improvement on 2024-25, when they had scored just 28 goals.\n\nBryan Mbeumo, Matheus Cunha and Benjamin Sesko have almost directly contributed to that rise on paper, scoring 19 league goals between them. Mbeumo and Cunha have combined for 14 from 12.2xG (1.8 overperformance), building on last season, when they ranked first (7.7) and third (6.4) respectively for xG overperformance.\n\nVilla are on the other end of the spectrum, relying almost exclusively on their old heads to get them goals and up to third in the table.\n\nHarvey Elliott has featured for all of 110 minutes, 13 of which came in the 1-0 defeat by Brentford after not playing 17 previous league matches. Jadon Sancho has not had it much better, with 441 minutes across 13 matches. He has attempted seven shots (three on target), but for a combined 0.4 expected goals.\n\nEvann Guessand featured for less than 600 minutes before departing for Crystal Palace on loan for the second half of the season. He scored twice in the Europa League, though, with Sancho adding one, too.\n\nVictor Lindelof has done well at centre-back, but higher up the pitch, Villa’s summer recruitment has been disappointing. Tammy Abraham and Alysson arriving in January, along with the return of Leon Bailey from his loan at Roma, suggests they have acknowledged that.\n\nAmong new signings, no player has underperformed their xG more than Liam Delap, with one goal (albeit an instinctive volley from the second phase of a corner against Fulham) from 3.3 xG. He hit the crossbar from point-blank range against West Ham United in the lead-up to Marc Cucurella’s equaliser, while missing two excellent one-on-one chances against Fulham and Bournemouth, as seen below.\n\nEstevao has been an exciting watch and has scored some outstanding goals, but has also had a few misses, scoring twice from 2.8 xG, while Alejandro Garnacho has blown occasionally hot and frequently cold.\n\nJoao Pedro, however, has compensated for them all. His nine goals have come from 7.6 xG and he has looked sharp in the early weeks under Liam Rosenior after doubts over his ability to play as a No 9 under Enzo Maresca. He also has four assists, in addition to three goals in the Champions League.\n\nSunderland are the only team other than Leeds to have new players score more than 50 per cent of their goals (14 of 27). Regis Le Bris’ side have relied more on a solid defensive core and versatile midfield, but they have an explosive attack that can wreak havoc in transition, largely due to their summer recruitment.\n\nTop-scorer Brian Brobbey, signed from Ajax, has a penchant for excellent goals, with his five goals coming from just 2.6xG and nine shots on target (18 shots total). Chemsdine Talbi has had to wait for his chances but has scored three times, while the experienced Bertrand Traore has scored once.\n\nIn midfield, Granit Xhaka has proved one of the signings of the summer with a goal and five assists. Habib Diarra got his first Sunderland goal in the 3-0 win over Burnley.\n\nA little further behind, Nordi Mukiele and Omar Alderete have each scored once, with Sunderland generating 30 per cent of their shots from set pieces, the second-best mark in the league. Mukiele, who can rival Xhaka for positive impact on this team, has delivered three assists, too.\n\nContinuing from Week 10, Eli Junior Kroupi has been Bournemouth’s standout new goalscorer, with eight strikes from just 3.7 xG, with his overperformance of 4.3 the highest in the league. There will be added burden on his shoulders following Antoine Semenyo’s departure to Manchester City, but help is arriving at the right time.\n\nAmine Adli, starting on the left in place of Semenyo, has scored once and assisted once in his last two games, adding to his goal against Sunderland in November. Alex Jimenez opened his Bournemouth account against Liverpool, while January signing Rayan assisted Alex Scott just 22 minutes after coming on for his debut, against Wolves.\n\nLeft-back Adrien Truffert has chipped in with an assist, while 20-year-old Alex Toth, signed from Ferencvaros in January, is an exciting addition to the midfield ranks.\n\nNick Woltemade’s hot start to life in the Premier League saw him rank first in our Week 10 table for the highest share of a team’s goals, netting four of Newcastle's nine. He has added three more since then, while also recording a couple of assists.\n\nYoane Wissa, who did not play until December after joining in the summer with a knee injury, scored in the 3-1 win over Burnley. Wissa also grabbed a goal and an assist in the 3-0 Champions League win over PSV.\n\nMalick Thiaw has proven a significant threat from set pieces, with his three goals by a defender only exceeded by Cristian Romero and Micky van de Ven, with four each.\n\nThere will be concerns around Anthony Elanga and Jacob Ramsey, however, with the duo attempting 14 shots in over 1,500 combined minutes for just 1.6xG and no goals.\n\nAny questions over Rayan Cherki’s ability to adapt to the Premier League have disappeared. Despite the league growing more physical and direct, there is still space for creative No 10s, and Cherki has flourished with some defensive help from Bernardo Silva to record seven assists and three goals.\n\nTijjani Reijnders has struggled to completely fill Pep Guardiola’s defensive and in-possession demands, but his late runs into the final third have been useful in stretching defences and brought him five goals and two assists.\n\nRayan Ait-Nouri has spent most of the season on the treatment table and has played just 285 minutes. He grabbed an assist for January arrival Semenyo in the 2-0 Carabao Cup semi-final win over Newcastle at St James’ Park, but his defensive lapses and inconsistent attacking play have been the larger story.\n\nJack Grealish’s absence will hit Everton hard after he scored or assisted five of their first nine league goals. Grealish, acquired on loan from Manchester City, looks set to miss the rest of the season with a foot injury after scoring two and assisting six goals in 20 matches.\n\nThierno Barry has helped replace those goals, however. Having scored just once in his first 18 league games, he has four in his last six.\n\nKiernan Dewsbury-Hall’s return from injury will help, too. After scoring and assisting once apiece in his first nine games, he went on a run of three goals and two assists in six matches before a hamstring issue sidelined him for six league games.\n\nTyler Dibling has featured for just 349 league minutes, and Adam Aznou is yet to make an appearance. Merlin Rohl, who is also yet to score, started against Forest on December 30 and Aston Villa on January 18, but was an unused substitute in Everton’s last two matches.\n\nHugo Ekitike has been Liverpool’s best signing from a summer of change, notching up his ninth and 10th league goals in the 4-1 win over Newcastle last weekend. His consistency in a team that has otherwise struggled for that is commendable.\n\nAfter a slow start where he showed glimpses of quality but no goal contributions, Florian Wirtz is settling into life in England. A goal and assist against Newcastle means he has four and two respectively in his last eight league matches, to go with a goal and three assists in the Champions League.\n\nMilos Kerkez has scored once, but the bigger story has been his improved defensive displays in recent weeks. Alexander Isak is still out after fracturing his foot in the process of scoring his second league goal in the 2-1 win over Tottenham Hotspur in December.\n\nBurnley’s summer splurge to retool their squad has not led to the sort of positive results Leeds or Sunderland have enjoyed.\n\nZian Flemming’s hot streak between October 26 and December 6 brought five goals in six matches, but he has not scored in 10 games either side of it, also missing five games with injury. Lesley Ugochukwu scored in back-to-back matches against Aston Villa and Leeds in October but has scored once in 16 outings since.\n\nLoum Tchaouna, Armando Broja and Axel Tuanzebe have scored a goal apiece, with the latter putting through his own net in the 3-0 defeat by Sunderland.\n\nAmong their other signings, Quilindschy Hartman has provided a respectable four assists, while Kyle Walker and Florentino Luis have two each, and Hannibal Mejbri has one. But none of them, nor Jacob Bruun Larsen, have scored.\n\nForty per cent of Wolves’ goals have come from new signings, and while that sounds good, the raw number — six of 15 goals in 24 matches — makes for painful reading.\n\nLadislav Krejci, who has played in midfield and defence, has two league goals and an assist. Youngster Mateus Mane, who was promoted to the first team only in November, has scored twice and assisted once, too.\n\nJhon Arias has struggled to fill Matheus Cunha’s boots with a solitary goal. Tolu Arokodare, with one goal in 844 minutes, will now need to help replace Jorgen Strand Larsen, who himself scored just once in over 1,400 minutes after netting 14 times in 35 matches in 2024-25.\n\nDavid Moller Wolfe has contributed two assists but started just eight times. Fer Lopez, who arrived from Celta Vigo in the summer, played just 229 minutes before being loaned back to the La Liga side in January until the end of the season.\n\nWolves signed Adam Armstrong, who scored 11 times in 29 Championship matches for Southampton in the first half of 2025-26, in January. But Armstrong’s Premier League record — six goals in 88 matches — leaves a lot to be desired.\n\nThe other arrival, midfielder Angel Gomes on loan, scored three goals in 14 Ligue 1 games for Marseille this season.\n\nNoni Madueke became the fourth of Arsenal’s seven new signings to score in the league after his corner against Leeds — originally deemed a Karl Darlow own goal — was awarded to him. He is unfortunate to have just one assist, having created 1.9 expected assists in his 642 minutes.\n\nViktor Gyokeres also scored against Leeds to take his league tally up to six. It has been hard work for the Sweden international, though, with his 34 per cent shot accuracy ranking 29th among 41 players with five or more goals. His eight open-play shots on target are the joint fourth fewest among that group of 41, too.\n\nMartin Zubimendi and Eberechi Eze have scored four times each from a combined 4.8xG. Eze’s hat-trick against Spurs was one of the best performances by a new signing this season, although he has struggled to replicate it.\n\nDefenders Piero Hincapie and Cristhian Mosquera are yet to attempt a shot, while Christian Norgaard has played just 31 league minutes.\n\nMateus Fernandes and Callum Wilson had scored a goal apiece after West Ham’s first nine games, while El Hadji Malick Diouf had provided three assists.\n\nFernandes has remained a staple in the starting XI, adding two more goals and multiple solid performances in midfield. Diouf missed six games while away on Africa Cup of Nations duty with Senegal and has not added to his assist tally since Matchday 5, but remains West Ham’s leading provider.\n\nWilson briefly fell out of favour under Nuno Espirito Santo and could have left the club in January. But his four goals since November — against Burnley, Bournemouth (two) and Spurs — have directly helped West Ham to two wins and a draw.\n\nKyle Walker-Peters (also against Burnley) and Soungoutou Magassa (against Manchester United) have scored a goal each, too.\n\nForest spent big on their attack, signing Dan Ndoye, Igor Jesus, Omari Hutchinson, James McAtee, and Arnaud Kalimuendo. Ndoye was the only one to have scored after nine league games, with Kalimuendo, Hutchinson, McAtee and Jesus playing just 481 combined minutes in that stretch.\n\nIn the last 15 matches, Hutchinson has become a regular and scored once. Jesus has scored twice, while adding six goals in the Europa League.\n\nRight-back Nicolo Savona scored in both the 3-0 win over Liverpool and 2-2 draw with Manchester United. Dilane Bakwa assisted the team’s top scorer, Morgan Gibbs-White (six goals), in the 3-1 defeat by Aston Villa.\n\nBut Ndoye has not found the net while playing just 458 minutes across nine appearances, and McAtee has received only 43 minutes in this stretch. Both have found the net once in the Europa League, though.\n\nKalimuendo’s league minutes remained at a premium, but he scored twice in the Europa League before being loaned out to Eintracht Frankfurt in January. Lorenzo Lucca has arrived on loan from Napoli and will hope for a bigger impact.\n\nOf their other summer signings, loan arrival Oleksandr Zinchenko returned to parent club Arsenal last month and was sold to Ajax. Goalkeeper John Victor had a lapse as he conceded the third goal against Villa and injured himself in the process, later being ruled out for the season.\n\nBrighton’s summer recruitment focused more on shoring up their defence, with moves for Maxim De Cuyper, Olivier Boscagli and Diego Coppola. The forwards they signed — Tom Watson and Greek strike duo Charalampos Kostoulas and Stefanos Tzimas — were all aged 20 or younger with limited first-team experience.\n\nNot going for a peak-age successor to 35-year-old Danny Welbeck (who has scored eight league goals to his credit) has hurt them. Brighton’s total of 34 goals is the lowest they have managed after 24 games in the last four seasons.\n\nTzimas began brightly with two goals in three Carabao Cup games and got his maiden Premier League goal in the 2-0 win over Forest in November. But an ACL injury suffered in December has ended his season.\n\nKostoulas has scored twice, including the spectacular bicycle kick below to rescue a point against Bournemouth, but is still raw and has started just once in the league. Watson was loaned to Championship side Millwall after making six substitute appearances in the Premier League.\n\nDe Cuyper also scored in the win over Forest, but has seen his minutes fluctuate since December. Coppola left on loan in January after receiving just 194 league minutes, while Boscagli has fared only slightly better with 231.\n\nBrighton re-signed Pascal Gross from Borussia Dortmund in January and he scored in the 1-1 draw with Everton. Matt O’Riley, who scored two goals in 21 league games last season, has been recalled from his loan at Marseille.\n\nFulham made only three signings in the summer and despite all three — Samuel Chukwueze, Kevin and Jonah Kusi-Asare — being forwards, none had scored after their first nine matches.\n\nChukwueze broke free in the wild 5-4 defeat by Manchester City in December, scoring twice to add to his three assists before that. The Nigeria international then assisted the free-scoring Harry Wilson against Burnley, before adding a third goal for himself in the 2-1 win over Brighton on his return from the Africa Cup of Nations.\n\nKevin finally broke his duck against Manchester United, scoring with a curler into the top corner to draw Fulham level in the dying moments before Benjamin Sesko’s dramatic winner.\n\nKusi-Asare, 18, has received just 30 minutes of action across five games.\n\nFulham made their fourth offensive signing of the season in January, bringing in Oscar Bobb from Manchester City.\n\nLike Fulham, none of Palace’s four new signings had scored after nine games.\n\nIt was understandable, though, as Jaydee Canvot and Borna Sosa were added to provide defensive depth, while midfielder-turned-striker Christantus Uche had rarely featured. The trio have played just 550 total minutes between them.\n\nYeremy Pino is the only new face to score, striking in the 2-0 win over Wolves and 2-1 defeat by Sunderland. Pino has been guilty of missing a few clear-cut chances and has underperformed his xG by 1.6. Incredibly, that is still only the third-worst mark behind attacking partners Jean-Philippe Mateta (-3.97) and Ismaila Sarr (-1.7).\n\nPalace added Brennan Johnson, Jorgen Strand Larsen and Evann Guessand in the winter to give them viable alternatives to that front three. The issue, however, is that the new three have scored just three times in 56 combined matches from 5.9 xG. So plenty for Oliver Glasner to work on in his final few months with the club.\n\nBrentford broke their transfer record to sign Dango Ouattara from Bournemouth in the summer in a deal worth £42million including add-ons.\n\nOuattara scored on his debut in a 1-0 home win over Aston Villa before repeating that trick at Villa Park last weekend. In between, he scored in the 3-2 win over Liverpool and 3-1 victory against Burnley, while his total of four penalties won is the most in the league.\n\nFellow summer arrival Jordan Henderson was a staple in the starting XI for most of the first half of the campaign, even scoring in the 1-1 draw with Leeds, but has started just two of their last six games. Reiss Nelson, who joined on loan from Arsenal, has played just 50 minutes across six matches, missing time with illness and injuries in addition to being an unused substitute seven times.\n\nIgor Thiago has scored 16 times this season and Brentford seem to be scouting his successor already, signing 18-year-old Kaye Furo from Thiago’s former club Club Brugge in January. Furo has scored just once for Brugge’s first team, but has five goals in 10 caps for Belgium’s under-19 team.\n\nMohammed Kudus began the season with a goal and four assists in his first seven matches, but recorded just one more of each in his next 12. A hamstring injury has sidelined him since January, with Kudus not expected to be back for another month.\n\nJoao Palhinha has been a solid signing, scoring a couple of spectacular efforts against Wolves and Bournemouth to follow his deflected finish after pressing high against Manchester City in August. He has been a massive threat from set pieces and will likely add a few more goal contributions before the end of the season.\n\nSpurs’ creative struggles contributed to Kudus’ drop-off as he took the bulk of the load as Xavi Simons took time to settle. Simons, who assisted Dominic Solanke and played one of his best games this season in the 2-2 draw with City, scored his only league goal in the 2-0 win over Brentford while also assisting Richarlison.\n\nRandal Kolo Muani has offered value with his off-the-ball movement, pressing and link-up play, but is yet to score a league goal in 998 minutes. He has attempted 11 shots but has directed just two of them on target.\n\nIn contrast, Kolo Muani has scored three times from nine shots (five on target) in the Champions League, with all three goals coming against his former teams, Paris Saint-Germain (two) and Frankfurt.",
  "paragraph_count": 88
}