{
  "url": "https://www.nytimes.com/athletic/7022709/2026/02/04/nba-trade-deadline-front-office-moves-timing/",
  "scraped_at": "2026-02-05T14:43:14.877319",
  "title": "The NBA trade deadline has suddenly gotten busy. Here’s why teams got active",
  "author": "",
  "published_date": "Feb. 5, 2026Updated 9:01 am GMT+8",
  "content": "NEW YORK — NBA teams appear as if they’re done procrastinating.\n\nNormally, front offices clutch onto their assets — their draft picks, their players — until the final second. Within 24 hours of the trade deadline, agreements finalize. Swaps finally occur. After days or weeks or sometimes months of negotiating, there’s movement.\n\nBut we’re witnessing a theme this season, and there’s a chance it may become a trend.\n\nTeams are swinging deals 72, 48 hours before the arrival of the trade deadline, scheduled for 3 p.m. ET on Feb. 5. There was the James Harden trade, or the Darius Garland one, depending on your perspective. The Boston Celtics acquired a long-awaited big man: Nikola Vučević. The Sacramento Kings landed De’Andre Hunter. Mike Conley has had three employers in three days. And more.\n\nAll of this after months of silence throughout the league.\n\nOne front-office executive posed a theory: This is a reaction to chaos from last season’s trade deadline.\n\nHeading into the 2025 deadline, three players had issues with their physicals. The Dallas Mavericks acquired Caleb Martin, who failed a physical, but the deal occurred a couple of days before the deadline, which allowed Dallas and the Philadelphia 76ers to amend the agreement and finalize the trade. But Martin’s twin, Cody, also failed a physical, league sources said, after a trade to the Phoenix Suns.\n\nBut that trade was done right up against the deadline — as was, more famously, the Los Angeles Lakers’ trade for Charlotte Hornets center Mark Williams. Martin failed a physical. So did Williams. And since the deadline had passed, the Suns and Lakers were no longer allowed to amend the deal. League rules said they could let the trade go through as is or rescind it, sending all players back to their incumbent teams.\n\nThe Suns kept the trade as is; the Lakers, of course, did not, creating an uncomfortable situation they deemed necessary after seeing Williams’ medical reports.\n\nBut no one wants to replicate that situation. And there’s one way to make sure the awkwardness of Dalton Knecht getting traded to Charlotte, then having to return to the Lakers locker room doesn’t happen to your team: Just execute the trade early enough in the week so that physicals occur before the deadline.\n\nAnd right now, that’s what we’re seeing teams do.",
  "paragraph_count": 11
}