{
  "url": "https://www.nytimes.com/athletic/6838675/2026/02/04/mlb-framber-valdez-free-agency-tigers/",
  "scraped_at": "2026-02-05T14:42:52.730059",
  "title": "Tigers, Framber Valdez agree to three-year, $115 million deal: Sources",
  "author": "",
  "published_date": "Feb. 5, 2026Updated 10:14 am GMT+8",
  "content": "After waiting months for the right deal, free-agent starter Framber Valdez has agreed to a three-year, $115 million contract with the Detroit Tigers, league sources told The Athletic’s Ken Rosenthal on Wednesday. Valdez will have an opt-out after the second year.\n\nValdez ranked No. 5 on The Athletic’s Big Board and was projected by Tim Britton to receive a seven-year, $196 million contract. He rejected the Houston Astros’ qualifying offer of $22.025 million in November, meaning the Tigers will forfeit a draft pick to sign him.\n\nAt a time when durability is disappearing, Valdez has distinguished himself as a workhorse in every sense of the word. He’s gone to the injured list twice in an eight-year major-league career. Valdez threw at least 192 innings in three of the past four seasons, including 201 1/3 frames en route to a fifth-place finish in 2022 American League Cy Young Award voting.\n\nValdez has a 3.23 ERA across 973 innings since becoming a full-time starter in 2020. Only four other major-league pitchers have logged more across that timeframe. Among them, only Philadelphia Phillies ace Zack Wheeler has a lower ERA than Valdez.\n\nValdez made two American League All-Star teams and has finished in the top-10 of Cy Young Award voting during four of his six seasons as a full-time starter. Valdez threw nine complete games during that stretch, including a 93-pitch no-hitter against the Cleveland Guardians on Aug. 1, 2023, and, last May, an 83-pitch masterpiece against the Tampa Bay Rays.\n\nAt his best, Valdez is an ace, a man nicknamed “La Grasa” for the designer clothes and colognes he wears between starts. Valdez’s sinker spearheads an arsenal that’s allowed a 61.5 percent ground-ball rate since 2020. No qualified starter has a higher one.\n\nA wicked curveball kept Valdez afloat early in his career. Now, he complements it with a changeup that can keep right-handed hitters off balance. Valdez is almost impossible to elevate — his 0.70 home runs per nine innings since 2020 is the fourth-lowest mark in the sport — and his mettle has been tested in massive situations.\n\nValdez had a 4.24 ERA across 85 postseason innings with the Astros, none more meaningful than the six frames he tossed while allowing one run during Houston’s World Series-clinching win in Game 6 of the 2022 Fall Classic.\n\nMaintaining that resolve is something Valdez must still master. Throughout his career, he worked with Astros sports psychologist Dr. Andy Nuñez to discover better ways to control his emotions and calm himself amid chaos — two things the 32-year-old southpaw struggled to do every fifth day.\n\nValdez made immense mental strides throughout his ascension with the Astros, but occasional slip-ups still appeared. None drew more attention than his August cross-up of catcher César Salazar and Valdez’s indifferent reaction after the baseball hit his catcher. Though both Salzar and Valdez said the act was not intentional, the scene created a public firestorm just two months before Valdez entered free agency.\n\n“Framber Valdez is well respected in our clubhouse. He’s got a ton of friends. His work ethic is impeccable. He’s strong as a bull. He posts every day and wants the ball. He’s someone I want to go on the battlefield with,” Astros manager Joe Espada said on “Foul Territory” in November.\n\n“I understand the reputation because of one event, one thing that happened. People might reach conclusions (about) that, but I’ve been around him for six or seven years. And if I’m going into a dog fight, I want this guy to be right there next to me.”",
  "paragraph_count": 12
}