{
  "url": "https://www.nytimes.com/athletic/7022474/2026/02/04/gavin-mckenna-felony-charges-arrested-penn-state-hockey/",
  "scraped_at": "2026-02-05T14:43:36.387211",
  "title": "Top NHL Draft prospect Gavin McKenna charged with felony aggravated assault",
  "author": "",
  "published_date": "Feb. 5, 2026Updated 2:23 pm GMT+8",
  "content": "Gavin McKenna, a Penn State hockey forward and one of the top prospects for the 2026 NHL Draft, is facing a felony assault charge for allegedly hitting a man in the face in an altercation that resulted in the man needing corrective surgery, police say.\n\nMcKenna, who turned 18 on Dec. 20, was charged with felony aggravated assault on Wednesday in State College, Pa., according to court documents and a statement from the State College Police Department. The native of Whitehorse, Yukon, Canada, is also facing a misdemeanor assault charge and summary charges of harassment and disorderly conduct for his role in the alleged incident that occurred Saturday.\n\nIn a written statement provided to The Athletic, John Hanna, Penn State athletics’ associate director of strategic communications, said: “We are aware that charges have been filed; however, as this is an ongoing legal matter, we will not have any further comment.”\n\nThe charges were first reported by Onward State, a Penn State student publication.\n\nAccording to the statement and court documents, the incident took place Saturday in the 100 block of South Pugh Street, in State College, at approximately 8:45 p.m. ET. That was hours after the Nittany Lions played Michigan State in an outdoor home game in front of nearly 75,000 fans at Beaver Stadium.\n\nMcKenna allegedly struck a 21-year-old man in the face during the altercation, with the man suffering facial injuries that required corrective surgery, police say. McKenna was arraigned on the charges Wednesday and released on $20,000 unsecure bail. A preliminary hearing is scheduled for Feb. 11.\n\nThe maximum penalty for first-degree felony aggravated assault in Pennsylvania is 20 years in prison and/or a $25,000 fine.\n\nMcKenna is in his first season with the Nittany Lions after three seasons in the junior-level Western Hockey League, during which he emerged as a potential No. 1 NHL Draft pick — and as the first hockey player worthy of a six-figure NIL deal, a major factor in his stunning jump from Canadian juniors to the Big Ten. Once considered the top draft-eligible prospect, McKenna was ranked at No. 4 on The Athletic’s most recent list of prospects, owing largely to an uneven first few months of NCAA hockey.\n\nIn 26 games this season, McKenna has 11 goals and 21 assists, which ties him for the team lead with 32 points. Penn State has eight regular-season games remaining on its schedule. The 2026 NHL Draft is scheduled for June 26 and 27 at KeyBank Center in Buffalo, N.Y.",
  "paragraph_count": 9
}