{
  "url": "https://www.nytimes.com/athletic/7021716/2026/02/04/tottenham-fan-survey-ownership/",
  "scraped_at": "2026-02-05T09:39:20.525552",
  "title": "Tottenham Supporters’ Trust survey shows satisfaction with ownership at ‘all-time low’",
  "author": "",
  "published_date": "Feb. 5, 2026Updated 4:22 am GMT+8",
  "content": "A survey of Tottenham Hotspur Supporters Trust (THST) members has revealed that fan satisfaction with Spurs’ ownership “has fallen to its lowest level since the survey began”, leading to a call for “sustained improvement across the club’s operations”.\n\nThe Five Principles Survey, which is conducted roughly every six months, judges the Tottenham ownership against five tests which THST agreed with the board of the club itself. More than 4,500 fans responded to this survey, an increase in responder numbers, which was released on Wednesday evening. And on all five principles, each marked out of 10, the fans gave the ownership their lowest ever score.\n\nOn ‘Commit to Winning’, the survey gave the ownership an average 1.65 out of a possible 10, sharply down from 3.5 last June. On ‘Attract and Retain Talent’, the survey gave 1.94, down from 3.3. On ‘Future-Proof Success’ the ownership got their best result of 2.96 — but sharply down from 5.9 last June. On ‘Lead with Integrity’ the score was 2.2, down from 4.0, and on ‘Fans First’ it was just 1.9, down from 3.2.\n\nThis was the first Five Principles Survey taken since Daniel Levy’s dismissal as chairman in September 2025, since when the majority-shareholding Lewis family have taken a more visible role with the club. The results taken together further underline the significant gulf in trust between the fans and the ownership right now. These results have already been shared with senior club figures.\n\n“These scores represent an all-time low in supporter confidence in the club’s ownership,” said a THST statement released on Wednesday evening. “Not one of the five principles comes close to an acceptable level, and every area has deteriorated significantly since last summer. Even the Europa League success of 2025 provided only a temporary uplift. Supporters are now judging the ownership on long-term strategy, squad quality, competitiveness, and delivery – and the verdict is clear.”\n\nTottenham appointed former Brentford head coach Thomas Frank in the summer after Ange Postecoglou was relieved of his duties, despite winning the Europa League. The club are 14th in Premier League with 29 points from 24 games and out of both domestic cups, though they finished fourth in the league phase of the Champions League, automatically qualifying for the knockout stages.\n\n“Fans want success that is sustainable, credible, and ambitious,” THST’s statement continued. “They want a club that matches its world-class infrastructure with world-class decision-making, and that genuinely puts supporters at the heart of its future.  Whilst the club acknowledges that it cannot exist without its supporters, the actions it has taken in the past have not always been commensurate with this statement.  We ask that the club follows through this commitment in its interactions with supporters at all levels.  Every communication should be considered through the lens of supporters to ensure they feel that they play a vital role in the success of the football club.”\n\n2025 was a year of change at executive level at Spurs. Alongside the departure of Levy, Vinai Venkatesham was appointed chief executive officer in April, chief football officer Scott Munn left his role and long-serving executive director Donna Maria-Cullen stepped down in the summer, and Fabio Paratici returned to the club as co-sporting director alongside Johan Lange. However, Paratici left the club following the winter transfer window to join Fiorentina, while Rebecca Caplehorn, former head of administration and football governance, left to take a new role at the Premier League.\n\nSpurs are next in action on Saturday when they visit Manchester United in the Premier League.",
  "paragraph_count": 9
}