{
  "url": "https://www.nytimes.com/athletic/7023218/2026/02/04/warriors-hawks-nba-trade-jonathan-kuminga-buddy-hield-kristaps-porzingis/",
  "scraped_at": "2026-02-05T14:41:56.017602",
  "title": "Warriors trading Jonathan Kuminga, Buddy Hield to Hawks for Kristaps Porziņģis: Sources",
  "author": "Sam Amick",
  "published_date": "Feb. 5, 2026Updated 1:23 pm GMT+8",
  "content": "The Golden State Warriors are trading forward Jonathan Kuminga and guard Buddy Hield to the Atlanta Hawks for Kristaps Porziņģis, team sources confirmed to The Athletic.\n\nKuminga, 23, is averaging 12.1 points and 5.9 rebounds a game.He is having one of the most high-profile up-and-down seasons in recent memory.\n\nAfter prolonged contract negotiations over the summer, Kuminga signed a two-year, $48.5 million contract with a team option in the second season. He quickly drew praise from coaches and teammates and earned a place in the starting lineup. Kuminga played well over the first two weeks of the season, but the consistency the organization was hoping to see from him faded after a strong start. He didn’t produce at the same level he had been and was taken out of the starting lineup before a win over the San Antonio Spurs on Nov. 12.\n\nKuminga missed seven straight games because of a knee injury. When he did return, he didn’t play at the level Steve Kerr and the coaching staff was hoping to see. He was taken out of the rotation completely after a Dec. 6 win over the Cleveland Cavaliers where he went 1 of 10 from the field.\n\nHe largely stayed on the bench for the next several weeks. His decision not to play in a Jan. 2 game against the Oklahoma City Thunder, when the Warriors rested veterans Stephen Curry, Draymond Green and Jimmy Butler, irritated many within the Warriors’ front office. Kerr had said before the game that Kuminga would play. An hour before Kerr’s pregame news conference, Kuminga was a late addition to the injury report with lower back soreness.\n\nThat state of affairs continued until Jimmy Butler tore the ACL in his right knee on Jan. 19, an injury that changed the course of the Warriors’ season. Kuminga, who had just demanded a trade from the Warriors, had an opening to regain his minutes. He played well in two games after Butler’s injury, then suffered a bone bruise in his knee during a Jan. 22 loss to the Dallas Mavericks.\n\nThough his relationship with Kerr and the Warriors’ front office had largely soured, Kuminga was still well-liked by many of his teammates and veteran leaders. Curry, Green and Butler repeatedly came to his defense since the beginning of training camp.\n\nWhile the Kuminga departure would certainly appear to take them out of the mix for Milwaukee’s Giannis Antetokounmpo heading into the Thursday trade deadline, team sources would not close the door completely on the pursuit. The team sources also indicated that they had not been told by the Bucks that their offer wouldn’t be accepted prior to the trade for Porziņģis.\n\nIn fact, the sources said, there was an extended lack of communication from the Milwaukee side in recent days that left them, and some other teams, skeptical that Antetokounmpo would actually be on the move. League sources had previously indicated that their offer included forward Green, Kuminga, four first-round picks, a first-round swap and other salary to match. The Warriors’ thinking from here, it seems, is that Milwaukee might hold onto Antetokounmpo until the offseason and allow Golden State to re-enter the race with a different offer.\n\nThe questions about Porziņģis have nothing to do with the quality of his play; they’re merely about whether he can stay on the court.\n\nHe missed half of last season and dealt with what was at the time a mysterious illness (later diagnosed as POTS) during the Boston Celtics’ playoff run. He crumbled during that time. The jump shots were short. The energy zapped. This season, he’s missed the majority of Atlanta’s games.\n\nBut when he’s on his game, he’s still one of the best.\n\nHe’s averaging 17.1 points, 5.1 rebounds and 1.3 blocks in 24.3 minutes, though he’s participated in only 17 games. No center releases 3-pointers from deeper. He’s one of the NBA’s ultimate pick-and-pop weapons and also provides staunch rim-protection on the other side, a rare combination.\n\nBut he also hasn’t played since Jan. 7, this time because of an Achilles injury.\n\nHe makes $30.7 million in 2025-26, but his contract expires this summer, when he will become an unrestricted free agent.\n\nIn a separate move shortly after the Kuminga trade, the Warriors moved big man Trayce Jackson-Davis to Toronto for a 2026 second-round pick, a team source confirmed.",
  "paragraph_count": 16
}