{
  "url": "https://www.nytimes.com/athletic/7022783/2026/02/04/desmond-williams-washington-qb-transfer-advice/",
  "scraped_at": "2026-02-05T14:42:45.479711",
  "title": "Washington QB Demond Williams Jr. cites ‘really bad’ advice while addressing transfer saga",
  "author": "",
  "published_date": "Feb. 5, 2026 10:51 am GMT+8",
  "content": "In his first public appearance since a messy, dramatic transfer saga, Washington quarterback Demond Williams Jr. noted “good” and “really bad” advice as he discussed the transfer portal saga.\n\n“Definitely being 19 (years old), you get good advice and you get really bad advice at times.,” Williams said. “We’re all human.”\n\nWilliams, a rising junior who just completed his first season as a full-time starter, Huskies coach Jedd Fisch and a group of other Washington players spoke during a news conference on Wednesday afternoon. Williams became a polarizing figure in college football last month when he announced his intention to enter the transfer portal on Jan. 6 — days after he signed a revenue-share contract with the school, which is slated to pay him around $4 million. In a since-deleted Instagram post, Williams said the decision was “best for me and my future.”\n\nTwo days later, he announced on Instagram that he would stay at Washington, which never placed him in the portal. The Athletic obtained copies of revenue-share contracts utilized by most Big Ten conference schools, which state that if a player transfers before the end of the payment period, he owes the remaining amount of his contract unless the school accepts a buyout, which means Williams would have owed Washington plenty of money. According to the College Sports Commission rules, Williams’ buyout could have counted toward his next school’s revenue-share cap of $20.5 million.\n\nWilliams, when asked if there was any feeling that he must win anyone over who may still have hard feelings about his intention to transfer and how the situation played out, said “my entire focus is focused on moving forward and having my eyes set on our goals as a team and continue to be the leader and the quarterback for this team that I can be and taking it day by day.”\n\nWilliams passed for 3,065 yards, 25 touchdowns and eight interceptions and rushed for 611 yards and six scores. He’s an exciting, athletic quarterback, but also really struggled against the best defenses the Huskies faced last season (Ohio State, Oregon and Michigan).\n\nWilliams was a four-star prospect in the 2024 recruiting cycle and signed with Fisch at Arizona. He transferred to Washington weeks later when Fisch took the head-coaching job in Seattle. Williams was committed to Ole Miss and Lane Kiffin at a point during his recruiting process.\n\nUpon Williams announcing his intent to transfer, there was rampant speculation that he would land at LSU with Kiffin. When asked if LSU tried to lure him into the portal, Williams said, “No comment.”\n\nThere was a lot of optimism about Williams and Washington before the transfer debacle and subsequent backtrack. The Huskies jumped from 6-7 in Fisch’s first season to 9-4 in his second, and Williams has a year of experience under his belt. The situation, of course, left a sour taste in some fans’ mouths. We’ll have to wait until Sept. 5, when Washington opens the season against in-state rival Washington State, to see if it has any impact on the field.\n\n“We all make mistakes,” Williams said, “and at the end of the day I’m just super blessed to be here with my brothers and my coaches at the University of Washington, and I’m just so happy to be here and so blessed.”\n\nWilliams, when asked what he took into consideration when deciding to return, said the family aspect and “being here, staying here and understanding this is where I’m meant to be and this is where God has placed me, and I appreciate the whole community. I appreciate all my brothers on this team, all my teammates and all my coaches for accepting me back and being able to come in here and still lead the team to all the expectations.”",
  "paragraph_count": 11
}