{
  "url": "https://www.nytimes.com/athletic/7015588/2026/02/05/manchester-united-commercial-revenue/",
  "scraped_at": "2026-02-05T18:17:40.349274",
  "title": "Why Manchester United have commercial concerns – and what they’re doing about them",
  "author": "Mark Critchley",
  "published_date": "Feb. 5, 2026Updated 4:08 pm GMT+8",
  "content": "When Manchester United fell to their lowest-ever position in Deloitte’s annual ‘Football Money League’ recently, it was not hard to see why.\n\nUnited’s £172.9million ($236m) earned in broadcasting income paled in comparison to many of their domestic and European rivals last season for one simple reason: no Champions League football.\n\nConsistently qualifying for and reaching the latter stages of Europe’s elite club competition would be the quickest fix for a club whose financial dominance is becoming a thing of the past, and recent results under the interim head coach Michael Carrick have sparked hopes of a return to Europe’s elite next season.\n\nAnd yet, despite more than a decade of inconsistent Champions League participation, United had remained a fixture in Deloitte’s top five until now, and are still one of the highest revenue-generating clubs in Europe.\n\nMatchday earnings have always been strong on account of Old Trafford’s 74,197 capacity, but United’s revenues have often surged clear of their rivals because of turbo-charged commercial and sponsorship income.\n\nDespite a miserable 15th-place Premier League finish and defeat in the Europa League final last season, United’s commercial revenues hit £333.3m, a club record. According to the Money League, only Real Madrid, Barcelona, Bayern Munich and Manchester City brought in more.\n\nOf that figure, £188.4m ($257.3m) came through sponsorships — the second-highest return in United’s history, only slightly behind the £189.5m ($258.8m) earned two years earlier.\n\nAlmost half was earned through United’s decade-long £90m-per-season ($123m) partnership with kit manufacturer Adidas, hailed as the largest in Premier League history upon its renewal in July 2023.\n\nA few months later, that was followed by a £60m-a-year ($82m) agreement with principal sponsor Qualcomm, a U.S. technology firm. A subsidiary of Qualcomm, Snapdragon, has adorned the front of United’s men’s and women’s shirts for the past two seasons.\n\nLike the Adidas renewal, it defied the expectations of many industry observers and demonstrated that despite a decade of underwhelming results, the club’s ability to attract big-money sponsors remained.\n\nVindication, it would seem, for Ed Woodward. United’s former executive vice-chairman memorably told investors on a New York Stock Exchange conference call in 2018 that “playing performance doesn’t really have a meaningful impact on what we can do on the commercial side of the business”.\n\nThat statement, ridiculed by sceptics at the time, has been broadly proven correct since, but is it starting to be put to the test?\n\nUnited have not had a training-kit sponsor in place since last summer, following the end of a three-year deal with blockchain company Tezos. The club’s partnership with shirt-sleeve sponsors DXC Technology is also set to expire at the end of the season.\n\nUnited insist they are relaxed about both situations, and that their priority with the training kit deal is to find the right partnerships at the right value, rather than simply moving quickly to fill the gaps. They point to Chelsea’s lack of a permanent shirt sponsor since the end of the 2022-23 season as a point of comparison in their favour.\n\nYet there is no question that United’s commercial department is faced with the task of addressing a shortfall in sponsorship revenues. This stands at a minimum of £24m — the value of the Tezos deal — and potentially more for as long as a sleeve sponsor is not secured.\n\nThis matter was on the agenda at the recent executive committee meeting (ExCo) at the club’s Carrington training complex, attended by majority owners Joel and Avram Glazer. United sources, speaking anonymously to protect relationships, have told The Athletic that both men have voiced their concerns internally at commercial performance. The club, for their part, insist that while the senior executive team is aware of the challenges facing them, it is aligned on strategy.\n\nUnited sources have told The Athletic that fears over a shortfall in commercial revenues have led to Jean-Claude Blanc, chief executive of INEOS Sport, becoming a more active presence at the club.\n\nBlanc was one of the most prominent INEOS figures at United upon the completion of Sir Jim Ratcliffe’s minority investment two years ago, which saw him appointed to the club’s board of directors and briefly serve as interim chief executive between Patrick Stewart’s departure and Omar Berrada’s arrival during 2024.\n\nThe 62-year-old stepped down from United’s board last March but has continued working for the club as chief of international football relations, representing United at meetings and conferences with authorities and governing bodies such as FIFA, UEFA and the European Club Association.\n\nBlanc, who was spotted back in the Old Trafford directors’ box during the recent Manchester derby, is monitoring the club’s commercial operations and will work alongside Marc Armstrong, United’s chief business officer.\n\nUnited insist Blanc has continued to regularly attend ExCos since stepping down from the board and has been consistently available as a source of advice and support for club staff.\n\nArmstrong began work in the newly-created role at United a year ago after spending the best part of seven years in senior commercial roles at Paris Saint-Germain, and worked under Blanc, who was PSG’s chief executive between 2011 and 2022.\n\nTheir challenge will not only be to fill the training-kit vacancy and address the shirt-sleeve situation as soon as possible, but to reverse a sense that years of underperformance on the pitch is beginning to be felt commercially.\n\nUnited’s sponsorship struggles come after a period of significant upheaval within the club’s commercial department, following swingeing cuts to its workforce by minority owner Ratcliffe and his INEOS-led hierarchy\n\nAccording to United’s accounts, the club’s average number of employees listed in commercial roles during the 2023-24 season was 170.\n\nAlthough not far off the 193 non-playing staff in the football department, club sources argue the size of the workforce was justified given the complexity of landing big-money deals when the men’s team is underperforming.\n\nLast season, that average headcount fell to 129, a fall of 24 per cent, and will likely drop further when the completion of the restructuring programme is reflected in this season’s end-of-year accounts.\n\nThe department has not only been depleted but decapitated, with many of the key figures who were influential in securing the money-spinning Adidas and Qualcomm agreements during 2023 departing, then needing to be replaced.\n\nJames Holroyd, a key figure in securing the Adidas deal, left his position as chief commercial development officer to become CEO at Burnley. Victoria Timpson, United’s former chief executive of alliances and partnerships, left only a few months after the Qualcomm partnership was announced. Timpson is now leading Altius8, a commercial agency with a team including many ex-United staff.\n\nAccording to those familiar with United’s commercial operations, the loss of organisational knowledge and experience over the past 18 months is key to understanding United’s issues with retaining and then attracting partners for some of their most significant sponsorship contracts.\n\nAs technology-based partnerships, Tezos and DXC’s deals involved elements of integration with United’s day-to-day operations, both on the football and commercial sides of the club’s business.\n\nThe partnership with Tezos was unveiled in early 2022 — not coincidentally, at the tail end of a cryptocurrency boom — and was most notable for a collaboration on collections of United-branded non-fungible tokens (NFTs).\n\nDXC Technology, meanwhile, was announced as United’s ‘digital transformation partner’ as well as the shirt-sleeve sponsor. The U.S.-based firm worked closely with United on enhancing their official app, introducing greater user personalisation, but also had an influence on on-pitch performance.\n\nIn 2024, a DXC report detailed how the company was helping to build a ‘football data hub’ to support United’s fledgling data department, by “empowering the club’s own data scientists to tailor their tools precisely to the demands of player performance analysis.”\n\nAs so-called ‘integrated partners’, Tezos and DXC collaborated with teams of dedicated United staff on these projects. Sources familiar with United’s commercial operations note that if staff working on integrated projects with partners are made redundant, that knowledge is not easily replaced, and partners are naturally less likely to renew.\n\nBudgets have been cut as well as headcounts. Marketing campaigns related to partnerships were carried out by United staff to help sponsors feel they were receiving a return on their investment, yet have increasingly fallen victim to tightened purse strings.\n\nMany of the perks that sponsors could expect have also been pared back, meaning fewer tickets and free shirts. Though that may sound trivial, these corporate benefits would often keep sponsors’ attention away from underwhelming results on the pitch or controversies off it.\n\nMaintaining these relationships also often meant going the extra mile and offering round-the-clock support, with commercial staff at times working 20-hour days. That approach is now described as impractical with a smaller team.\n\nINEOS’ attitude is to deliver no more than what is written down in the black-and-white of a partnership contract, according to some sources, who claim that United’s hierarchy fundamentally failed to understand the nature of the commercial beast they inherited.\n\nCosts have unquestionably been cut on the commercial side, but United insist those overheads were extravagant, and unnecessary to still deliver an excellent level of service to partners.\n\nThe club believes that what sponsors want more than anything else is a successful United on and off the pitch, and that existing partners have reacted positively to changes behind the scenes since INEOS’ arrival.\n\nTezos’ partnership reached the end of a three-year contract last summer. Sources say that despite the cuts, the company was still keen to negotiate a smaller deal, ending their training-kit sponsorship but continuing their work on specialist projects. United were not open to that prospect.\n\nSix months on from United and Tezos’ split, United’s digital collectibles website redirects to the club’s home page, manutd.com. United say no new NFTs are being minted and those already purchased can be traded on secondary markets. The training kit is still sponsorless.\n\nAnother factor set to depress United’s sponsorship revenues this season is that, for the first time since the kit partnership with Adidas began, they will not receive the full annual value of the deal.\n\nThe original Adidas deal, unveiled in 2015, included a clause which cut their annual payment by 30 per cent if United failed to qualify for the Champions League in two consecutive years.\n\nThat clause was never applied — United narrowly avoided triggering it in 2017 and 2020 — but it was renegotiated upon renewal of the partnership, with the ‘consecutive seasons’ condition removed and the penalty reduced to £10m ($13.7m).\n\nThe new clause did not apply last season, reprieving United for only competing in the Europa League, but came into effect this year — United’s first campaign without European football in more than a decade.\n\nA further £10m ($13.7m) penalty will apply next season if United once again fail to qualify for the Champions League, placing added emphasis on the importance of a strong finish to the season under Carrick.\n\nUnited’s front-of-shirt partnership has also been affected by results. As part of its deal, Qualcomm is able to offer the back-of-shirt rights for men’s domestic cup and women’s games to its own business partners, helping to build commercial relationships.\n\nMicrosoft has filled that space over the past two years, promoting their range of AI-powered Copilot+ PC laptops. Last season, as well as sporting the Copilot+ PC logo on their pre-season tour, United’s men wore it on their backs in seven competitive fixtures: the Community Shield against Manchester City, three FA Cup games and three Carabao Cup games.\n\nThis year, United’s early exits in the domestic cups has meant that logo has only been on display for one of the lowest points of the season, last month’s FA Cup defeat to Brighton & Hove Albion, and one of the lowest points in the club’s history, the Carabao Cup debacle away to fourth-tier Grimsby Town.\n\nUnited’s disappointing cup campaigns and lack of European football have opened space within the calendar for mid-season friendlies, which could help offset revenues lost through playing fewer competitive games.\n\nInitial conversations regarding mid-season fixtures in Saudi Arabia were revealed by The Athletic in October. Last week, the president of the Kuwait Football Association, Sheikh Ahmed Al-Yousef, claimed that he had turned down a request from United to play a friendly in the Gulf state in February. United denied this to The Athletic, although they did not rule out the possibility that a third party may have pitched the idea to Kuwait on their behalf.\n\nUnited were also offered the opportunity to embark on a warm-weather training camp in Florida during their spare weeks in the second half of this season, although this was turned down. The Athletic was told this followed a consultation with the players; United insist that this was purely a club decision.\n\nMid-season friendlies are sticking plasters compared to the multi-million, multi-year sponsorship deals that have been the foundation of United’s ability to consistently generate more revenue than their Premier League rivals.\n\nUnited say that ability has not diminished and that, outside of the lack of training kit sponsor, commercial revenues have been strong during 2025-26 to date.\n\nLast summer, the club withdrew from talks with Amazon Prime regarding an all-access documentary deal worth significantly more than £10m, representing the largest ever payment to a club for an ‘All or Nothing’ series, after former head coach Ruben Amorim made clear he was not comfortable with the potential intrusion on the first team.\n\nAmorim’s position was supported at a subsequent ExCo, with sporting reasons prioritised over commercial benefits. United argue those were not the actions of a club scrambling to recover lost revenues, and that commercial position remains the envy of their peers.\n\nThe fact remains, however, that United are now increasing pressure from their Premier League rivals, who have been closing the gap on their commercial dominance over the past decade.\n\nWhile United’s commercial income has increased by a quarter in that time, Manchester City’s has almost doubled. Arsenal, Liverpool and Chelsea have grown even faster, but not as quickly as Tottenham Hotspur, whose commercial takings have rocketed by a stunning 335 per cent following the opening of their new stadium.\n\nAll of United’s rivals in the Premier League’s so-called ‘big six’ were building from a much lower base back then, making impressive percentage gains more attainable, but they are now catching up in absolute terms too.\n\nTottenham’s commercial income was more than £200m ($273.2m) short of United’s in 2016. In 2023-24, they were less than £50m ($68.3m) behind. Although United remain well ahead of Arsenal and Chelsea, commercial earnings at Anfield surpassed those at Old Trafford two seasons ago. City’s moved ahead five years ago.\n\nIn terms of sponsorships alone, even with those money-spinning deals with Adidas and Qualcomm, and with Tezos still on board, United’s earnings had only grown by £28.3m ($38.7m) over the past decade. Only Tottenham also disclose sponsorship income in their annual accounts, but that increased by £30.5m ($41.8m) in their three years of figures.\n\nAn advantage that United once had over their rivals has been gradually chipped away. And after a turbulent and uncertain 18 months for the club’s commercial department, they cannot afford to fall behind.",
  "paragraph_count": 64
}