{
  "url": "https://www.nytimes.com/athletic/7022445/2026/02/04/tush-push-troy-vincent-nfl-officiating/",
  "scraped_at": "2026-02-05T14:43:43.968156",
  "title": "Will the tush push stay? NFL executive says league is ‘discussing it’",
  "author": "",
  "published_date": "Feb. 5, 2026Updated 8:22 am GMT+8",
  "content": "SAN FRANCISCO — NFL executive vice president of football operations Troy Vincent said the league will have conversations about the tush push this offseason after a year in which the officiating of the play came under scrutiny.\n\n“We’re just discussing it lightly, not a lot. It’s a very difficult play to officiate from the line judges,” Vincent said on Wednesday during a Super Bowl week news conference. “We’ve got some work to do. We’ll revisit that particular play, and we’ll see how the membership feels about it if they want to do anything about it.”\n\nMade popular by the Philadelphia Eagles, the tush push is a play where the quarterback takes the ball under center and is pushed from behind by his teammates. It’s notoriously difficult for teams to stop, and NFL owners considered banning it last year, though that initiative fell two votes shy of passing. If a ban is considered again, it will need to come from the team owners.\n\n“That is the membership, not the league office, so this is the clubs that are saying ‘Hey, we need to take a look at this,’” Vincent said. “There was a lot of discussion about it. We’ve been up front about how difficult it is to officiate, and we just want to be consistent.”\n\nVincent said there were a few situations in 2025 where officials did not get calls right on tush push plays. In particular, he recalled a contentious whistle blown on a tush push during an Eagles game against the New York Giants in October that stopped forward progress and saved the Eagles from a turnover. Philadelphia scored two plays later, though the Giants won 34-17.\n\n“That early Giants-Eagles game, we made a mistake on the field that frankly changed the complexion of the game,” Vincent said. “We need to recognize those fouls, we need to call those fouls accurately on those plays where we missed it. So, we’ll revisit again. Is it something that we still want to do, or should we be tweaking it a little bit?”\n\nIn The Athletic’s player poll, athletes were less critical of the tush push, with 83.8 percent saying they would oppose a ban on the play.\n\n“We’re trying to avoid the scrum play when you look at the pushing and the pulling, but teams have become very creative,” Vincent said. “When you look at what teams are doing in that formation, they give you a look, and they’re not running, if you want to call it, a sneak. It will be discussed.”\n\nVincent also gave his input on the turf vs. natural grass debate on Wednesday. MetLife Stadium has been criticized by players and coaches for the conditions of its turf field. Over a dozen players have suffered knee ligament or Achilles tears at the venue since 2020, and Packers coach Matt LaFleur called out the “hard surface” after running back Josh Jacobs suffered a knee contusion in a November game against the Giants.\n\nVincent said the last data he saw indicated no significant difference between injury rates on natural grass versus synthetic, “but we keep studying that,” he added.\n\nVincent, who played 15 seasons as a defensive back, said he preferred playing on turf. Sean Lee, another panelist on Wednesday who played 10 seasons with the Dallas Cowboys, also said he preferred turf as a player.\n\n“Playing on turf, you can play with the same cleats week in and week out,” Lee said. “You get on grass, and it’s muddy, you have to put a different cleat on and put studs on. There’s just so much that goes into preparing for games.”",
  "paragraph_count": 12
}