{
  "url": "https://www.nytimes.com/athletic/7028881/2026/02/07/barcelona-european-super-league-teams/",
  "scraped_at": "2026-02-07T22:09:11.171876",
  "title": "Barcelona ‘formally withdraw’ from European Super League project",
  "author": "",
  "published_date": "Feb. 7, 2026Updated 8:33 pm GMT+8",
  "content": "Barcelona have started the process of withdrawing from the European Super League (ESL), leaving Real Madrid as the only founding member in the project.\n\nOf the 12 founding ESL members, nine pulled out swiftly following its launch. Another, Juventus, said in 2023 that they had withdrawn from the proposal, leaving just Barca and Madrid attached to the project.\n\nOn Saturday, a Barca statement said the club had “formally communicated to the European Super League company and clubs that have been part of it” that they would be withdrawing.\n\nIn January 2023, the Catalan club’s president, Joan Laporta, said he remained convinced a new European League to initially compete with England’s Premier League would still be launched.\n\nThe 20-team, closed-shop ESL was initially launched in April 2021, but fell apart following a substantial backlash from supporters.\n\nSix English Premier League clubs — Arsenal, Chelsea, Liverpool, Manchester City, Manchester United, and Tottenham Hotspur — all immediately withdrew, along with Spanish side Atletico Madrid and both Milan and Inter of Serie A.\n\nIn December 2023, A22 — the Madrid-based management company working on behalf of the ESL — announced a change of proposals, to 64 clubs competing in three divisions. Relegation and promotion would be possible between those tiers, with the potential for 20 teams to qualify for the league each season via their domestic results. TV coverage would also be free for fans. It did not, however, reveal how sides would access this revised competition.\n\nThe ESL’s plans had changed again by December 2024, with a proposed four-tier format, comprising 96 clubs, with teams qualifying via their domestic leagues. The project was repackaged as the Unify League, which would be divided into four sections — Star, Gold, Blue and Union — with 16 teams each in the first two, and 32 in both of the others.\n\nLast November, A22 wrote to UEFA demanding pre-authorisation of its Unify League concept “within eight weeks”. The competition would, in theory, challenge UEFA’s Champions League, Europa League and Conference League system, rather than nations’ domestic leagues.",
  "paragraph_count": 9
}