{
  "url": "https://www.nytimes.com/athletic/7027013/2026/02/07/cristiano-ronaldo-saudi/",
  "scraped_at": "2026-02-07T16:09:12.517126",
  "title": "Cristiano Ronaldo is post-football within football. It matters more when he doesn’t play",
  "author": "",
  "published_date": "Feb. 7, 2026 1:15 pm GMT+8",
  "content": "What’s the last memorable Cristiano Ronaldo goal you saw? Be honest about it.\n\nThe last one I witnessed in person was in Hamburg. It was the 2024 European Championship quarter-finals; a forgettable 0-0 between Portugal and France after 120 minutes. The shootout that decided it caused both sets of fans agony. For the rest of us, sudden death felt like a mercy killing. Ronaldo’s only goals at the tournament came in these circumstances. He had done his part in another shootout against Slovakia a round earlier, a source of personal relief after he missed from the spot and melodramatically burst into tears in normal time.\n\nRonaldo started his run-up in Hamburg, scored his penalty and hoped for the best. But France’s takers were perfect from the spot. Joao Felix, now a team-mate at Al Nassr, was not, and Portugal were going home.\n\nOnline almanacs tell me Ronaldo has scored 55 times since then. The weight of some of them is undeniable. He got the winner in a Nations League semi-final against Germany last summer. He then sent the final to extra time and Portugal beat the current European champions, Spain, in another shootout, although without a penalty from Ronaldo, who had been replaced with Goncalo Ramos in the 88th minute.\n\nThe Nations League’s detractors will diminish this success. The competition congests the calendar and adds to the impression that there is too much football. The tiredness of the players has a diminishing effect on the level of spectacle and the games and goals become unmemorable. This is a general view, and it has its merits.\n\nHowever, it was not the Portuguese view, as, nearly a decade on from winning Euro 2016, this nation of only 10.7 million people, a nation that had won nothing before then, even with the great Eusebio, won another Nations League.\n\nPerhaps the shallow information processing or cognitive overload caused by social media is why the action from that game (and many others I wasn’t actively reporting on) is a blur to me. Is it a reflection of the age we live in and the attention economy? Is it ignorance, the senses desensitised to 961 career goals, or a creeping on-the-pitch irrelevance specific to Ronaldo?\n\nCall it Ronaldo fatigue, a sense football should have moved on since Lusail, Qatar, in 2022 when Portugal’s then coach Fernando Santos dropped him to the bench for their round of 16 World Cup round of 16 tie against Switzerland and Ramos, his replacement in the starting line-up, scored a hat-trick in a 6-1 win.\n\nHaving left Manchester United “by mutual agreement” earlier in that tournament, a month after Morocco eliminated Portugal in the quarter-finals, Ronaldo signed for Al Nassr to help affect the “transformation” of the Saudi Pro League and realise crown prince Mohammed bin Salman’s Vision 2030 to diversify Saudi Arabia’s economy away from oil dependence.\n\nRonaldo has been there for just over three years, the same length of time, for instance, that he was at Juventus. He has scored 117 goals but not won the Saudi Pro League nor the Asian Champions League. Unless you’re Portuguese, Saudi or a Ronaldo superfan, how many of them have you seen? Which of them can you easily recollect? If one or more, it’s perhaps a sign you’re too online.\n\n“For me, it is more easy to score in Spain than in Saudi,” the long-time Real Madrid forward said last November. He cited the players who have followed him to the Gulf state as evidence of its league’s strength. Al Hilal impressed at the Club World Cup, drawing 1-1 with Madrid while going unbeaten in the group stage and then knocking out Manchester City 4-3 in the round of 16. Research from Twenty First Club also argues that the Saudi league’s state Public Investment Fund-owned clubs are equivalent to the bottom half of the Premier League in quality — relegation battlers, but top tier.\n\nOverall, though, the same analysis ranks the Saudi Pro League as 29th in the world. That’s similar to the Allsvenskan in Sweden. This is not to gratuitously knock the competition — Saudi Arabia had a strong football tradition long before the arrival of Ronaldo and other big names.\n\nFootball is, of course, more than just the Premier League and Champions League. But both generate so much noise and content, it is hard even for someone with more than a billion followers to cut through.\n\nThis week was an exception, as Ronaldo became a story for not playing a game. Not playing made it relevant, transcendent.\n\nRonaldo not playing has, on one level, always mattered. It mattered in the past because it weakened his teams and made them less likely to win. They no longer stood in the tunnel believing they were 1-0 up before a ball had even been kicked.\n\nIn Qatar four years ago, Ronaldo not starting that tie against Switzerland seemed to herald the end of his international career. It didn’t.\n\nNot playing for Al Nassr against Al Riyadh on Monday mattered for different reasons. Al Nassr won without him. Sadio Mane got the only goal against the 10 men of Al Riyadh. He was absent from the squad for a second time on Friday for the match against Al Ittihad.\n\nRonaldo not playing seemed to matter because of what it might mean for his relationship with Saudi Arabia, for his role in MBS’s Vision 2030. It seemed to matter more for commercial and political ramifications than football ones.\n\nHe has crossed the David Beckham threshold, redefining it on his own terms; evolving from being famous for football to being famous for being famous. The football is increasingly like Kim Kardashian’s attempts to sit the bar exam in The Kardashians; a stated purpose but also a subplot to the principal narrative about what Kim, Kris, Khloe, Kendall, Kylie and Kourt are up to in Milaaaahn, Paris and Calabasas, their work-out regimens, make-up and shapewear brands and what they’re wearing for the Met Gala.\n\nNo goal in Saudi and no victory in the Arab Champions Cup has caught the attention like Ronaldo becoming a billionaire, meeting Donald Trump and taking a selfie with Elon Musk, Howard Lutnick, Gianni Infantino and the president of Open AI, Greg Brockman, while at the White House for MBS’s first visit there in seven years.\n\nRonaldo’s apparent grievance that Al Nassr — a club with his childhood friend and Sporting CP academy graduate Nelson Semedo as CEO and Simao Coutinho, an influential former Portuguese agent, as technical director — did not show enough ambition in the winter transfer window while Al Hilal were signing his old Madrid team-mate Karim Benzema from Al Ittihad, at least shows he cares about the football.\n\nBut how much should we care about this aspect of his football career in strictly football terms?\n\nIn much the same way that Michael Jordan’s legacy was set at the Chicago Bulls, not the Washington Wizards, how much would making it to 1,000 goals or winning the Saudi Pro League impact Ronaldo’s own legacy in the game?\n\nThe only juice left in the squeeze is this summer’s World Cup or going back to Europe, as Johan Cruyff did after spells with the Los Angeles Aztecs and Washington Diplomats in America, and winning something back home with, let’s be romantic, Sporting.\n\nAs for his legacy outside of it, well, that’s another conversation.\n\nRonaldo is today a reflection of how the media, sport and entertainment industry is more and more about media and entertainment and less about the actual sport.\n\nHe is post-football within football. It matters more when he doesn’t play.",
  "paragraph_count": 27
}