{
  "url": "https://www.nytimes.com/athletic/7029175/2026/02/07/kenan-yildiz-juventus-contract-new/",
  "scraped_at": "2026-02-08T02:09:00.533786",
  "title": "Kenan Yildiz extends Juventus contract through to 2030",
  "author": "",
  "published_date": "Feb. 8, 2026Updated 12:35 am GMT+8",
  "content": "Kenan Yildiz has extended his contract with Juventus through to 2030.\n\nThe agreement adds a further 12 months onto the 20-year-old Turkey international’s previous deal, signed in the summer of 2024.\n\nYildiz was handed the iconic No 10 shirt by Juventus at that time and has grown into an influential figure for the club, scoring 21 goals across a season-and-a-half since.\n\n“I want to thank John Elkann, (Damian) Comolli and everyone at Juventus, the manager, my team-mates and the fans,” Yildiz said upon the deal being signed.\n\n“I am very, very happy to renew my contract and to be in the history of Juventus in your family. I am very confident that we will achieve great things in the future.\n\n“I love Juventus because since I’ve been here I have always felt we would achieve great things together. I’ve always been sure that the fans and my family are behind me.”\n\nThe versatile attacker is most comfortable in a central playmaker role, but has been utilised across multiple positions at Juve including in a left-sided attacking role in a 4-2-3-1 formation under head coach Luciano Spalletti. The side do not have a defined system however, and also play in a 3-4-2-1 shape.\n\n“We’re all dressed up for it because it’s a big day for Juventus,” Spalletti said. “It’s significant in what it says about the intentions of this club. It’s wonderful to think we’ll have Kenan on the team for years to come.”\n\nYildiz has scored 12 goals — the club’s top scorer — and provided eight assists for Juve this term.\n\nHe has also established himself as a key player at international level with Turkey, scoring five goals in 26 appearances.\n\nAnalysis by James Horncastle\n\nThis is arguably the signing of the season for Juventus.\n\nYildiz’s rise over the last 18 months has led to questions whether or not the club could retain him. Juventus were heavily criticised last year for financing a rebuild with hasty sales of Next Gen graduates like Dean Huijsen and Matias Soule.\n\nIt was one of the reasons the club’s general manager Cristiano Giuntoli lost his job. New CEO Damian Comolli has not made the same mistake.\n\nJuventus have done everything within their power to make Yildiz feel valued. Already given the prestigious No 10 shirt at the beginning of last season, Yildiz was handed the captain’s armband away at Real Madrid in the Champions League league phase.\n\nThe presence of John Elkann, the scion of the Agnelli family, at his contract signing is another illustration of how significant they consider Yildiz to be for the future of the club",
  "paragraph_count": 16
}