{
  "url": "https://www.nytimes.com/athletic/7028812/2026/02/07/rayo-vallecano-oviedo-postponed-la-liga/",
  "scraped_at": "2026-02-07T20:09:29.955599",
  "title": "Oviedo to ‘pursue legal actions’ as La Liga game at Rayo Vallecano called off over pitch",
  "author": "",
  "published_date": "Feb. 7, 2026Updated 7:40 pm GMT+8",
  "content": "Real Oviedo “will study and pursue all appropriate legal actions” after its La Liga match at Rayo Vallecano was called off four hours before kick-off due to the condition of the home side’s pitch.\n\nThe game was scheduled to be played on Saturday afternoon at 2pm local time, but the league confirmed the postponement at 10.14am as the “pitch did not meet the necessary guarantees to secure the player’s safety”.\n\nThe postponement comes after a statement from Rayo’s players, with the support of the club’s coaching staff, on Friday that was made via the AFE Spanish players union that complained about the state of the club’s facilities.\n\nOviedo, who are based 235km to the north of Madrid, where Rayo play, said the club’s staff, players and supporters had already travelled to the Spanish capital and the timing of the decision was “a clear detriment to our club, from a sporting, organisational, and financial perspective”.\n\nLa Liga said “Rayo made significant efforts this week” to ensure the replacement of the pitch at their Vallecas stadium, but “adverse weather conditions and the forecast of further rain” had meant the pitch could not guarantee the minimum safety standards for players.\n\nRayo’s official communication on the situation was to republish the statement from La Liga.\n\nOn Friday, Rayo’s players highlighted how the players were unable to train at the club’s facilities for three months earlier this season due to the “poor condition of the pitches”.\n\nThe players added the state of the club’s first-team pitch at Vallecas was “clearly deficient, and a situation that has worsened with each passing week”.\n\n“We believe that the playing field does not meet the minimum requirements to play a top-level match,” the statement added.\n\n“There is also a lack of hot water in the showers on certain days, cleaning that has not always been adequate, and outdated facilities that do not meet the standards required by a top-flight club for proper professional performance.”\n\nThe players added: “We wish to emphasise that all of these points have been previously brought to the attention of the club’s president (Raul Martin Presa) on several occasions.\n\n“However, the solutions promised and the explanations received so far have not effectively resolved a situation that we believe cannot continue any longer, as we see our physical safety and basic working conditions at risk.”\n\nSpeaking on Saturday’s postponed match, Oviedo’s sporting director Roberto Suarez said, via the club’s official media: We sympathise with the Rayo players and coaching staff, but there are rules of the game here and they have been broken.\n\n“It clearly shows the state of our competition and the state of La Liga. We put up with schedules, sanctions…we put up with a lot.\n\n“It’s not normal that we have everything ready to play and it’s well known that the turf at Rayo’s stadium was only laid yesterday, so it’s impossible for it to be in good condition.\n\n“We have to look for alternatives and clearly this happens to us small teams. We don’t all play with the same cards. It’s not the same to play this match now as it is in 15 days from now.”",
  "paragraph_count": 16
}