{
  "url": "https://www.nytimes.com/athletic/7023570/2026/02/07/guardiola-rosenior-managers-talking-politics/",
  "scraped_at": "2026-02-07T16:09:19.922474",
  "title": "Pep Guardiola, Liam Rosenior and the risks and rewards for football figures talking politics",
  "author": "",
  "published_date": "Feb. 7, 2026 1:10 pm GMT+8",
  "content": "Journalists attending Pep Guardiola’s press conference on Tuesday probably did not expect to hear about Palestine, Russia, Sudan, and the killings of Alex Pretti and Renee Good by U.S. federal agents — and who can blame them?\n\nThis is not Manchester City manager Guardiola’s first time speaking about social and political issues, but on the whole, it is rare for those in his profession — and footballing figures more broadly — to do so.\n\nGuardiola has talked about independence from Spain for his home region of Catalonia, and used an honorary degree ceremony at the University of Manchester to highlight the situation in Gaza. Jurgen Klopp, while manager of Liverpool, was critical of Nigel Farage, Boris Johnson and Donald Trump.\n\nOther top coaches and managers have expressed reservations about getting involved in issues they view as outside of the sport.\n\nEngland head coach Thomas Tuchel spoke before his first game in charge about wanting to “focus on football” rather than politics, while Aston Villa manager Unai Emery was keen to stay out of the political debates surrounding his side’s recent European fixture against Maccabi Tel Aviv of Israel.\n\nIndustry experts, each speaking separately to give their opinions, explained to The Athletic the potential barriers to football figures speaking out about political and social issues, and the potential benefits for those who choose to do so.\n\n“I’m delighted that (Guardiola) has spoken about Palestine,” says Craig Foster, former captain of Australia’s national team. “We need as many high-profile football people as possible to show some courage and actually say something.”\n\nFrom 2017-21, as his playing career was ending and he was starting out in coaching and football punditry, now Chelsea boss Liam Rosenior was a columnist for UK newspaper The Guardian. As well as many pieces on the game, Rosenior also wrote on wider issues — including the need for a culture shift to help gay male players feel comfortable enough to come out and an open letter to Trump, then in his first stint as president of the United States, in the wake of police officer Derek Chauvin’s murder of George Floyd in 2020.\n\n“If you have a platform and you believe in something, why shouldn’t you speak about it if you’re being respectful?” Rosenior said in a press conference last Friday, in response to a question from The Athletic about why some coaches choose to engage on such topics.\n\n“I always respect people when they’re honest. I respect different people’s different viewpoints on many things. So if you feel strongly enough about something and you speak with respect, you should always be able to feel like you should do it.”\n\nFoster, a former midfielder who played for Australia 29 times from 1996 to 2000, has been a vocal human-rights campaigner.\n\nHe is now an Adjunct Professor of Sport and Social Responsibility at Torrens University in Adelaide, sits on the Australian Multicultural Council and has spoken about topics including alleged human-rights violations in Iran and Gaza, as well as about calls to boycott the 2026 World Cup, which is largely being played in the United States.\n\n“There’s a range of reasons (people in football might not speak out),” Foster says. “One is the pushback they get, and the abuse and the vile responses. There is great political pressure, sponsor pressure, sometimes fan pressure, social media pressure.\n\n“Athletes and coaches aren’t really trained in these theories. They may not even know what human rights are, really. It’s very difficult for them to choose, and it’s easy to convince them that it’s a bit too complex, when most often it’s simple.”\n\nFoster says that although he was involved in a range of political issues in Australia during his playing days, he had not been given much guidance in these areas and believes players and coaches should have more support to understand matters outside of football. That lack of certainty on a topic is one reason football figures might choose not to engage.\n\n“It’s entirely reasonable for (managers) to want to talk about where they are most proficient and their topic of expertise,” says Paul McCarthy, founder of sports PR firm Macca Media.\n\n“The pressure they have to work under, that intensity of scrutiny… they don’t want to give away any weaknesses. I can understand that. If they’re not entirely confident of speaking outside of the prism of football, then why expose yourself? But that doesn’t make them any less of a person. It doesn’t make their views any less valid.”\n\nAside from concerns over whether they feel equipped to do so, there are numerous other considerations.\n\nPR consultant Kelly Hogarth represents footballers such as England international Raheem Sterling (a prominent voice on racism in football) and Tottenham Hotspur’s Netherlands forward Xavi Simons. She also worked with Marcus Rashford, the England striker now on loan from Manchester United to Barcelona, during his campaign on child food poverty in the UK.\n\n“When a client does want to speak publicly, my role is not to discourage them, but to educate them on potential outcomes and ensure their message is delivered exactly as intended,” Hogarth tells The Athletic. Those consequences can be legal, commercial and emotional.\n\n“As an employee of a club, footballers are legally contracted as representatives (governors of the brand). With that comes legal obligations that restrict them from bringing the club or its commercial interests into disrepute.\n\n“Beyond clubs, top players often have commercial portfolios, which come with similar contractual expectations. As a ‘partner’, you are expected to align with and represent the brand’s position, values, and messaging — any public challenge of this could be grounds for termination.”\n\nFoster believes those who can bear the “cost” of speaking out should do so. He points to the example of David Beckham, who was criticised for acting as an ambassador for the 2022 men’s World Cup hosted by Qatar despite having long been considered an ally of the LGBTQ+ community. Same-sex relationships are illegal in Qatar.\n\n“That’s inconsistency, and that’s what I would like to see people in sport avoid,” Foster says.\n\n“If David Beckham had said, ‘I feel strongly about LGBTI rights. I support the World Cup being in Qatar and I’m going to go and be an ambassador, but I also want to let the government there, and all Qataris, know that I really support all the LGBTI community and I think they should all have rights around the world’, the Qatari government wasn’t going to sack him as an ambassador. He has too much social capital. His brand is too valuable.”\n\nThe difficulties of balancing being vocal with legal and commercial commitments are clear with Guardiola, as City are owned by a member of the Abu Dhabi royal family — a state that has been asked human rights questions itself.\n\nOther than commercial and legal considerations, speaking on issues outside of football can also take a personal toll.\n\nMcCarthy and Hogarth both point out the abuse that can follow; Hogarth says she always advises clients to take time away from social media after a statement and also highlights the danger of being “pigeonholed”, particularly for Black players talking about racism.\n\n“Just look at Raheem and the media discourse around him from 2018 onwards,” Hogarth says. “The more Raheem spoke out, the more he was repeatedly and, at times, insensitively asked to relive his experiences of discrimination. More recently, we’ve seen a similar pattern with (Real Madrid’s Brazil international forward) Vinicius Junior, who has been confronted with repeated questioning about racial abuse during press conferences.\n\n“In these cases, advocacy and solidifying your public position come with significant emotional burden, and that weight must be carefully considered when supporting a client.”\n\nBut speaking out can also bring benefits.\n\n“We work through a range of potential outcomes following delivery of a statement,” Hogarth says. “Loss of commercial partners, club fines, or negative social media sentiment, but also the possible upside of such a position — (like) new commercial opportunities, enhanced media and public interest.”\n\nIn the saturated football market, players taking a stance on a social issue can help them stand out and increase partnership appetite, Hogarth explains, as well as enabling players to broaden their audience.\n\nFor instance, she recently worked on an Alzheimer’s awareness piece with Simons — which allowed fans “to connect not just with ‘Simons the footballer’, but ‘Xavi the man’”.\n\n“We tend to see football managers in a fairly one-dimensional form. Which is unfair, because I’ve met hundreds of managers and I find them absolutely fascinating,” McCarthy says. “They’ve got a greater depth of insight into the way individuals work within a team, the team dynamic, the team collective. They have a great deal of empathy, perhaps more than the normal man in the street.\n\n“They have to be a part-time social worker, a part-time psychologist, a part-time communicator, an inspiration, and they also have to make the hardest decisions on people’s careers. To view them just through the prism of football is doing them a disservice.”",
  "paragraph_count": 36
}