{
  "url": "https://www.nytimes.com/athletic/7029516/2026/02/07/team-gb-skeleton-helmets-ban-winter-olympics/",
  "scraped_at": "2026-02-08T04:06:58.798794",
  "title": "Team GB loses CAS appeal against skeleton helmet ban for Winter Olympics",
  "author": "",
  "published_date": "Feb. 8, 2026Updated 4:02 am GMT+8",
  "content": "The Team GB skeleton helmets will remain banned at the 2026 Milano Cortina Winter Olympic Games after the Court of Arbitration for Sport dismissed an appeal against the ruling from the British Bobsleigh & Skeleton Association.\n\nThe Athletic reported this week that the BBSA had asked CAS to overturn the International Bobsleigh and Skeleton Federation’s decision to ban the new helmets. The IBSF had said that based on its overall shape and design, the helmet incorporates “prohibited spoilers (attachments), protruding edges or aerodynamic elements”.\n\nIn a statement released on Saturday, a CAS Ad Hoc Division panel confirmed it did indeed depart from the “standard shape” and “reflects a novel design specifically developed to enhance aerodynamic performance where the rear considerably protrudes”. The panel ruled that the BBSA did not “sufficiently establish” that the helmet met the IBSF rules for the Games.\n\n“Based on the strength of the case we put forward, naturally we are disappointed in today’s decision,” executive performance director and skeleton & bobsleigh Olympic team leader Natalie Dunman said.\n\n“However, this does not affect our final preparations and nor has the discourse affected the athletes’ focus or optimism going into the Games. Our athletes have been winning medals all season and throughout the Olympic cycle in their current helmets and we remain in a strong position to continue that trend.”\n\nTeam GB have five sliders — Matt Weston, Marcus Wyatt, Tabitha Stoecker, Freya Tarbit and Amelia Coltman — competing in this month’s Olympics, where competition begins on February 12.\n\nNo nation has won more Olympic medals in the high-speed event than Great Britain and Northern Ireland’s nine, and the British team has returned with at least one medal at every Games where the sport has featured, with the exception of Beijing 2022.\n\nAnalysis by Matt Slater\n\nThere are two ways of looking at this.\n\nThe first is to say “nothing ventured, nothing gained”. This is sport’s sharpest end. Of course, the top teams in any event — particularly one decided by fractions of a second -—are going to push the boundaries of what is written in the rulebook.\n\nIt happens in F1, we have seen it with “fast” swimsuits, springy running shoes and Team GB’s famously “rounder” wheels in the London 2012 velodrome.\n\nBut the other is to ask “why risk the aggravation and uncertainty?” Matt Weston and Marcus Wyatt have won all seven World Cup races between them this season. They’re very, very good.\n\nCould this unsettle them? Could it give their opposition a lift? Maybe, maybe not. But did Team GB really need to try this? I don’t know.\n\nIf they claim a one-two in the men’s and pick up more medals in the mixed team and women’s events, nobody will remember this row.\n\nIf they come home with nothing…well, this will be the story. And that £5.8m in National Lottery funding will look like a very poor investment.",
  "paragraph_count": 15
}