{
  "url": "https://www.nytimes.com/athletic/7025464/2026/02/07/haaland-form-premier-league-man-city/",
  "scraped_at": "2026-02-07T16:09:27.522590",
  "title": "What’s going on with Erling Haaland?",
  "author": "",
  "published_date": "Feb. 7, 2026 1:11 pm GMT+8",
  "content": "“I’ve scored at Anfield in the Premier League, and you haven’t,” Erling Haaland was reminded by his dad, Alfie, recently. “And I’ve played the World Cup in the USA.”\n\n“I’m coming for you,” Erling laughed.\n\nThe two were on a golf day, filmed for the striker’s YouTube channel, and he did remind his father that he had, in fact, scored against Liverpool at Anfield in the Champions League — in 2019, during his year with Red Bull Salzburg.\n\nAnd, all being well, Haaland junior will represent Norway at the World Cup in the United States, Canada and Mexico this June and July, just like his father did in 1994 when the U.S. staged it alone; and on Sunday he will, presumably, have another crack at getting on the scoresheet at Anfield in his fourth visit there with Manchester City.\n\nCity have not won at Anfield with Haaland in their ranks. But then they have hardly won there, full stop — the record stands at one victory in 23 years, and that was during the behind-closed-doors Covid-19 season of 2020-21. His dad’s goal there came for Leeds United as they were beaten 3-1 in 1997, but it was always something that he reminded his son of before his Salzburg goal more than six years ago, and seemingly still does to this day, just with the Premier League caveat attached.\n\nHaaland will most likely be in the City line-up tomorrow but he has sat out two of their past four matches, after manager Pep Guardiola told Sky Sports ahead of the 2-0 home win against Wolves last month that his star striker needed to “clean his mind and body”.\n\nTwo weeks before that, Guardiola had wished for fellow forward Omar Marmoush to return from Africa Cup of Nations duty with Egypt due to Haaland being “exhausted”, and the big striker will head to Merseyside in patchy form, considering his consistently high standards.\n\nWhen Guardiola was asked about Haaland on Friday, he replied simply: “Erling is the best striker in the world.” Does that mean he will start against Liverpool then? “I don’t know. We’ll decide tomorrow. Always I say: Erling is the best.”\n\nA return of two goals in 12 games is, for Haaland, a drought. He has not had such a low-scoring return since he was a youngster in Norway, and his highs are so high that the lows do appear more stark. After all, he got 24 goals in his first 14 games this season for club and country in what has become a typically blistering start to a campaign from him.\n\nInterestingly, though, these mid-season struggles also appear to be characteristic, as you can see in the graph below.\n\nWhat it shows is a huge overperformance of his xG — another thing that has become the norm over the years — but then a sudden drop-off halfway through a season, with both goals and the chances coming his way taking a downturn.\n\nEven more interestingly, this was the exact pattern during his time at previous club Borussia Dortmund, too, suggesting that while the Premier League’s gruelling winter schedule could be one factor in his recent struggles — allowing for what Guardiola termed exhaustion — the Bundesliga’s post-Christmas break would imply other factors are likely to have a big influence.\n\nHere are some examples from previously high-scoring Premier League stars Mohamed Salah and Harry Kane, who at times showed similar patterns, but not quite with the same consistency.\n\nIt was around this time two years ago — February 20, 2024 — that Guardiola felt the need to defend Haaland after a run of two goals, both scored against Everton, in seven matches.\n\n“With top scorers or strikers who score a lot of goals, don’t criticise, because he will shut your mouth, that’s for sure,” Guardiola said. “Sooner or later, he is there.”\n\nGuardiola said similar this January and also warded off any hint of criticism of Haaland when asked about his lack of goals from open play at that point. “God bless, we have Erling in our team right now,” he said. “We are fortunate to have him. Without him, we would not be in the position we are right now.”\n\nIndeed, across City’s first 13 games of the season in all competitions, he had scored 17 of their 26 goals, a staggering 65 per cent. Suddenly leading a young squad still finding its feet, Haaland became by far the most important player at the club, with few others looking capable of scoring or performing their own role on the pitch anywhere near as consistently.\n\nAnd while the goals have dried up recently, there is a fairly straightforward statistical explanation: between the start of the season and Christmas Day, there was only one game where he did not get a big chance — against Leeds at the end of November.\n\nSince Christmas, he has started six games and not had a big chance in four of them.\n\nAcross the entire team, City’s big chances in this period have been harder to come by, too, suggesting a creativity problem, and that tallies with a clear drop-off in the form of players including Phil Foden and Tijjani Reijnders, who had started to take the scoring burden off Haaland at the back end of 2025.\n\nThat said, he has only scored one of the three big chances that have come his way in recent weeks, and he has cut the same frustrated figure that he has done in seasons gone by when goals have become harder to come by.\n\nInterestingly, Pep Lijnders, Guardiola’s assistant, perhaps gave an insight into this reduced output of late.\n\nSpeaking last week, the Dutchman praised Haaland’s clipped finish against Galatasaray on January 28 which represented his first open-play goal since December 20, and added, with a laugh: “But we need him in good spirits, in good spirits, as (with) all our forward players, because only when you smile and laugh can you score these goals.”\n\nIf there have been times when Haaland’s body language on the pitch has not been ideal — something also highlighted by Guardiola in February 2024 — it has not been an issue away from matches. Sources say he reacted well to being benched against Wolves, and those close to him say he has been his usual straight-laced and happy self.\n\nHaaland was named part of City’s captaincy group by Guardiola, sources say, partly because he wanted the striker to take on more responsibility around the club. Always considered a good team-mate anyway, the manager wanted him to also think even more about the group — part of his development as a player and person.\n\nThat has become increasingly important as legendary figures such as Ederson, Kyle Walker, Ilkay Gundogan and Kevin De Bruyne have left the club, suddenly making Haaland one of their most senior players and one of few remaining links to City’s all-conquering sides of the recent past.\n\n“In the last game against Spurs, just three players had all the process,” Guardiola said this week. “We’re talking about that every single day. The other ones need, I think, a little more time.”\n\nHe presumably meant Rodri, Bernardo Silva and Haaland, because of the other starters, only Matheus Nunes had been in Guardiola’s first team before the start of last season, and even he has only been playing in his current position, right-back, for a year.\n\nThe story of City’s 2025-26 season to date is that they have an almost completely new team and are adapting to a Premier League that has become increasingly about how to cope with high pressing and duels.\n\n“It’s all about how to outplay that moment of high pressure,” Lijnders said last week. “That has changed a lot. When that comes, you see us attack quicker in moments because when you get out of that press, the pitch is completely open.”\n\nThat change in City’s approach, which was especially evident at the start of the season, suits Haaland down to the ground. For a period in November, City were beating teams on the counter-attack and having less possession, the kind of thing that probably suits the Norwegian best, but has never been the case previously at the Etihad Stadium.\n\nThat said, he hardly struggled when City were all about patient passing — or rather, he still scored loads of goals at the start of those seasons and then slowed down in the middle of them.\n\nAs much as City have been more direct at times in the current campaign, they have curiously tended to play long balls up to the front line on the rare occasions that Haaland has not actually been on the pitch. At the Bernabeu in December, for example, where he scored twice against Real Madrid in the Champions League, they first played the ball long a couple of minutes after he had been substituted.\n\nThere are still times when he makes runs that are ignored — as has always been the case — but his own movement has been criticised at times, if only by frustrated supporters who suggest he stays at the back post too often. Data from SkillCorner shows that of Premier League centre-forwards to have made 200+ off-ball runs this season, Haaland receives the smallest share of passes for his efforts (13 per cent).\n\nWhen Jeremy Doku was asked about his link-up with Haaland recently, though, that did not seem to be on the City winger’s mind: “Sometimes he’s second post, sometimes he’s first post, I remember against Dortmund, he was more on the 16-yard (spot) when I passed the ball to him, so it depends, I feel like it’s not something… obviously there is a conversation for sure, but it’s not something that is always like this, it changes, it depends also on the opponent and we adapt.”\n\nIn the past three games, even given City’s up and down form, they have seemed to find Haaland well at times: his goal against Galatasaray last Wednesday came after Doku picked up possession deep, beat pressure and played a fine through ball behind the defence. He was also picked out by Rodri with a high ball over the Tottenham defence last Sunday, though he put that attempted finish on the roof of the net.\n\nHe also did not score when he came off the bench against Newcastle on Wednesday in the second leg of a Carabao Cup semi-final but that was due to Aaron Ramsdale’s two fine saves from well-struck efforts, rather than the kind of inexplicable misses that stand out even more when they are not atoned for soon after.\n\nHaaland will surely start at Anfield on Sunday — Guardiola said he was looking physically good after that draw with Spurs — but he does have competition for his place, with Marmoush scoring three times in five matches since his return from AFCON and Antoine Semenyo netting four in six since he signed from Bournemouth last month.\n\nBoth of them could do with being more consistent in their other contributions but, even so, they have probably offered City more than Haaland in that regard of late.\n\nEven at Haaland’s sparkling best, he has not found it easy in matches at Anfield, but with City and Liverpool both playing attacking but flawed football right now, there could be more chances than usual tomorrow as he aims to match one of his father’s proudest footballing moments.",
  "paragraph_count": 40
}