{
  "url": "https://www.nytimes.com/athletic/7024005/2026/02/06/oxlade-chamberlain-celtic-transfer-medical/",
  "scraped_at": "2026-02-07T00:16:19.438568",
  "title": "Alex Oxlade-Chamberlain set for Celtic medical, Martin O’Neill confirms",
  "author": "",
  "published_date": "Feb. 6, 2026Updated 11:43 pm GMT+8",
  "content": "Former Arsenal and Liverpool midfielder Alex Oxlade-Chamberlain has agreed to join Celtic on a short-term deal.\n\nCeltic manager Martin O’Neill confirmed on Friday that Oxlade-Chamberlain will undergo a medical on Saturday before signing for the Scottish champions.\n\nSources with knowledge of the deal, speaking on the condition of anonymity to protect relationships, indicated the move would be on a short-term contract until the end of the season, with the option to extend through to 2027.\n\nOxlade-Chamberlain, 32, has been a free agent since leaving Besiktas in August, and has been training with his former club Arsenal since November. In an interview with The Athletic in December, the midfielder said: “I want to play. I don’t feel old. I’m fit, and I’ve still got that hunger.”\n\nO’Neill told a press conference on Friday: “I spoke to him this morning. I think he wants to come and and I think he’s coming.\n\n“I would have assumed he’s gotten a number of options. I think there was even talk about Arsenal, where he is training, might take him on because they might pick up a couple of injuries, so I’m delighted that he’s going to come, so he says.\n\n“So I think he’s doing a medical tomorrow and all being well, I’m hoping that he signs on.”\n\nO’Neill added Oxlade-Chamberlain was “here to try and play” and to “get as fit as possible as quickly as possible”.\n\n“I think it would be nice to have him here with the squad just for at least these couple of months,” he said.\n\nAsked how he had convinced the 35-time England international to join, O’Neill replied: “I think the football club itself probably has convinced him more than anything else, if indeed it is convincing.\n\n“We might be having this conversation in 36 hours, and he might come up here, see what the weather’s like and disappear back down again, quite easily. There’s a few who have done that in the past.”\n\nThe Celtic manager had talked about the possibility of Oxlade-Chamberlain moving to the club on Tuesday, explaining he had already spoken to the player.\n\nThe Southampton academy product departed Liverpool following the conclusion of his contract in the summer of 2023 and moved to Besiktas, where he made 50 appearances.\n\nHe won the Premier League, Champions League and FA Cup with Liverpool after joining from Arsenal in 2017.\n\nOxlade-Chamberlain also won the FA Cup three times with Arsenal across a six-year spell with the north London club. On Monday, Arsenal manager Mikel Arteta was asked about the possibility of Oxlade-Chamberlain being offered a contract following Mikel Merino’s injury, to which he replied: “We explore every option.”\n\nCeltic have won the Scottish Premiership four seasons in a row but sit third this term behind Hearts and Rangers.\n\nIn January, O’Neill returned to the club for his a second interim spell in charge this season following the dismissal of Wilfried Nancy after just 33 days in charge.",
  "paragraph_count": 17
}