{
  "url": "https://www.nytimes.com/athletic/7024688/2026/02/05/ski-jump-penis-enhancement-wada/",
  "scraped_at": "2026-02-06T02:20:18.105392",
  "title": "Are ski jumpers enhancing their penises to fly further? WADA is ready to investigate",
  "author": "",
  "published_date": "Feb. 6, 2026 1:47 am GMT+8",
  "content": "The Winter Olympics has long been a battleground for marginal gains. Just look at the International Bobsleigh and Skeleton Federation (IBSF) banning the new helmets Great Britain had planned to wear next week due to their aerodynamic ridges.\n\nThursday, however, took things to a new level in Milan Cortina — ski jumpers allegedly injecting their penises with hyaluronic acid in order to fly that little bit further.\n\nThe claims were originally reported in German newspaper Bild, in January on the eve of the latest Winter Olympics beginning in Italy and subsequently addressed by the World Anti-Doping Agency (WADA) president Witold Banka during a press conference.\n\nSo far, so lurid, but there is science behind the allegations. Injecting the penis with acid would increase its size and give the ski jumpers bigger genitalia at the point their suits are measured by 3D scanners.\n\nTemporarily enhanced measurements would theoretically mean athletes being given a bigger, looser suit and, like a sail catching wind, could allow them to make longer jumps. Research from the scientific journal, Frontiers, published last October said that a 2cm change in a suit represented an extra 5.8 metres in the length of a jump.\n\nBild quoted Dr Kamran Karim, a senior consultant at Maria-Hilf Hospital in Krefeld, as saying: “It is possible to achieve a temporary, visual thickening of the penis by injecting paraffin or hyaluronic acid.”\n\nNo specific athletes have been accused of the practice but WADA has vowed to investigate if it is presented with evidence of wrongdoing.\n\nIncluded in their powers, typically reserved for tackling the use of performance enhancing drugs, is the ability to ban substances that go against the “spirit of sport.”\n\n“I’m not aware of the details of ski jumping and how it can improve but if anything was to come to the surface we would look at anything if it is actually doping related,” said Oliver Niggli, director general of WADA, when asked about the allegations at a press conference on Thursday.\n\n“We don’t do other means of enhancing performance but our list committee would certainly look into whether this would fall into this category. But I haven’t heard about that until you mentioned.”\n\nWADA president Witold Banka told the same news conference: “Ski jumping is very popular in Poland (his home country) so I promise you I’m going to look at it,” he said.\n\nBoth Banka and Niggli seemed more amused and confused than outraged by the suggestions of improper practice, but Bild’s claims come at a challenging moment for ski jumping.\n\nEighteen-month bans were handed out to two disgraced coaches and an equipment manager of Norway’s ski jumping team on January 15 after it was found they had manipulated the suits of the team’s best jumpers in order to gain an advantage.\n\nMarius Lindvik and Johann Andre Forfang, two previous Olympic medalists, escaped with three-month bans after claiming they had been unaware of the scandal that had taken placed at the Nordic World Ski Championships in Trondheim, Norway the previous year.\n\nA whistleblower had filmed the head coach Magnus Brevig and Adrian Livelten, the team’s suit technician, inserting illegal stitching into the crotch area following a previous inspection by officials. The changes that amounted to cheating were filmed behind a curtain and uploaded anonymously to YouTube. They served to make the suits larger and more aerodynamic, thus enabling greater jumps in competition.",
  "paragraph_count": 15
}