{
  "url": "https://www.nytimes.com/athletic/7027580/2026/02/06/harvey-elliott-aston-villa-liverpool-loan-change-emery/",
  "scraped_at": "2026-02-07T08:24:37.721481",
  "title": "Aston Villa’s Unai Emery asks Liverpool to change Harvey Elliott loan terms",
  "author": "",
  "published_date": "Feb. 7, 2026 6:30 am GMT+8",
  "content": "Aston Villa manager Unai Emery has appealed to Liverpool to change the terms of Harvey Elliott’s loan after admitting the current situation is “damaging” the 22-year-old.\n\nLast month, Emery acknowledged there was a reluctance for Elliott to play more games, with the Liverpool loanee needing to play 10 matches in order for Villa to trigger the obligation to buy him.\n\nVilla sources, speaking on the condition of anonymity, insisted the fee was closer to £30million ($41.3m), while Liverpool said it was £35m ($48.2m). Elliott has played five times this season, but had not featured in a matchday squad, prior to Villa’s trip to Newcastle on Sunday, since November.\n\nThe Athletic reported on deadline day that the former England Under-21 international would be staying at Villa, despite no progress being made on changing the terms of the existing agreement. If Villa wished to end the loan, they would have to pay a termination fee, while Liverpool did not want to recall Elliott during the transfer window. Both teams can agree to a change in loan terms outside of the window.\n\nEmery acknowledged that the current situation on Friday — with Elliott only able to play three more games before Villa’s obligation is triggered — “is not fair” on the midfielder.\n\n“I spoke with him,” said Emery ahead of Villa’s trip to Bournemouth. “We have been fair because there are two ways. One way is a sport, the second is business. We’ll be fair in case, because we are trying it. I spoke a few times with Harvey.\n\n“Harvey, now I am opening the door to play with us, because he can help us. But it’s not only on my side. The other side is Liverpool. If they are taking off the clauses, they have to play matches and to buy him compulsory. (I said to him) ‘You are going to play here with us, it’s a sport decision.’\n\n“But now it’s a sport decision and a business decision. My sport decision is still there — ‘you are deserving to play, we need your qualities in the field, you are going to play’. But in this case, the clauses are still there and now it is Liverpool, they have the key. And I told him it will be fair for him for Liverpool to take off this clause.”\n\nEmery opened up on Villa’s efforts to change the terms and remove the 10-game threshold, which he said had been discussed more than three months ago. There remains no breakthrough in talks, however, with Liverpool and Villa battling it out for a Champions League spot.\n\n“We are speaking about it (taking off the clause) but not now,” the Spaniard added. “We started speaking about it three months ago. The transfer window finished on Monday. It will be fair for him, because he’s a calm guy, a good guy, and he’s a fantastic professional. And his qualities are there.\n\n“Of course, he must play, and he’s really being passionate. And I know we are damaging him, because we got a deal with Liverpool in the summer and the deal is there, and we are taking the decision responsibly from my side.”\n\nSince returning to the matchday squad away to Newcastle United a fortnight ago after being absent for three months, Elliott has featured in the previous two matches. This has been partly influenced by Villa’s depleted midfield options, with Boubacar Kamara, Youri Tielemans and John McGinn all unavailable.\n\nVilla sit third in the Premier League, six points ahead of fifth-placed Chelsea.",
  "paragraph_count": 13
}