{
  "url": "https://www.nytimes.com/athletic/7027712/2026/02/06/sonia-bompastor-chelsea-women-contract-extension/",
  "scraped_at": "2026-02-07T04:09:59.767707",
  "title": "Chelsea head coach Sonia Bompastor agrees contract extension to 2030",
  "author": "",
  "published_date": "Feb. 7, 2026Updated 3:42 am GMT+8",
  "content": "Sonia Bompastor has agreed a contract extension with Chelsea Women to extend her deal to 2030 despite their recent dip in form.\n\nThe 43-year-old had been on terms until 2028 after joining in 2024.\n\nThe Athletic reported this week that Bompastor had retained the backing and support of the club after their 5-1 defeat to title-rivals Manchester City in the Women’s Super League on Sunday. It marked their first time losing consecutive WSL matches since 2015.\n\n“I’m really confident in terms of someone who is really honest,” the head coach had said when asked about her job security. “I’ll be happy to go if they think that’s the right thing.\n\n“But I will never give up. I know football, sometimes it happens, you can be in this situation. I always fight. But again, the institution of Chelsea is a lot more important than myself.”\n\nBompastor joined at Chelsea in 2024, taking over from now-United States Women’s National Team coach Emma Hayes. In her first season at the club, she won the league with a record-high WSL points tally of 60 (from 22 games) and until December they had been on the longest unbeaten run in league history at 34 matches. It was their sixth league title in a row.\n\n“I am delighted to extend my stay here,” Bompastor said on the club’s website. “I want to thank the club for their unwavering support and the trust they have shown in me. It’s a privilege to lead this team and I could not be prouder to represent Chelsea.\n\n“Our success as a team is built on grit, resilience and intensity and we do not settle for anything less than winning. We have so much left to fight for, we are competing on four fronts, and we will give everything, every single day to make our supporters proud. My focus is firmly on bringing more success to this amazing club.”\n\nThis season, however, they sit in third and 12 points behind leaders Man City after losing to them and third-placed Arsenal on the trot. Chelsea have had to contend with injuries to key players which has impacted consistency; including to Aggie Beever-Jones, Catarina Macario, Mayra Ramirez, Niamh Charles, Keira Walsh, Nathalie Bjorn, Hannah Hampton, Lucy Bronze and Kadeisha Buchanan.\n\nBefore joining Chelsea, Bompastor won three Division 1 Feminine title with OL Lyonnes in as many seasons in charge.",
  "paragraph_count": 10
}