{
  "url": "https://www.nytimes.com/athletic/7026457/2026/02/06/cristiano-ronaldo-not-playing-saudi/",
  "scraped_at": "2026-02-06T16:14:40.367061",
  "title": "Cristiano Ronaldo told ‘nobody makes decisions beyond their club’ by Saudi league after Al Nassr absence",
  "author": "",
  "published_date": "Feb. 6, 2026 4:09 pm GMT+8",
  "content": "The Saudi Pro League has told Cristiano Ronaldo “no individual — however significant — determines decisions beyond their own club” after his future at Al Nassr has come into focus.\n\nRonaldo, 41, is paid more than £175million a year by Al Nassr, but was left out of the squad for their win over Al Riyadh on Monday night amid a dispute over how the club is being run, and there are also doubts over whether he will play against Al Ittihad on Friday.\n\nSaudi Arabia’s Public Investment Fund (PIF) are the majority shareholders at Al Nassr, owning 75 per cent of the club, but they also have the same stakes in Al Hilal, Al Ittihad and Al Ahli.\n\nAnd the former Manchester United and Real Madrid player — who had a €50m release clause inserted in the new two-year contract he signed in June — feels let down because he believes Al Nassr’s hierarchy did not suitably strengthen the squad during the January transfer window.\n\nAl Nassr only signed Abdullah Al-Hamdan, a Saudi Arabia international centre-forward, from Al Hilal, and Haydeer Abdulkareem, an Iraqi midfielder, from Al Zawraa SC.\n\nHowever, Al Hilal, who are Al Nassr’s biggest rivals for the title, added Karim Benzema, Ronaldo’s former team-mate at Real Madrid, from Al Ittihad.\n\nAnd the 38-year-old striker made an immediate impact for his new side by scoring a hat-trick on his debut against Al Akhdoud on Thursday to help extend Al Hilal’s lead over Al Nassr at the top of the Saudi Pro League (SPL) to four points.\n\nThe SPL issued a statement on Thursday to inform Ronaldo that the clubs are run independently and responsible for managing their own finances.\n\n“The Saudi Pro League is structured around a simple principle: every club operates independently under the same rules,” a Saudi Pro League spokesperson said.\n\n“Clubs have their own boards, their own executives and their own football leadership. Decisions on recruitment, spending and strategy sit with those clubs, within a financial framework designed to ensure sustainability and competitive balance. That framework applies equally across the league.\n\n“Cristiano has been fully engaged with Al Nassr since his arrival and has played an important role in the club’s growth and ambition. Like any elite competitor, he wants to win. But no individual – however significant – determines decisions beyond their own club.\n\n“Recent transfer activity demonstrates that independence clearly. One club strengthened in a particular way. Another chose a different approach. Those were club decisions, taken within approved financial parameters.”\n\nAs reported by The Athletic on Thursday, Ronaldo’s protestations do not solely stem from Al Hilal signing Benzema.\n\nThe 41-year-old wants every club to be treated equally to help the integrity and fairness of the SPL as a competition.\n\n“The competitiveness of the league speaks for itself,” the league spokesperson added.\n\n“With only a few points separating the top four, the title race is very much alive. That level of balance reflects a system that is working as intended.\n\n“The focus remains on football — on the pitch, where it belongs — and on maintaining a credible, competitive competition for players and fans.”",
  "paragraph_count": 17
}