{
  "url": "https://www.nytimes.com/athletic/7024739/2026/02/06/cristiano-ronaldo-al-nassr-dispute/",
  "scraped_at": "2026-02-07T02:17:49.681897",
  "title": "Cristiano Ronaldo misses second consecutive Al Nassr game",
  "author": "",
  "published_date": "Feb. 7, 2026Updated 1:42 am GMT+8",
  "content": "Cristiano Ronaldo has been left out of a second consecutive Al Nassr game after not being including in Friday’s matchday squad to face Al Ittihad.\n\nThe Athletic reported on Thursday that the 41-year-old was not included in the squad for the 1-0 win over Al Riyadh on Monday following a disagreement over how the club is being managed. Al Nassr, alongside Al Ittihad, Al Ahli and Al Hilal, are majority-owned by Saudi Arabia’s Public Investment Fund (PIF), which has a 75 per cent stake in each club.\n\nOn Friday, however, the Saudi Pro League told the forward “no individual — however significant — determines decisions beyond their own club” and each club is run “independently”.\n\nRonaldo was left feeling let down by Al Nassr’s hierarchy after what he perceives a failure to strengthen the squad during the winter transfer window. The club signed Saudi Arabia international Abdullah Al-Hamdan from Al Hilal and Iraqi midfielder Haydeer Abdulkareem from Al-Zawraa SC. Meanwhile, Ronaldo’s former Real Madrid team-mate Karim Benzema left Al Ittihad to join Al Hilal.\n\nWith Al Nassr third in the table and only four points behind leaders Al Hilal, Ronaldo feels the level of ambition differs between the PIF clubs and his side have not matched the intent of the other clubs.\n\nAl Nassr sources, speaking on the condition of anonymity, said “it’s totally impossible to predict” what will happen next with Ronaldo.\n\nSources briefed on the situation added that Ronaldo’s sentiments do not stem solely from the Benzema transfer and that he believes that the club is not being supported operationally and financially. The 41-year-old also wants every club to be treated equally to help the integrity and fairness of the SPL as a competition.\n\nRonaldo joined Al Nassr at the end of December 2022 after leaving Manchester United. He signed a new two-year contract with the club in 2025 that pays him £175million ($240m) per year and has a release clause worth €50m (£44m, $60m).\n\nHe has scored 111 goals in 127 matches for Al Nassr though he has not yet Saudi Pro League title or the AFC Champions League.",
  "paragraph_count": 9
}