{
  "url": "https://www.nytimes.com/athletic/7026660/2026/02/06/ben-stokes-hit-face-hospital-durham-england/",
  "scraped_at": "2026-02-06T20:14:03.968719",
  "title": "England captain Ben Stokes left with facial injuries after being hit by Durham player’s shot",
  "author": "",
  "published_date": "Feb. 6, 2026 7:23 pm GMT+8",
  "content": "Ben Stokes had to be taken to hospital when a stray ball hit during a Durham academy coaching session struck him in the face.\n\nThe England Test captain was helping out during the session in the indoor nets at Durham’s Chester-le-Street ground when a fierce drive from academy player Robbie Bowman hit him on the side of his face.\n\nStokes later posted a picture on Instagram showing a blackened and closed right eye, abrasions to his cheek and mouth and a dressing sticking out of his nose. It was captioned: “You should see the state of the cricket ball!” with a laughing face emoji.\n\nDespite his injuries, Stokes called the 18-year-old wicketkeeper-batter from hospital to assure him the accident was not his fault, before returning to his home in county Durham to recover from his injuries on Thursday.\n\n“I’ll tell you this because Stokesy never would — he phoned Robbie Bowman from hospital and told him not to worry,” Durham coach Ryan Campbell told The Sun. “He’d have known that Robbie would have been beside himself, but Ben said it was his fault. That sums up the sort of bloke Stokesy is.”\n\nThe England captain has been coaching part-time in the Durham academy while recovering from the groin injury he suffered during the final Test of England’s 4-1 Ashes defeat in Australia.\n\nHe is due to fly to the UAE later this month to join the Lions coaching staff under head coach Andrew Flintoff for a series of white-ball matches against Pakistan.\n\nStokes has already started batting again after his latest injury setback and is expected to play several County Championship matches for Durham ahead of England’s first Test of the summer against New Zealand at Lord’s on June 4.\n\n“Stokesy said he broke the No. 1 rule of being a coach in the nets — never turn your back on the batter,” Campbell added. “By chance our medical team were at the ground doing simulations. Suddenly they had a real emergency to deal with.\n\n“Robbie hit the ball hard. Players shouted out a warning but Stokesy ended up turning his head towards the ball.”\n\nBowman made four appearances for Durham in the Metro Bank One-Day Cup last summer and was a regular in the second team after signing a rookie contract in 2025.\n\nHe also plays club cricket for the same Tynemouth team that has featured Leeds’ former Newcastle midfielder Sean Longstaff.",
  "paragraph_count": 12
}