{
  "url": "https://www.nytimes.com/athletic/7024902/2026/02/05/fifpro-europe-uefa-voting-rights/",
  "scraped_at": "2026-02-06T04:10:29.024343",
  "title": "FIFPRO Europe set to be given UEFA ExCo voting rights",
  "author": "",
  "published_date": "Feb. 6, 2026Updated 3:06 am GMT+8",
  "content": "FIFPRO Europe, the continental division of FIFPRO, the world players’ union, is expected to be ratified as a voting member on UEFA’s Executive Committee at the European governing body’s annual congress on February 12.\n\nThis move comes more than two years after the two organisations signed a memorandum of understanding that would see FIFPRO Europe join the ExCo in an advisory capacity from May 2025.\n\nHowever, that relationship is now going one step further with FIFPRO Europe set to have a voting seat at the table.\n\nThis means the players’ voices will now be represented with a vote when decisions are being made on the calendar.\n\nFIFPRO Europe is comprised of 36 member unions across the continent — including the Professional Footballer’s Association (PFA) in England and the member unions in France, Germany, Spain and Italy — and represents more than 38,000 players.\n\nAlthough their voting rights need to be ratified, that is expected to be a formality at the UEFA Congress, which is being held in Brussels, Belgium.\n\nDavid Terrier, FIFPRO Europe’s president, is expected to be their representative on the ExCo.\n\nThe UEFA ExCo is headed by Aleksander Ceferin, UEFA’s president, and comprises of up to 19 other members, 16 of whom are elected by the UEFA Congress.\n\nTwo spots are taken by European Football Clubs (EFC), formerly known as the European Club Association, which is the independent body that represents more than 800 professional football clubs across Europe.\n\nThe EFC is chaired by Nasser Al-Khelaifi, the president of Paris Saint-Germain and chairman of Qatar Sports Investments.\n\nAnother spot on UEFA’s ExCo is reserved for the European Leagues, which serves as the leading representative of more than 40 professional football leagues in Europe.\n\nFIFPRO sources, speaking on the condition of anonymity to protect relationships, note how their expected ascension to become a voting member of the ExCo is a positive step in the right direction for players’ voices being heard.\n\nIt would give them a seat in the room when decisions are being made and is part of UEFA’s move towards its ExCo becoming more inclusive.",
  "paragraph_count": 13
}