{
  "url": "https://www.nytimes.com/athletic/7023845/2026/02/06/michael-carrick-mannchester-united-manager/",
  "scraped_at": "2026-02-06T18:16:35.070265",
  "title": "Inside Carrick’s Man Utd revolution: Holland’s ‘homework’, new matchday routines and a sense of calm",
  "author": "Andy Mitten",
  "published_date": "Feb. 6, 2026 3:45 pm GMT+8",
  "content": "Manchester United’s interim manager has long been on the premises, if not in the building.\n\nIn recent years Michael Carrick was a regular visitor at the club’s Carrington training ground, sitting unassumingly in his car for hours, waiting for his son Jacey, now 15, to finish training with United’s junior sides. Those staff who are still around — and many are not — from when Carrick left United in December 2021 after his previous interim spell in charge would say hello, but the man himself usually kept a low profile.\n\nNow, that’s impossible. At the helm until the end of the season, Carrick is subjected to the same scrutiny as every other manager of the biggest football clubs in the world. It doesn’t usually end well in the post-Sir Alex Ferguson era, but Carrick, like the most notable previous interim, his close friend Ole Gunnar Solskjaer, has enjoyed a superb start, winning his first three games against neighbours Manchester City, Premier League leaders Arsenal and in-form Fulham.\n\nAhead of tomorrow’s meeting with his former club Tottenham Hotspur, The Athletic has spoken to a range of United sources to understand how he has engineered such a remarkable turnaround.\n\nCarrick was appointed following a home FA Cup defeat by Brighton & Hove Albion on January 11. United fans were furious; with no European football, a cup run was needed in this season more than any other, and to many it felt like the campaign was already over.\n\nInternally at United, however, that was never the feeling. The target was always European qualification, a point made by director of football Jason Wilcox in interviews to the three interim managerial candidates — Solskjaer, Ruud van Nistelrooy and Carrick.\n\nWilcox is a calm figure amid the emotion that swirls around United after a win or defeat. He, too, came in for media criticism after being caught in the Amorim quarrel, but he stressed to the three candidates that United were joint sixth and only three points off Liverpool in fourth. All agreed that Europe was achievable.\n\nUltimately, United opted for Carrick, and the next question was which coaches to bring in around him. The club got this wrong with a previous interim, Ralf Rangnick, when Brexit restrictions and the offer of short-term contracts meant the German didn’t get the coaches he initially wanted.\n\nThis time, United were more fortunate. Steve Holland, a vastly experienced coach best known for his work with England and Chelsea, is from Greater Manchester and was out of work and living locally, as was Carrick.\n\nHolland had been a home and away United fan as a youngster, having attended his first game at home against Tranmere Rovers in 1976 (a 5-0 win) and whose childhood hero was Steve Coppell.\n\nHolland had been working as a UEFA technical analyst this season with Carrick and Solskjaer, and United feel that they’ve done well in getting Holland to join.\n\nJonathan Woodgate, who also joined the staff, was close to Carrick as the pair had worked together at Woodgate’s hometown club Middlesbrough. A former defender, his childhood hero was Gary Pallister, a Middlesbrough defender who later became a United stalwart.\n\nAhead of the City game, Carrick got to work straight away. It is not uncommon for a squad’s mood to lift after a managerial departure — change tends to be under tense circumstances, as it certainly was under Amorim — and Carrick found professionals who were ready to work for him, eager to impress and finish the season stronger.\n\nEach had their own motivations. Casemiro, for example, knew he was leaving and wanted to bow out on a higher note with United back in the Champions League — the reason he was bought in 2022. After a few games under Carrick, Casemiro — a footballer who has always placed a high value on the need to be respected — thanked him and said that he was feeling like a footballer again.\n\nOther senior starters have waxed lyrical about Carrick, his training and how he takes an interest in the younger footballers. Previous United managers have been so focused on the first team that youth teams have been an afterthought. Amorim, as The Athletic reported last month, only took in one youth game at Carrington and never watched a United academy team at a stadium.\n\nThat was never likely to be the case for Carrick — given his son is part of the youth system — and he has watched United’s under 21s play Sporting CP on January 20 at Leigh, and the under 18s in the FA Youth Cup at home to Derby County in the same week, alongside Wayne Rooney. He has also watched the under 18s at Carrington, with staff around the youth teams buoyed by the interest.\n\nCarrick has also benefited from the dressing room being a better place than a year ago. Amorim deserves some credit for that, but some of his decisions — notably not starting Kobbie Mainoo — now look like errors.\n\nThere are still egos, but Carrick has so far shown himself adept at handling them. It helps that he has Woodgate, a Spanish speaker, on his staff. His linguistic skills have been welcomed by the Spanish-speaking playing contingent, just as they were when Benni McCarthy assisted Erik ten Hag between 2022-24\n\nCarrick used his first meeting with the players to emphasise what it means to play for Manchester United, among other things. Players responded well to it. Some have felt hurt by the criticisms they have faced over the last 18 months, particularly Amorim’s remark that they were perceived as the “worst in United’s history”, and didn’t want to leave that legacy.\n\nTraining is much shorter under Carrick: it is usually finished by 1pm, though players are free to do extra work. Amorim often thought the solution to on-field struggles was more coaching, so the days under him were longer, although there were blocks of free time between meetings and gym work, then another before the start of the main training session.\n\nCarrick has kept things short, intense and sharp. If anyone needs treatment for an injury, they are expected to arrive early to get it. Wayne Rooney revealed on his BBC podcast that United stopped training early before the Arsenal game because the standard was too good. Carrick wanted it bottled up and saved for the game.\n\nCarrick has put his arm around those who’ve needed it, and offers clear explanations to individuals as to why they’re not starting. They trust his judgement, in part because he was a top-class midfielder himself, and because he is straight with them.\n\nThe same applies to Holland. Early on, he told United’s squad that he would be fair with all of them but that he expected hard work and anybody who didn’t fulfil their side of the bargain would be sent back inside. Players were also given ‘homework’ clips to study on their phones after one of the early sessions.\n\nThere has been more individual work, too, with coaches deployed to specific individuals. Young defenders Ayden Heaven and Leny Yoro have been working with experienced defender Woodgate and Jonny Evans, now back at the club and on the grass in a much-changed role after his short-lived job as loans manager. Heaven was in the first team around Christmas but, given the lack of games, might not play again this season. He needs to develop and United’s view is that he can do that in training.\n\nCarrick, who has more opportunity to have separate conversations with players as Holland is so prominent in training sessions, works with midfielders — as he did under Solskjaer before leaving in 2021 — while one of the roles of Travis Binnion, who had been coaching the under-21s, is working with younger players including Benjamin Sesko and Patrick Dorgu, who had a superb start to the year before his injury. Binnion is new to the first team squad but he has integrated himself well.\n\nThere have also been logistical tweaks to home matchday routines. Under Carrick, after players have had their pre-match meal and team meeting at Carrington, their departure on the team coach at Old Trafford has been pushed back 10-15 minutes to ensure more fans are gathered at the stadium when it arrives. Carrick wanted his players to feel the excitement of the fans right before they got ready, rather than hanging around longer.\n\nThings have changed after matches, too. Win, lose or draw, Amorim seldom spoke to his players post-games; Carrick does, even if he saves the detailed analysis for the days after the match, with some delivered individually, and the rest to the squad. That analysis team has seen some major changes in recent months — its lead, Paul Brand, left to join UEFA — but there is still a core that has been there for a prolonged spell, and they work closely with Holland. Carrick also embraces data.\n\nCarrick’s constant message to his players is that ‘this is only the start’. He has been in football long enough to know how the mood can flip and this is undoubtedly a honeymoon period.\n\nThe Fulham game last weekend, which saw United throw away a two-goal lead before winning in stoppage time, was a reminder that this team is a work in progress, even if it has benefited from senior players such as Harry Maguire and Lisandro Martinez returning from injury, plus the return of key men from AFCON.\n\nFor now, however, Carrick is doing everything asked of him and more. He has impressed observers with his sense of calm, his collaborative approach and the authority he has engendered. He doesn’t need to be managed by superiors as much as Amorim, a more volatile character, nor is he publicly dishing out rollockings. He has a low-key approach with the media, another contrast to Amorim, but while his public utterances are not animated, his football team has been.\n\nWho knows how long it will last? But for now, the new boss is flying and on target to take United into Europe next season. Reach that, and he will have succeeded; miss out, and he will have failed. Either way, nobody would dispute that everything he believes in and does is for the long-term well-being of the club.\n\nNot bad for a man who, when he played for United, said he would never become a football manager.",
  "paragraph_count": 32
}