{
  "url": "https://www.nytimes.com/athletic/7027347/2026/02/06/six-nations-adverts-in-game-itv/",
  "scraped_at": "2026-02-07T02:17:42.772986",
  "title": "ITV uses in-game adverts during Six Nations in UK first",
  "author": "",
  "published_date": "Feb. 7, 2026Updated 1:00 am GMT+8",
  "content": "ITV became the first British network to show in-game adverts during a sporting event in Thursday’s Six Nations game between France and Ireland.\n\nAdverts are regularly shown during half-time in sports such as football or rugby union, or in gaps in play in sports like during changeovers in tennis. They are also shown as during designated breaks before and after events, though a UK network has never broadcast ads while a game is ongoing.\n\nIn the opener of the 2026 men’s Six Nations — an annual international rugby union tournament between England, Scotland, Wales, Ireland, France and Italy — on Thursday, an advert for Samsung was displayed on the right side of the screen in the 17th minute, with France leading 7-0.\n\nThe game continued to be shown on the left side of the broadcast, though the players were preparing for a scrum with the clock stopped and the ball not in play. The advert lasted 20 seconds before the broadcast reverted to its full-screen picture of the match.\n\nAn advert for airline Virgin Atlantic was shown in the second half for the same amount of time.\n\nITV confirmed before the competition that it planned to show ads during the competition, citing the need to compensate for spending. ITV is sharing the Six Nations coverage with the BBC after agreeing a four-year deal to broadcast the tournament, as well as other competitions such as the inaugural editions of the Nations Championship in 2026 and 2026. Both networks are free-to-air, though the BBC does not permit paid advertising.\n\nFrance went on to defeat Ireland 36-14. Italy take on Scotland on Saturday while England face Wales.\n\nGiven the 2026 men’s World Cup, hosted by the United States, Canada and Mexico, will also be broadcast by ITV (once again alongside the BBC), you could be forgiven for thinking that in-game adverts may be used during that tournament too, which would also be a first.\n\nThe addition of three-minute hydration breaks during every game as a player-safety measure, could also provide a window for advertising should a broadcaster want to.\n\nHowever, ITV currently has no confirmed plans to use in-game ads in the same style during the World Cup, though the format is regularly used by U.S. broadcasters in the coverage of American sports.\n\nBefore the 2025 NFL season, it was confirmed that NFL RedZone, which broadcasts simultaneous live games in a “whip around fashion” and had famously never included commercials, would show ads in the “double-box” format.",
  "paragraph_count": 11
}