{
  "url": "https://www.nytimes.com/athletic/7021223/2026/02/05/james-rodriguez-minnesota-united-colombia-mls-signing/",
  "scraped_at": "2026-02-06T02:20:25.075100",
  "title": "James Rodríguez, Minnesota United finalizing deal to bring Colombian star to MLS: Sources",
  "author": "",
  "published_date": "Feb. 6, 2026 1:20 am GMT+8",
  "content": "Colombia national team captain James Rodríguez is finalizing a deal to sign with Minnesota United, sources briefed on the deal tell The Athletic. Talks between the MLS side and the former Real Madrid and Bayern Munich playmaker first emerged on Tuesday, and things have progressed since, with Rodríguez set to join the club on a non-designated-player deal, sources add. Rodríguez, 34, has been without a club since his one-year contract with Mexico’s Club León ended on December 31. He spent the month of January training on his own in Colombia.\n\nWhen he became a free agent, Rodríguez was linked to several clubs in MLS, Ecuador and Argentina over the past month. A potential opportunity to join Colombian side Millonarios, and star alongside Colombian striker Radamel Falcao, was ultimately ruled out by the Bogotá-based club’s president due to budget restrictions. Up until this week, Rodríguez was in danger of spending the first half of the year without competitive football, which would have jeopardized his match fitness during a World Cup year. Colombia is expected to make a deep run at the 2026 World Cup, and Rodríguez remains central to Colombia manager Nestor Lorenzo’s tactics.\n\nAfter Rodríguez won the Golden Boot as the 2014 World Cup’s top scorer, in which he led Colombia to its first quarterfinal berth, the then-23 year-old left-footed No. 10 was acquired by Real Madrid from Monaco for a transfer fee that surpassed $100 million. Two years prior while with FC Porto, Rodriguez was named Liga Portugal’s top player. He was Monaco’s player of the year in 2013-2014, an honor that followed up with his spectacular World Cup in Brazil.\n\nDespite a tumultuous end to his Real Madrid stint in 2017, Rodríguez left the Spanish giants after having been named to La Liga’s team of the season in 2014-2015, the same year he was named as the best midfielder in Spain’s top flight. He scored 37 goals and added 42 assists across all competitions at Real Madrid. The elite ball skills and technique were on display during his two-year loan spell with Bayern Munich from 2017-2019. Rodriguez was managed at the German club by Carlo Ancelotti, Jupp Heynckes and Niko Kovac. After some good spells under Ancelotti and Heynckes, Rodríguez’s playing time diminished under Kovac.\n\nHe was then reunited with Ancelotti when he signed with Everton on a free transfer in 2020. His 26 appearances for Everton would be his last stretch in a top five European league. A streak of disappointing spells with Qatari side Al-Rayyan, Olympiacos, Sao Paulo, Rayo Vallecano, and most recently Club León, have led to the cusp of this surprise move to Minnesota United. The 2025 season was a significant one for Minnesota. The club set regular-season records of 58 points and 16 wins under former head coach Eric Ramsay. Minnesota also reached the Western Conference semifinals for the second consecutive season. Ramsay, however, left the club in in January after accepting the head coach position at West Bromwich Albion.\n\nRodríguez is now set to join a Minnesota team, that’s led by Ramsay’s former assistant, Cameron Knowles. The tactical questions that have plagued Rodríguez’s club career as a throwback creative midfielder could be one of Knowles’ biggest challenges. At his peak, Rodríguez was a goal-scoring threat who could play effectively behind a center forward. His precision on the ball and creative flair made him one of global football’s most talented players.\n\nToday, Rodríguez tends to operate in a deep-lying midfield role. With Colombia and most recently with León, Rodríguez helps progress the ball from inside his own half, and still moves freely inside the opponent’s defensive third. His lack of top-level stamina and a recurring calf injury have limited his mobility, but he can still pop up around the opponent’s goal with well-timed runs. At his age, Rodríguez has also become more of a specialist. He has always been an strong penalty shot taker and a player who relishes the bright lights. Of his six assists during the 2024 Copa America, four came from a dead ball; two from corner kicks. That would figure to bode well for Minnesota, one of MLS’ most productive set-piece sides.\n\nKnowles, however, will be tasked with maximizing Rodríguez in what could be a short window of opportunity. Minnesota was pragmatic and defensive under Ramsay, which is not the best tactical fit for the Colombian. Rodríguez has become most useful on ball-dominant teams that can alter between possession and quick counter attacks.\n\nYet, Rodríguez has one singular objective in mind: to help Colombia progress beyond the quarterfinal stage at this summer’s World Cup. That may or may not align with Minnesota United’s 2026 ambitions.",
  "paragraph_count": 9
}