{
  "url": "https://www.nytimes.com/athletic/7026962/2026/02/06/jean-philippe-mateta-world-cup-injury/",
  "scraped_at": "2026-02-07T00:16:12.143293",
  "title": "Jean-Philippe Mateta weighing up surgery options with World Cup hopes, Oliver Glasner says",
  "author": "",
  "published_date": "Feb. 6, 2026Updated 11:58 pm GMT+8",
  "content": "Crystal Palace striker Jean-Philippe Mateta will make the final decision on whether to undergo surgery on a knee injury.\n\nA deal to sell the 28-year-old to AC Milan for a fee of around £30million fell through on transfer deadline day, with the Italian side pulling out partly due to concerns over his knee which were flagged during a medical.\n\nPalace manager Oliver Glasner says a call on whether to continue managing the problem or seek a longer-term solution will be taken by Mateta after a final medical opinion has been sought, with the striker’s hopes of making France’s World Cup squad this summer in the balance.\n\n“If you visit three doctors, you have three opinions,” Glasner said in his press conference before Sunday’s Premier League match with Brighton & Hove Albion. “This is what we have right now — one from English, Italian and French, and we get another one from German doctor JP trusted when he had knee surgery as a Mainz player.\n\n“He will see one more doctor on Monday and we all sit together and take a final decision. We can either manage it like we have been, but the most important thing is to say there is no risk, then we can manage the knee until after the World Cup. This is especially what JP is considering, his dream of playing for France at the World Cup, or he can undergo surgery.\n\n“Surgery could mean he’s out for two, three months or six to nine months.”\n\nMateta has been managing the problem since November, with Palace choosing not to risk him in their FA Cup third round defeat by Macclesfield in January due to their artificial pitch.\n\nGlasner said he believes Mateta, their top scorer with eight Premier League goals this season, will miss the next two games against Brighton and Burnley regardless of the surgery decision, but he would be able to reintegrate into the squad without any problem after his failed move.\n\n“It was not a big surprise that he could fail (the medical), we all considered and knew this could happen and he knew it,” Glasner said. “If you play for two and a half months with a swollen knee and have to be managed… we all knew there is an issue with his knee. He wasn’t pleased.”\n\nGlasner continued: “If he doesn’t undergo surgery and the knee is OK he will train with us and has to fight for his place in the team like everyone else, but he’s fine with it, he’s a great guy.\n\n“To deal with disappointment takes a few days. But I had a good talk with him and I’m pretty sure everything will be fine.”\n\nPalace signed three players during the winter window, breaking their transfer record twice in acquiring Brennan Johnson from Tottenham Hotspur for £35m and Jorgen Strand Larsen for an initial £43m from Wolverhampton Wanderers.\n\nThey failed to bring in a centre-back, however, having sold captain Marc Guehi to Manchester City for £20m, while they withdrew from a deal to sign Everton midfielder Dwight McNeil late on deadline day.\n\n“Everyone’s wish at the club would have been that JP gets what he wants, we get Jorgen and Dwight McNeil into the building and a Marc Guehi replacement,” Glasner said.\n\n“The club tried everything with huge bids out for a Marc Guehi replacement but the (other) club said ‘no we don’t sell on deadline day’.\n\n“Credit to the club that without getting money for JP they spent this big fee on Strand Larsen. McNeil was the last one we all expected we could finalise but the last minutes the terms of the deal changed again. I’m not really involved in the terms but this is what I was told.\n\n“I already planned for the next day’s training with him involved. One or two hours before he’s doing the medical, he should be our player, because we wanted to add a left footer in attack with great set plays.\n\n“But things changed and to get a deal done you need two clubs, the player and the agent. As soon as one of these four parties isn’t happy the deal can fail.”",
  "paragraph_count": 18
}