{
  "url": "https://www.nytimes.com/athletic/7024569/2026/02/05/leicester-points-deduction-psr/",
  "scraped_at": "2026-02-06T02:20:45.834524",
  "title": "Leicester get six-point deduction for breaching PSR – but financial woe set to continue",
  "author": "",
  "published_date": "Feb. 6, 2026Updated 1:59 am GMT+8",
  "content": "Leicester City have been given an immediate six-point deduction for breaching the English Football League’s profit and sustainability rules (PSR).\n\nThe sanction was handed down by an independent commission. An EFL statement on Thursday confirmed the news, with Leicester’s breach relating to the three-year period ending with the 2023-24 season.\n\nA Premier League statement explained the commission had determined Leicester had breached the PSR threshold by £20.8million ($28.2m) over the three-year assessment period. The written reasons of the independent commission, published by the Premier League, show the league had sought a 12-point deduction, while Leicester initially argued a fine was the most appropriate sanction.\n\nLeicester also argued the commission did not have the power to impose a points deduction in the EFL, which the commission disagreed with.\n\n“The appropriate sanction for such a serious breach is a sporting sanction (i.e., a deduction of points) and any lesser sanction — such as a fine — does not adequately fulfil the aims of the rules, is inconsistent with the scheme of the rules, and does not do justice to other clubs,” the commission said, referencing the deductions Everton received for PSR breaches in 2023 and 2024.\n\nLeicester described the sanction as “disproportionate” and said the club would be considering “next steps”.\n\nThe deduction leaves Leicester above the Championship relegation zone on only goal difference, with the managerless side level on points with 22nd-placed West Bromwich Albion and 23rd-placed Blackburn Rovers.\n\nThe commission also found Leicester to have been in breach of Premier League rules following a refusal to provide its annual accounts to the top flight by the deadline, and “dismissed a claim by the club that it had demonstrated exceptional cooperation throughout the proceedings”.\n\nA Leicester statement read: “It is with disappointment that Leicester City acknowledges the Independent Commission’s decision and the club will use the time available to consider its next steps.\n\n“While the commission’s findings significantly reduced the unprecedented scale of the sanction originally sought by the Premier League, the recommendation remains disproportionate and does not adequately reflect the mitigating factors presented, the importance of which cannot be overstated given the potential impact on our sporting ambitions this season.”\n\nLeicester were referred to an independent commission by the Premier League over a breach of the Championship’s PSR in May 2025.\n\nUnder the PSR, clubs are allowed to lose a maximum of £105m ($140m) over three seasons (or £35m a season) but certain costs can be deducted, such as investment in youth development, infrastructure, community and women’s football. Championship clubs, meanwhile, follow similar rules and are permitted to lose up to £39m over a three-season period (or £13m per season).\n\nAcross the accounting period the breach relates to, Leicester spent two seasons in the Premier League and one in the Championship, meaning they were permitted to lose a maximum of £83m. Leicester’s argument that their threshold should have been £105m was dismissed by the commission.\n\nThe club’s accounts, published in April 2025, stated they made a loss of £19.4million ($25.1m) in 2023-24. In the previous seasons, they recorded deficits of £89.5m (2022-23) and £92.5m (2021-22).\n\nAnalysis by football finance writer Chris Weatherspoon\n\nLeicester’s points deduction might long have felt inevitable yet that will be of little comfort to their fans. It has been a rapid, concerning fall from grace for a club which reached the semi-finals of the Conference League just four seasons ago.\n\nBack in 2016-17, Leicester were a Champions League club, turning a record £92.5m profit as they reached the quarter-finals of Europe’s premier competition. Since then, pre-tax losses have totalled £320.5m, £201.5m coming in the three-year period which ended in their 2023-24 promotion season. It is that huge sum which led to them being deducted six points on Thursday.\n\nLeicester’s PSR loss was lower, as rules allow clubs to deduct expenditure on ‘good’ items like infrastructure and the academy.\n\nYet even after further debate over what the loss figure was — Leicester extended their accounting period by a month in 2022-23, ostensibly to fit in more player sales and boost their PSR result, meaning the three seasons considered here had to be adjusted down from 37 months to 36, and also adopted a new accounting treatment around contingent transfer fees in 2023-24 — the club were still deemed to have recorded a PSR loss of £103.8m, 25 per cent higher than their £83m limit.\n\nThat Champions League venture generated record revenues of £233m at the King Power Stadium, but it is a sum Leicester have been unable to match since. Declining revenues combined with soaring wage costs shifted the club’s finances into a parlous state. In three of the past five seasons for which we have public figures (Leicester’s 2024-25 financials are yet to be published), the club’s wage bill exceeded revenue.\n\nLeicester were relegated in 2022-23 from the Premier League while spending £206m on staff costs, the seventh-highest wage bill in the division that year and the highest wage bill of a relegated side in English football history. That remains the case even if we adjust for that extended accounting period.\n\nWages dropped by 48 per cent as immediate promotion arrived a year later, but at £107m still formed the highest underlying wage bill in Championship history. It propelled Leicester back into the Premier League but ensured another loss, which has now contributed to a sporting sanction. Given the size of both the breach and their promotion wage bill, six points could be seen as lenient.\n\nEven so, it pushes Leicester further toward League One than the Premier League, away from a promotion which already appeared highly unlikely. The club’s parachute payment will drop by close to £10m in 2026-27. Money woes at the King Power are far from over.\n\nAnalysis from Rob Tanner\n\nLeicester knew a sanction was coming this season and many even feared it would be bigger than the six points they have received from the Premier League for breaching PSR for the 2023-24 Championship season.\n\nThey breached while bouncing back to the Premier League at the first attempt, following their shock relegation the season before, with the biggest budget in Championship history — a fact that didn’t go down well with the EFL and the Premier League at the time. But circumstances at the club are very different now.\n\nThe club have paid the price for chasing regular European qualification after finishing fifth twice and then eighth in the Premier League in the three preceding campaigns before their disastrous relegation campaign under Brendan Rodgers.\n\nThey spent big on contracts to try to keep pace with their rivals but recruited poorly and their swollen wage bill, which was the seventh-highest in the Premier League at the time of their relegation, has become a lead weight, dragging the club into PSR breach territory and restricting any further investment.\n\nThat weight could now drag them into League One for only the second time in the club’s history, just ten years after they completed their fairytale Premier League triumph while defying bookmakers odds of 5000-1 against them.\n\nThey still have time to escape but are currently managerless after the sacking of Marti Cifuentes last month, and the club is also looking for a new chief executive, technical director and commercial manager.\n\nFans disillusioned with the club’s shocking decline over the past three years have called for the board to be sacked, but at present there is hardly a board to sack.\n\nThe sanction will hit them hard just when they were already buckling to their knees, but they need to act now to ensure it doesn’t prove to be a knockout blow.",
  "paragraph_count": 32
}