{
  "url": "https://www.nytimes.com/athletic/7027050/2026/02/06/arsenal-news-odegaard-timber-saka-injury-sunderland/",
  "scraped_at": "2026-02-07T00:16:26.421285",
  "title": "Martin Odegaard ‘a matter of days’ and Bukayo Saka to make Arsenal return ‘soon’ – Mikel Arteta",
  "author": "",
  "published_date": "Feb. 6, 2026 10:58 pm GMT+8",
  "content": "Mikel Arteta claims that Arsenal’s Martin Odegaard, Jurrien Timber, Bukayo Saka and Max Dowman are all progressing well, but may have different return dates for their respective injuries.\n\nTimber, 24, and club captain Odegaard, 27, are most likely to come back ahead of this weekend’s clash with Sunderland, after the Dutchman missed a Thursday training session and the latter was absent from the midweek win over Chelsea with a muscular issue.\n\nOn the pair, Arteta said: “Martin is getting better, it will be a matter of days we believe, and Jurrien is fine.”\n\nSaka, 24, was initially meant to start Arsenal’s 4-0 win away to Leeds United last weekend, but pulled out of the lineup due to a hip injury sustained in the warm-up.\n\nAsked whether the England international would be ready for this weekend, the Arsenal manager would not be drawn into specifics, but added: “His hip is getting much better. Hopefully, he will be with us very soon.”\n\nNoni Madueke has started the last two matches in Saka’s absence, impressing with a goal and an assist in the first half against Leeds. When Madueke has needed a breather in the past week, Arteta has turned to Gabriel Martinelli to play out the end of matches on the right wing.\n\nMax Dowman could be an option on that flank when he returns to fitness, but the 16-year-old is still recovering from an ankle injury he sustained in December.\n\n“Max hasn’t trained with us yet, so it will be a few weeks but he’s getting better.” Arteta said ahead of Sunderland.\n\nLast week he explained: “(It was) a little bit more than Mosquera’s (ankle injury). He’s growing, and we need to be very careful and a little bit more protective. He has a different schedule as well because he needs to go to school, so we need to respect a lot of things throughout that process, but I think he’s quite close. He’s on the pitch now, he’s doing well, and hopefully we’re going to be able to see him soon.”\n\nArsenal are in a relatively good place in regard to injuries, considering where they have been at points earlier this season when they went periods without six attackers.\n\nThey also benefit from a longer gap between their matches between Sunderland and Brentford (five days), to help their fit players recover.\n\nSunderland head coach Regis Le Bris confirmed on Friday that captain Granit Xhaka will be unavailable for the trip to the Emirates to face the club that he represented for seven seasons. The 33-year-old Switzerland international has missed Sunderland’s last two games with an ankle injury, with Le Bris saying: “His (Xhaka’s) presence around the team is still really strong. We look forward to having the best version of him back soon.”\n\nPlaying before Manchester City this weekend, Arsenal have the chance to go nine points clear at the top of the Premier League before Pep Guardiola’s side face Liverpool at Anfield.",
  "paragraph_count": 13
}