{
  "url": "https://www.nytimes.com/athletic/7026573/2026/02/06/gordon-guimaraes-newcastle-injury-latest/",
  "scraped_at": "2026-02-06T18:16:42.015219",
  "title": "Newcastle’s Anthony Gordon set to miss Brentford game, Bruno Guimaraes ‘closer’ to return",
  "author": "",
  "published_date": "Feb. 6, 2026 6:11 pm GMT+8",
  "content": "Eddie Howe expects Anthony Gordon will miss Newcastle United’s Premier League game at Brentford on Saturday but his hamstring injury is not considered serious, while Bruno Guimaraes is “close” to a return.\n\nGordon was forced off in the first half of Wednesday’s Carabao Cup semi-final defeat to Manchester City but Howe was hopeful he would be fit to return “pretty soon”.\n\nGuimaraes, 28, has missed his side’s last three matches in all competitions with an ankle injury and Howe said there was a chance he could be in contention for the weekend.\n\n“No major update on Anthony,” the Newcastle head coach told a press conference on Friday. “Probably every chance he’ll miss this game coming up at the weekend but we hope it’s not a serious injury and he’ll be back pretty soon.\n\n“(Guimaraes is) getting closer. He did a training session on Wednesday when we were travelling. He felt pretty good. So I’ll see him today and fingers crossed he’ll be fit.”\n\nGordon, 24, has provided 10 goals and four assists in 33 appearances in all competitions this season, while Newcastle are yet to win a Premier League match that Guimaraes has not started since he made his full debut for the club four years ago.\n\nLewis Miley also missed Wednesday’s defeat to City, and Howe said his injury was not considered serious, with a decision on his availability expected later on Friday.\n\n“We’ll find out today (on Lewis Miley),” Howe added. “I’m awaiting an update on him but again it’s not a serious injury and we hope he’ll be back very soon.”\n\nNewcastle are 11th in the Premier League and following the visit of Brentford on Saturday, they travel to Tottenham Hotspur on Tuesday.",
  "paragraph_count": 9
}