{
  "url": "https://www.nytimes.com/athletic/7026710/2026/02/06/nottingham-forest-europa-league-squad/",
  "scraped_at": "2026-02-06T20:13:56.800775",
  "title": "Nottingham Forest Europa League squad: No Netz and Ortega, Hutchinson, Lucca and Cunha added",
  "author": "",
  "published_date": "Feb. 6, 2026Updated 8:00 pm GMT+8",
  "content": "Nottingham Forest have drafted new signing Lorenzo Lucca, record signing Omari Hutchinson and defender Jair Cunha into their Europa League squad, but there is no place for new additions Luca Netz or Stefen Ortega.\n\nThere was surprise in the summer when Nuno Espirito Santo opted to leave Hutchinson, a £37.5million ($51m) signing from Ipswich Town, out of the European squad submitted to UEFA.\n\nBut that has been addressed by Sean Dyche, who has bolstered his attacking options not only with the addition of Hutchinson, but also with that of Italy international forward Lucca, who joined on loan from Napoli in January, with a €40m option to make the move permanent.\n\nThe fact Ortega, the goalkeeper signed for £500,000 from Manchester City, is not included indicates the club are hopeful Matz Sels’ groin injury will not keep him sidelined for long, with Scotland international Angus Gunn the only other senior stopper included.\n\nLeft-back Netz, the 22-year-old, £1.1m signing from Borussia Monchengladbach, is regarded as being a bright prospect for the future and as somebody who can evolve with Premier League experience.\n\n“He is one among a number of players brought in for what comes next. That doesn’t mean he can’t play now but there’s a future thinking behind that as well,” said Dyche in his press conference before Friday’s game against Leeds United in the Premier League.\n\nWith Netz not included in the Europa League squad, Forest will rely on Ola Aina, Neco Williams — both right-footed players who are comfortable on the left — Morato and Murillo as left-back cover.\n\nForest face Fenerbahce in the play-off round of the competition as they aim to progress to the last 16. Forest head to Turkey on Thursday, February 19, before the return leg at the City Ground a week later.\n\nBeyond the List A of senior players, clubs can also utilise young players born after January 2004 in the competition as part of their List B. Players must have been registered at the club for two uninterrupted years to be eligible for List B.\n\nGoalkeepers: Angus Gunn, Matz Sels\n\nDefenders: Ola Aina, Murillo, Jair Cunha, Nikola Milenkovic, Morato, Nicolo Savona, Neco Williams\n\nMidfielders: Elliot Anderson, Nicolas Dominguez, Morgan Gibbs-White, James McAtee, Ibrahim Sangare, Ryan Yates\n\nForwards: Dilane Bakwa, Omari Hutchinson, Callum Hudson-Odoi, Lorenzo Lucca, Igor Jesus, Dan Ndoye, Chris Wood",
  "paragraph_count": 13
}