{
  "url": "https://www.nytimes.com/athletic/7023890/2026/02/06/tel-and-gallagher-added-to-tottenhams-champions-league-squad-bissouma-and-kulusevski-remain-out/",
  "scraped_at": "2026-02-06T18:16:48.880941",
  "title": "Tel and Gallagher added to Tottenham’s Champions League squad, Bissouma and Kulusevski remain out",
  "author": "",
  "published_date": "Feb. 6, 2026Updated 5:58 pm GMT+8",
  "content": "Mathys Tel, Conor Gallagher and Radu Dragusin have been added to Tottenham Hotspur’s Champions League squad but Yves Bissouma, Dejan Kulusevski and James Maddison remain out, while newly-injured pair Ben Davies and Rodrigo Bentancur have also been excluded.\n\nGallagher, the €40million (£34.7m; $46.6m) signing from Atletico Madrid, counts as an association-trained player and effectively replaces Brennan Johnson in the squad-list for the knockouts. Johnson joined Crystal Palace for a fee approaching £35million (€40m; $47m) last month.\n\nThere is also a place for Tel, who was omitted from Spurs’ initial squad for the league phase in September, along with Bissouma, Dragusin, Kulusevski and Maddison.\n\nTel was subsequently added as a replacement for the injured Dominic Solanke in December, before being removed again last month for the final two matches following the England forward’s return to fitness.\n\nBentancur and Davies are expected to miss the majority of the rest of the season with hamstring and ankle injuries, respectively.\n\nNeither Maddison nor Kulusevski has played this season due to serious knee injuries, but Dragusin is fit again after starting the campaign with a cruciate ligament injury.\n\nUEFA rules stipulate that teams can name a squad of up to 25 players for their competitions. Eight of those 25 need to be ‘locally-trained’ and they are split into two different categories.\n\nClub-trained players must have been registered with the club for at least three seasons between the ages of 15 and 21, while association-trained players must have been registered with a club in the same association (country) for at least three seasons between the ages of 15 and 21.\n\nSpurs have only one club-trained player in their European squad, third-choice goalkeeper Brandon Austin, when they are require to name four. As a consequence, they must leave three places in the squad empty, and will only be able to register a reduced roster of 22 players in the knockouts.\n\nTottenham finished fourth in the Champions League initial phase and will be seeded for the round-of-16. They will face one of Juventus, Galatasaray, Club Brugge and Atletico Madrid in a two-legged tie, with the decider in north London.\n\nTottenham’s Champions League squad for the knockout phase (A-List only):",
  "paragraph_count": 11
}