{
  "url": "https://www.nytimes.com/athletic/7027130/2026/02/06/vaibhav-suryavanshi-u19s-world-cup-record-14/",
  "scraped_at": "2026-02-07T00:16:05.183665",
  "title": "Vaibhav Suryavanshi, 14, propels India to U19s World Cup win with record-breaking hundred",
  "author": "",
  "published_date": "Feb. 7, 2026Updated 12:11 am GMT+8",
  "content": "The prodigiously talented teenager Vaibhav Suryavanshi hit a stunning 175 off just 80 balls, the highest score recorded in men’s or women’s ICC tournament final history at youth or senior level, as India beat England to win the Under-19s World Cup.\n\nThe 14-year-old smashed a record 150 runs in boundaries alone — he struck 15 sixes and 15 fours in Harare — in a blistering assault on the English bowling, with his last 151 runs coming off just 56 deliveries.\n\nHis tally of sixes is the most ever recorded in a youth one-day international (ODI) innings, eclipsing his own record of 14 set against United Arab Emirates last December.\n\nSuryavanshi, who ended up with a strike rate of 218.75, was eventually caught behind off Manny Lumsden to leave India 251-3, but his team-mates took them up to 411-9 from their 50 overs. England eventually fell 100 runs short despite Caleb Falconer scoring 115 off 67 balls, their quickest ever youth-international century.\n\n“I can’t express what I am feeling, but the way we have all been working hard for the last seven to eight months and our support staff who have been with us for a long time and always made sure we are alright, I would like to dedicate the award to them,” said Suryavanshi at the post-match presentation when he claimed the player of the match and tournament awards.\n\n“We weren’t taking too much pressure. We just thought how we had done well in the tournament, we’ll just follow our process and play our natural games. The preparation has been good not only during the Asia Cup, but the last eight to nine months. And only the players know how hard we have worked in that period.\n\n“I had faith in my skills that I can contribute in big games and today it happened.”\n\nSuryavanshi, even at 14, has already established a fine reputation in the game. Playing for Rajasthan Royals in the Indian Premier League (IPL), he hit his first ball in the competition for six and, in April, became the youngest player to hit a T20 hundred.\n\nThat 35-ball century against Gujarat Titans was the second-fasted in IPL history, behind only Chris Gayle’s 30-ball effort in 2013.\n\nIn July he struck a 52-ball century against England, the quickest in a youth ODI, and made 144 off 42 balls against the UAE in their Asia Cup Rising Starts T20 fixture in November. His magnificent innings in Harare means he has now hit 10 or more sixes five times in a youth ODI. All other batters combined have only achieved that on three occasions.\n\n“It’s always going to be tough when a player like Vaibhav gets going,” said the England captain, Thomas Rew. “We were left scratching our heads a little bit. We did our research. We wanted to use our change-ups. That’s what’s worked for us previously against India, but today Vaibhav came off.”\n\nSuryavanshi finished the tournament as leading run scorer with 439 at an impressive average of 62.71. India’s success means they have claimed the Under-19s World Cup a record six times, with England’s wait to lift the trophy now extended to 28 years.\n\nIndia captain, Ayush Mhatre, added: “We have no words for his innings. We know he is a fabulous batsman and he’s shown in this match what he can do.”",
  "paragraph_count": 13
}