{
  "url": "https://www.nytimes.com/athletic/7026732/2026/02/06/wolves-emmanuel-agbadou-besiktas-jhon-arias-palmeiras/",
  "scraped_at": "2026-02-06T22:19:56.996760",
  "title": "Wolves’ Rob Edwards says Agbadou nearing Besiktas move, Arias close to Palmeiras transfer",
  "author": "",
  "published_date": "Feb. 6, 2026 10:10 pm GMT+8",
  "content": "Wolverhampton Wanderers head coach Rob Edwards said that centre-back Emmanuel Agbadou and winger Jhon Arias are both close to completing deals to leave Molineux.\n\nAgbadou is in Turkey to complete a transfer to Besiktas. Sources briefed on the situation, speaking on the condition of anonymity, expect the deal to be worth £15.6million to the Premier League club, with a further £1.7m in add-ons set to be achieved by the end of the season.\n\nIn a statement, Besiktas confirmed that negotiations with Wolves for the defender were ongoing. Edwards confirmed at his press conference on Friday that Agbadou had travelled to complete the deal.\n\nBrazilian club Palmeiras are closing in on completing a deal for Arias, bringing the Colombia international back to Brazil after four years with Fluminense. Sources briefed on the situation expect the package for the 28-year-old to be worth £21.7m.\n\nWhen asked about Arias’ situation on Friday, Edwards said: “I think there’s a deal agreed now with the clubs, so I expect that one to happen in the coming days as well.”\n\nCentre-back Agbadou joined Wolves in January 2025 from Reims and played a vital role in helping the club avoid relegation under former head coach Vitor Pereira.\n\nBut the 28-year-old has suffered a slump in form this season and has become a regular substitute under Pereira’s successor Rob Edwards. The Ivory Coast international has made 35 appearances for Wolves in total.\n\nArias joined Wolves from Fluminense in the summer after an impressive Club World Cup but has struggled to make an impact in the Premier League despite an upturn in form in recent weeks. He has made 26 appearances for Wolves so far. Fluminense inserted a buyback clause in the deal that gave them the right to match any bids accepted by Wolves.\n\nWolves sold Jorgen Strand Larsen to Crystal Palace in January for £43m with a further £5m in add-ons as well as loaning out Marshall Munetsi, Fer Lopez, and Tawanda Chirewa.\n\nThey signed Adam Armstrong on a permanent deal from Southampton and Angel Gomes on loan from Marseille as they begin rebuilding their squad for the Championship, with relegation from the Premier League all-but inevitable.\n\nThey are able to sell Agbadou and Arias because the transfer windows in Turkey and Brazil are still open.\n\nEdwards’ side, bottom of the table on eight points, host Chelsea on Saturday.",
  "paragraph_count": 12
}